/* automatically generated by rust-bindgen 0.72.1 */

pub enum GrContext_Base {}
pub enum GrImageContext {}
pub enum GrImageContextPriv {}
pub enum GrContextThreadSafeProxy {}
pub enum GrContextThreadSafeProxyPriv {}
pub enum GrRecordingContextPriv {}
pub enum GrContextPriv {}
pub enum SkVerticesPriv {}
pub enum SkUnicode {}

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {

                let index = if cfg!(target_endian = "big") {
                    bit_width as usize - 1 - i
                } else {
                    i
                };
                val |= 1 << index;
            }
        }
        val
    }
    #[inline]
    pub unsafe fn raw_get(this: *const Self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < core::mem::size_of::<Storage>());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= core::mem::size_of::<Storage>());
        let mut val = 0;
        for i in 0..(bit_width as usize) {
            if unsafe { Self::raw_get_bit(this, i + bit_offset) } {
                let index = if cfg!(target_endian = "big") {
                    bit_width as usize - 1 - i
                } else {
                    i
                };
                val |= 1 << index;
            }
        }
        val
    }
    #[inline]
    pub fn set(&mut self, bit_offset: usize, bit_width: u8, val: u64) {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < self.storage.as_ref().len());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= self.storage.as_ref().len());
        for i in 0..(bit_width as usize) {
            let mask = 1 << i;
            let val_bit_is_set = val & mask == mask;
            let index = if cfg!(target_endian = "big") {
                bit_width as usize - 1 - i
            } else {
                i
            };
            self.set_bit(index + bit_offset, val_bit_is_set);
        }
    }
    #[inline]
    pub unsafe fn raw_set(this: *mut Self, bit_offset: usize, bit_width: u8, val: u64) {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < core::mem::size_of::<Storage>());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= core::mem::size_of::<Storage>());
        for i in 0..(bit_width as usize) {
            let mask = 1 << i;
            let val_bit_is_set = val & mask == mask;
            let index = if cfg!(target_endian = "big") {
                bit_width as usize - 1 - i
            } else {
                i
            };
            unsafe { Self::raw_set_bit(this, index + bit_offset, val_bit_is_set) };
        }
    }
}
#[doc = r" If Bindgen could only determine the size and alignment of a"]
#[doc = r" type, it is represented like this."]
#[derive(PartialEq, Copy, Clone, Debug, Hash)]
#[repr(C)]
pub struct __BindgenOpaqueArray<T: Copy, const N: usize>(pub [T; N]);
impl<T: Copy + Default, const N: usize> Default for __BindgenOpaqueArray<T, N> {
    fn default() -> Self {
        Self([<T as Default>::default(); N])
    }
}
pub type va_list = *mut ::core::ffi::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::core::ffi::c_ulong,
    pub _Byte: ::core::ffi::c_ushort,
    pub _State: ::core::ffi::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::core::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::core::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::core::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::core::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::core::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type std_integral_constant_value_type<_Ty> = _Ty;
pub type std_integral_constant_type = u8;
pub type std_bool_constant = u8;
pub type std_true_type = u8;
pub type std_conditional_type<_Ty1> = _Ty1;
pub type std_conditional_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_cv {
    pub _address: u8,
}
pub type std_remove_cv_type<_Ty> = _Ty;
pub type std_remove_cv__Apply = u8;
pub type std_remove_cv_t = std_remove_cv;
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum std_byte {
    __bindgen_cannot_repr_c_on_empty_enum = 0,
}
pub type std__Select__Apply<_Ty1> = _Ty1;
#[repr(C)]
#[repr(align(1))]
#[derive(Debug, Copy, Clone)]
pub struct std_strong_ordering {
    pub _bindgen_opaque_blob: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_strong_ordering"][::core::mem::size_of::<std_strong_ordering>() - 1usize];
    ["Alignment of std_strong_ordering"][::core::mem::align_of::<std_strong_ordering>() - 1usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?less@strong_ordering@std@@2U12@B"]
    pub static std_strong_ordering_less: std_strong_ordering;
}
unsafe extern "C" {
    #[link_name = "\u{1}?equal@strong_ordering@std@@2U12@B"]
    pub static std_strong_ordering_equal: std_strong_ordering;
}
unsafe extern "C" {
    #[link_name = "\u{1}?equivalent@strong_ordering@std@@2U12@B"]
    pub static std_strong_ordering_equivalent: std_strong_ordering;
}
unsafe extern "C" {
    #[link_name = "\u{1}?greater@strong_ordering@std@@2U12@B"]
    pub static std_strong_ordering_greater: std_strong_ordering;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_input_iterator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_input_iterator_tag"][::core::mem::size_of::<std_input_iterator_tag>() - 1usize];
    ["Alignment of std_input_iterator_tag"]
        [::core::mem::align_of::<std_input_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_forward_iterator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_forward_iterator_tag"]
        [::core::mem::size_of::<std_forward_iterator_tag>() - 1usize];
    ["Alignment of std_forward_iterator_tag"]
        [::core::mem::align_of::<std_forward_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bidirectional_iterator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_bidirectional_iterator_tag"]
        [::core::mem::size_of::<std_bidirectional_iterator_tag>() - 1usize];
    ["Alignment of std_bidirectional_iterator_tag"]
        [::core::mem::align_of::<std_bidirectional_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_random_access_iterator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_random_access_iterator_tag"]
        [::core::mem::size_of::<std_random_access_iterator_tag>() - 1usize];
    ["Alignment of std_random_access_iterator_tag"]
        [::core::mem::align_of::<std_random_access_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_contiguous_iterator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_contiguous_iterator_tag"]
        [::core::mem::size_of::<std_contiguous_iterator_tag>() - 1usize];
    ["Alignment of std_contiguous_iterator_tag"]
        [::core::mem::align_of::<std_contiguous_iterator_tag>() - 1usize];
};
pub type std_iter_difference_t = std_conditional_t;
pub type std_iter_value_t = std_conditional_t;
pub type std_iter_reference_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Iterator_traits_base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator_traits {
    pub _address: u8,
}
pub type std_iterator_traits__From_primary = std_iterator_traits;
pub type std__Iter_ref_t = std_iter_reference_t;
pub type std__Iter_value_t = std_iter_value_t;
pub type std__Iter_diff_t = std_iter_difference_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reverse_iterator<_BidIt> {
    pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<_BidIt>>,
    pub current: _BidIt,
}
pub type std_reverse_iterator_iterator_type<_BidIt> = _BidIt;
pub type std_reverse_iterator_iterator_concept = std_conditional_t;
pub type std_reverse_iterator_iterator_category = std_conditional_t;
pub type std_reverse_iterator_value_type = std__Iter_value_t;
pub type std_reverse_iterator_difference_type = std__Iter_diff_t;
pub type std_reverse_iterator_pointer = std_iterator_traits;
pub type std_reverse_iterator_reference = std__Iter_ref_t;
pub type std_reverse_iterator__Prevent_inheriting_unwrap<_BidIt> = std_reverse_iterator<_BidIt>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits {
    pub _address: u8,
}
pub type std__Rebind_alloc_t = std_allocator_traits;
#[repr(C)]
#[derive(Debug)]
pub struct std_allocator {
    pub _address: u8,
}
pub type std_allocator__From_primary = std_allocator;
pub type std_allocator_value_type<_Ty> = _Ty;
pub type std_allocator_size_type = ::core::ffi::c_ulonglong;
pub type std_allocator_difference_type = ::core::ffi::c_longlong;
pub type std_allocator_propagate_on_container_move_assignment = std_true_type;
pub type std_allocator_is_always_equal = std_true_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Container_base0 {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Container_base0"][::core::mem::size_of::<std__Container_base0>() - 1usize];
    ["Alignment of std__Container_base0"][::core::mem::align_of::<std__Container_base0>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Iterator_base0 {
    pub _address: u8,
}
pub const std__Iterator_base0__Unwrap_when_unverified: bool = true;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Iterator_base0"][::core::mem::size_of::<std__Iterator_base0>() - 1usize];
    ["Alignment of std__Iterator_base0"][::core::mem::align_of::<std__Iterator_base0>() - 1usize];
};
pub type std__Container_base = std__Container_base0;
pub type std__Iterator_base = std__Iterator_base0;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Vector_const_iterator<_Myvec> {
    pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<_Myvec>>,
    pub _Ptr: std__Vector_const_iterator__Tptr<_Myvec>,
}
pub type std__Vector_const_iterator_iterator_concept = std_contiguous_iterator_tag;
pub type std__Vector_const_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__Vector_const_iterator_value_type<_Myvec> = _Myvec;
pub type std__Vector_const_iterator_difference_type<_Myvec> = _Myvec;
pub type std__Vector_const_iterator_pointer<_Myvec> = _Myvec;
pub type std__Vector_const_iterator_reference<_Myvec> =
    *const std__Vector_const_iterator_value_type<_Myvec>;
pub type std__Vector_const_iterator__Tptr<_Myvec> = _Myvec;
pub type std__Vector_const_iterator__Prevent_inheriting_unwrap<_Myvec> =
    std__Vector_const_iterator<_Myvec>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Vector_iterator<_Myvec> {
    pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<_Myvec>>,
    pub _base: std__Vector_const_iterator<_Myvec>,
}
pub type std__Vector_iterator__Mybase<_Myvec> = std__Vector_const_iterator<_Myvec>;
pub type std__Vector_iterator_iterator_concept = std_contiguous_iterator_tag;
pub type std__Vector_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__Vector_iterator_value_type<_Myvec> = _Myvec;
pub type std__Vector_iterator_difference_type<_Myvec> = _Myvec;
pub type std__Vector_iterator_pointer<_Myvec> = _Myvec;
pub type std__Vector_iterator_reference<_Myvec> = *mut std__Vector_iterator_value_type<_Myvec>;
pub type std__Vector_iterator__Prevent_inheriting_unwrap<_Myvec> = std__Vector_iterator<_Myvec>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Vector_val<_Val_types> {
    pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<_Val_types>>,
    pub _Myfirst: std__Vector_val_pointer<_Val_types>,
    pub _Mylast: std__Vector_val_pointer<_Val_types>,
    pub _Myend: std__Vector_val_pointer<_Val_types>,
}
pub type std__Vector_val_value_type<_Val_types> = _Val_types;
pub type std__Vector_val_size_type<_Val_types> = _Val_types;
pub type std__Vector_val_difference_type<_Val_types> = _Val_types;
pub type std__Vector_val_pointer<_Val_types> = _Val_types;
pub type std__Vector_val_const_pointer<_Val_types> = _Val_types;
pub type std__Vector_val_reference<_Val_types> = *mut std__Vector_val_value_type<_Val_types>;
pub type std__Vector_val_const_reference<_Val_types> =
    *const std__Vector_val_value_type<_Val_types>;
pub type std_streamoff = ::core::ffi::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_fpos<_Statetype> {
    pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<_Statetype>>,
    pub _Myoff: std_streamoff,
    pub _Fpos: ::core::ffi::c_longlong,
    pub _Mystate: _Statetype,
}
pub type std_streampos = std_fpos<_Mbstatet>;
pub type std__Choose_atomic_base_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_atomic {
    pub _address: u8,
}
pub type std_atomic__Base = std__Choose_atomic_base_t;
pub type std_atomic_value_type<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_default_delete {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_deleter_pointer_type {
    pub _address: u8,
}
pub type std__Get_deleter_pointer_type_type<_Ty> = *mut _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unique_ptr {
    pub _address: u8,
}
pub type std_unique_ptr_pointer = std__Get_deleter_pointer_type;
pub type std_unique_ptr_element_type<_Ty> = _Ty;
pub type std_unique_ptr_deleter_type<_Dx> = _Dx;
pub type std__SMF_control_move_assign = std_conditional_t;
pub type std__SMF_control = std__SMF_control_move_assign;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Nontrivial_dummy_type {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Nontrivial_dummy_type"]
        [::core::mem::size_of::<std__Nontrivial_dummy_type>() - 1usize];
    ["Alignment of std__Nontrivial_dummy_type"]
        [::core::mem::align_of::<std__Nontrivial_dummy_type>() - 1usize];
};
#[repr(C)]
pub union std__Optional_destruct_base__bindgen_ty_1 {
    pub _Dummy: std__Nontrivial_dummy_type,
    pub _Value: std_remove_cv_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Optional_construct_base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_optional {
    pub _address: u8,
}
pub type std_optional__Mybase = std__SMF_control;
pub type std_optional_value_type<_Ty> = _Ty;
pub type std_optional__AllowDirectConversion = std_bool_constant;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_optional__AllowUnwrapping {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_optional__AllowUnwrappingAssignment {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Char_traits {
    pub _address: u8,
}
pub type std__Char_traits_char_type<_Elem> = _Elem;
pub type std__Char_traits_int_type<_Int_type> = _Int_type;
pub type std__Char_traits_pos_type = std_streampos;
pub type std__Char_traits_off_type = std_streamoff;
pub type std__Char_traits_state_type = _Mbstatet;
pub type std__Char_traits_comparison_category = std_strong_ordering;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_char_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string_view {
    pub _address: u8,
}
pub type std_basic_string_view_traits_type = u8;
pub type std_basic_string_view_value_type = u8;
pub type std_basic_string_view_pointer = u8;
pub type std_basic_string_view_const_pointer = u8;
pub type std_basic_string_view_reference = u8;
pub type std_basic_string_view_const_reference = u8;
pub type std_basic_string_view_const_iterator = u8;
pub type std_basic_string_view_iterator = u8;
pub type std_basic_string_view_const_reverse_iterator = u8;
pub type std_basic_string_view_reverse_iterator = u8;
pub type std_basic_string_view_size_type = u64;
pub type std_basic_string_view_difference_type = u64;
pub type std_string_view = __BindgenOpaqueArray<u64, 2usize>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string {
    pub _address: u8,
}
pub type std_basic_string__Alty = u8;
pub type std_basic_string__Alty_traits = u8;
pub type std_basic_string__Scary_val = u8;
pub type std_basic_string_traits_type = u8;
pub type std_basic_string_allocator_type = u8;
pub type std_basic_string_value_type = u8;
pub type std_basic_string_size_type = u8;
pub type std_basic_string_difference_type = u8;
pub type std_basic_string_pointer = u8;
pub type std_basic_string_const_pointer = u8;
pub type std_basic_string_reference = u8;
pub type std_basic_string_const_reference = u8;
pub type std_basic_string_iterator = u8;
pub type std_basic_string_const_iterator = u8;
pub type std_basic_string_reverse_iterator = u8;
pub type std_basic_string_const_reverse_iterator = u8;
pub type std_basic_string__Is_elem_cptr = u8;
pub type std_basic_string__Is_string_view_ish = u8;
impl std_basic_string__Allocation_policy {
    pub const _Exactly: std_basic_string__Allocation_policy =
        std_basic_string__Allocation_policy::_At_least;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum std_basic_string__Allocation_policy {
    _At_least = 0,
}
impl std_basic_string__Construct_strategy {
    pub const _From_ptr: std_basic_string__Construct_strategy =
        std_basic_string__Construct_strategy::_From_char;
}
impl std_basic_string__Construct_strategy {
    pub const _From_string: std_basic_string__Construct_strategy =
        std_basic_string__Construct_strategy::_From_char;
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum std_basic_string__Construct_strategy {
    _From_char = 0,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string__Released_buffer {
    pub _address: u8,
}
pub type std_string = __BindgenOpaqueArray<u64, 4usize>;
pub type std__Array_const_iterator_iterator_concept = std_contiguous_iterator_tag;
pub type std__Array_const_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__Array_const_iterator_value_type<_Ty> = _Ty;
pub type std__Array_const_iterator_difference_type = ::core::ffi::c_longlong;
pub type std__Array_const_iterator_pointer<_Ty> = *const _Ty;
pub type std__Array_const_iterator_reference<_Ty> = *const _Ty;
pub const std__Array_const_iterator__EEN_SIZE: std__Array_const_iterator__bindgen_ty_1 =
    std__Array_const_iterator__bindgen_ty_1::_EEN_SIZE;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum std__Array_const_iterator__bindgen_ty_1 {
    _EEN_SIZE = 0,
}
pub type std__Array_const_iterator__Prevent_inheriting_unwrap = u8;
pub type std__Array_iterator__Mybase = u8;
pub type std__Array_iterator_iterator_concept = std_contiguous_iterator_tag;
pub type std__Array_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__Array_iterator_value_type<_Ty> = _Ty;
pub type std__Array_iterator_difference_type = ::core::ffi::c_longlong;
pub type std__Array_iterator_pointer<_Ty> = *mut _Ty;
pub type std__Array_iterator_reference<_Ty> = *mut _Ty;
pub const std__Array_iterator__EEN_SIZE: std__Array_iterator__bindgen_ty_1 =
    std__Array_iterator__bindgen_ty_1::_EEN_SIZE;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum std__Array_iterator__bindgen_ty_1 {
    _EEN_SIZE = 0,
}
pub type std__Array_iterator__Prevent_inheriting_unwrap = u8;
pub type std_bitset__Ty = std_conditional_t;
#[repr(C)]
#[derive(Debug)]
pub struct std_bitset_reference {
    pub _Pbitset: *mut u8,
    pub _Mypos: ::core::ffi::c_ulonglong,
}
unsafe extern "C" {
    #[link_name = "\u{1}_Need_mask"]
    pub static std_bitset__Need_mask: bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}_Mask"]
    pub static std_bitset__Mask: ::core::ffi::c_ulonglong;
}
unsafe extern "C" {
    #[link_name = "\u{1}_Bitsperword"]
    pub static std_bitset__Bitsperword: ::core::ffi::c_longlong;
}
unsafe extern "C" {
    #[link_name = "\u{1}_Words"]
    pub static std_bitset__Words: ::core::ffi::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_function_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_function {
    pub _address: u8,
}
pub type std_function__Mybase = std__Get_function_impl;
pub type FILE = u64;
pub type SkUnichar = i32;
pub type SkGlyphID = u16;
#[repr(C)]
pub struct SkRefCntBase__bindgen_vtable(::core::ffi::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct SkRefCntBase {
    pub vtable_: *const SkRefCntBase__bindgen_vtable,
    pub fRefCnt: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkRefCntBase"][::core::mem::size_of::<SkRefCntBase>() - 16usize];
    ["Alignment of SkRefCntBase"][::core::mem::align_of::<SkRefCntBase>() - 8usize];
    ["Offset of field: SkRefCntBase::fRefCnt"]
        [::core::mem::offset_of!(SkRefCntBase, fRefCnt) - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct SkRefCnt {
    pub _base: SkRefCntBase,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkRefCnt"][::core::mem::size_of::<SkRefCnt>() - 16usize];
    ["Alignment of SkRefCnt"][::core::mem::align_of::<SkRefCnt>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct SkNVRefCnt {
    pub fRefCnt: u32,
}
#[repr(C)]
#[derive(Debug)]
pub struct sk_sp<T> {
    pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    pub fPtr: *mut T,
}
pub type sk_sp_element_type<T> = T;
pub type sk_sp_sk_is_trivially_relocatable = std_true_type;
pub type U8CPU = ::core::ffi::c_uint;
pub type SkScalar = f32;
#[repr(C)]
#[derive(Debug)]
pub struct SkString {
    pub fRec: sk_sp<SkString_Rec>,
}
pub type SkString_sk_is_trivially_relocatable = std_true_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkString_Rec {
    pub fLength: u32,
    pub fRefCnt: u32,
    pub fBeginningOfData: [::core::ffi::c_char; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkString_Rec"][::core::mem::size_of::<SkString_Rec>() - 12usize];
    ["Alignment of SkString_Rec"][::core::mem::align_of::<SkString_Rec>() - 4usize];
    ["Offset of field: SkString_Rec::fLength"]
        [::core::mem::offset_of!(SkString_Rec, fLength) - 0usize];
    ["Offset of field: SkString_Rec::fRefCnt"]
        [::core::mem::offset_of!(SkString_Rec, fRefCnt) - 4usize];
    ["Offset of field: SkString_Rec::fBeginningOfData"]
        [::core::mem::offset_of!(SkString_Rec, fBeginningOfData) - 8usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?Make@Rec@SkString@@SA?AV?$sk_sp@URec@SkString@@@@QEBD_K@Z"]
    pub fn SkString_Rec_Make(text: *const ::core::ffi::c_char, len: usize) -> sk_sp<SkString_Rec>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?ref@Rec@SkString@@QEBAXXZ"]
    pub fn SkString_Rec_ref(this: *const SkString_Rec);
}
unsafe extern "C" {
    #[link_name = "\u{1}?unref@Rec@SkString@@QEBAXXZ"]
    pub fn SkString_Rec_unref(this: *const SkString_Rec);
}
unsafe extern "C" {
    #[link_name = "\u{1}?unique@Rec@SkString@@QEBA_NXZ"]
    pub fn SkString_Rec_unique(this: *const SkString_Rec) -> bool;
}
impl SkString_Rec {
    #[inline]
    pub unsafe fn Make(text: *const ::core::ffi::c_char, len: usize) -> sk_sp<SkString_Rec> {
        SkString_Rec_Make(text, len)
    }
    #[inline]
    pub unsafe fn ref_(&self) {
        SkString_Rec_ref(self)
    }
    #[inline]
    pub unsafe fn unref(&self) {
        SkString_Rec_unref(self)
    }
    #[inline]
    pub unsafe fn unique(&self) -> bool {
        SkString_Rec_unique(self)
    }
}
unsafe extern "C" {
    #[link_name = "\u{1}?gEmptyRec@SkString@@0URec@1@B"]
    pub static SkString_gEmptyRec: SkString_Rec;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkString"][::core::mem::size_of::<SkString>() - 8usize];
    ["Alignment of SkString"][::core::mem::align_of::<SkString>() - 8usize];
    ["Offset of field: SkString::fRec"][::core::mem::offset_of!(SkString, fRec) - 0usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?equals@SkString@@QEBA_NAEBV1@@Z"]
    pub fn SkString_equals(this: *const SkString, arg1: *const SkString) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?equals@SkString@@QEBA_NQEBD@Z"]
    pub fn SkString_equals1(this: *const SkString, text: *const ::core::ffi::c_char) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?equals@SkString@@QEBA_NQEBD_K@Z"]
    pub fn SkString_equals2(
        this: *const SkString,
        text: *const ::core::ffi::c_char,
        len: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?data@SkString@@QEAAPEADXZ"]
    pub fn SkString_data(this: *mut SkString) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}?reset@SkString@@QEAAXXZ"]
    pub fn SkString_reset(this: *mut SkString);
}
unsafe extern "C" {
    #[link_name = "\u{1}?resize@SkString@@QEAAX_K@Z"]
    pub fn SkString_resize(this: *mut SkString, len: usize);
}
unsafe extern "C" {
    #[link_name = "\u{1}?set@SkString@@QEAAXQEBD@Z"]
    pub fn SkString_set(this: *mut SkString, text: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    #[link_name = "\u{1}?set@SkString@@QEAAXQEBD_K@Z"]
    pub fn SkString_set1(this: *mut SkString, text: *const ::core::ffi::c_char, len: usize);
}
unsafe extern "C" {
    #[link_name = "\u{1}?insert@SkString@@QEAAX_KQEBD@Z"]
    pub fn SkString_insert(this: *mut SkString, offset: usize, text: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    #[link_name = "\u{1}?insert@SkString@@QEAAX_KQEBD0@Z"]
    pub fn SkString_insert1(
        this: *mut SkString,
        offset: usize,
        text: *const ::core::ffi::c_char,
        len: usize,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?insertUnichar@SkString@@QEAAX_KH@Z"]
    pub fn SkString_insertUnichar(this: *mut SkString, offset: usize, arg1: SkUnichar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?insertS32@SkString@@QEAAX_KH@Z"]
    pub fn SkString_insertS32(this: *mut SkString, offset: usize, value: i32);
}
unsafe extern "C" {
    #[link_name = "\u{1}?insertS64@SkString@@QEAAX_K_JH@Z"]
    pub fn SkString_insertS64(
        this: *mut SkString,
        offset: usize,
        value: i64,
        minDigits: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?insertU32@SkString@@QEAAX_KI@Z"]
    pub fn SkString_insertU32(this: *mut SkString, offset: usize, value: u32);
}
unsafe extern "C" {
    #[link_name = "\u{1}?insertU64@SkString@@QEAAX_K0H@Z"]
    pub fn SkString_insertU64(
        this: *mut SkString,
        offset: usize,
        value: u64,
        minDigits: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?insertHex@SkString@@QEAAX_KIH@Z"]
    pub fn SkString_insertHex(
        this: *mut SkString,
        offset: usize,
        value: u32,
        minDigits: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?insertScalar@SkString@@QEAAX_KM@Z"]
    pub fn SkString_insertScalar(this: *mut SkString, offset: usize, arg1: SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?printf@SkString@@QEAAXQEBDZZ"]
    pub fn SkString_printf(this: *mut SkString, format: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    #[link_name = "\u{1}?printVAList@SkString@@QEAAXQEBDPEAD@Z"]
    pub fn SkString_printVAList(
        this: *mut SkString,
        format: *const ::core::ffi::c_char,
        arg1: va_list,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?appendf@SkString@@QEAAXQEBDZZ"]
    pub fn SkString_appendf(this: *mut SkString, format: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    #[link_name = "\u{1}?appendVAList@SkString@@QEAAXQEBDPEAD@Z"]
    pub fn SkString_appendVAList(
        this: *mut SkString,
        format: *const ::core::ffi::c_char,
        arg1: va_list,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?prependf@SkString@@QEAAXQEBDZZ"]
    pub fn SkString_prependf(this: *mut SkString, format: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    #[link_name = "\u{1}?prependVAList@SkString@@QEAAXQEBDPEAD@Z"]
    pub fn SkString_prependVAList(
        this: *mut SkString,
        format: *const ::core::ffi::c_char,
        arg1: va_list,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?remove@SkString@@QEAAX_K0@Z"]
    pub fn SkString_remove(this: *mut SkString, offset: usize, length: usize);
}
unsafe extern "C" {
    #[link_name = "\u{1}?swap@SkString@@QEAAXAEAV1@@Z"]
    pub fn SkString_swap(this: *mut SkString, other: *mut SkString);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkString@@QEAA@XZ"]
    pub fn SkString_SkString(this: *mut SkString);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkString@@QEAA@_K@Z"]
    pub fn SkString_SkString1(this: *mut SkString, len: usize);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkString@@QEAA@QEBD@Z"]
    pub fn SkString_SkString2(this: *mut SkString, text: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkString@@QEAA@QEBD_K@Z"]
    pub fn SkString_SkString3(this: *mut SkString, text: *const ::core::ffi::c_char, len: usize);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkString@@QEAA@AEBV0@@Z"]
    pub fn SkString_SkString4(this: *mut SkString, arg1: *const SkString);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkString@@QEAA@$$QEAV0@@Z"]
    pub fn SkString_SkString5(this: *mut SkString, arg1: *mut SkString);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkString@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@@Z"]
    pub fn SkString_SkString6(this: *mut SkString, arg1: *const std_string);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkString@@QEAA@V?$basic_string_view@DU?$char_traits@D@std@@@std@@@Z"]
    pub fn SkString_SkString7(this: *mut SkString, arg1: std_string_view);
}
impl SkString {
    #[inline]
    pub unsafe fn equals(&self, arg1: *const SkString) -> bool {
        SkString_equals(self, arg1)
    }
    #[inline]
    pub unsafe fn equals1(&self, text: *const ::core::ffi::c_char) -> bool {
        SkString_equals1(self, text)
    }
    #[inline]
    pub unsafe fn equals2(&self, text: *const ::core::ffi::c_char, len: usize) -> bool {
        SkString_equals2(self, text, len)
    }
    #[inline]
    pub unsafe fn data(&mut self) -> *mut ::core::ffi::c_char {
        SkString_data(self)
    }
    #[inline]
    pub unsafe fn reset(&mut self) {
        SkString_reset(self)
    }
    #[inline]
    pub unsafe fn resize(&mut self, len: usize) {
        SkString_resize(self, len)
    }
    #[inline]
    pub unsafe fn set(&mut self, text: *const ::core::ffi::c_char) {
        SkString_set(self, text)
    }
    #[inline]
    pub unsafe fn set1(&mut self, text: *const ::core::ffi::c_char, len: usize) {
        SkString_set1(self, text, len)
    }
    #[inline]
    pub unsafe fn insert(&mut self, offset: usize, text: *const ::core::ffi::c_char) {
        SkString_insert(self, offset, text)
    }
    #[inline]
    pub unsafe fn insert1(&mut self, offset: usize, text: *const ::core::ffi::c_char, len: usize) {
        SkString_insert1(self, offset, text, len)
    }
    #[inline]
    pub unsafe fn insertUnichar(&mut self, offset: usize, arg1: SkUnichar) {
        SkString_insertUnichar(self, offset, arg1)
    }
    #[inline]
    pub unsafe fn insertS32(&mut self, offset: usize, value: i32) {
        SkString_insertS32(self, offset, value)
    }
    #[inline]
    pub unsafe fn insertS64(&mut self, offset: usize, value: i64, minDigits: ::core::ffi::c_int) {
        SkString_insertS64(self, offset, value, minDigits)
    }
    #[inline]
    pub unsafe fn insertU32(&mut self, offset: usize, value: u32) {
        SkString_insertU32(self, offset, value)
    }
    #[inline]
    pub unsafe fn insertU64(&mut self, offset: usize, value: u64, minDigits: ::core::ffi::c_int) {
        SkString_insertU64(self, offset, value, minDigits)
    }
    #[inline]
    pub unsafe fn insertHex(&mut self, offset: usize, value: u32, minDigits: ::core::ffi::c_int) {
        SkString_insertHex(self, offset, value, minDigits)
    }
    #[inline]
    pub unsafe fn insertScalar(&mut self, offset: usize, arg1: SkScalar) {
        SkString_insertScalar(self, offset, arg1)
    }
    #[inline]
    pub unsafe fn printVAList(&mut self, format: *const ::core::ffi::c_char, arg1: va_list) {
        SkString_printVAList(self, format, arg1)
    }
    #[inline]
    pub unsafe fn appendVAList(&mut self, format: *const ::core::ffi::c_char, arg1: va_list) {
        SkString_appendVAList(self, format, arg1)
    }
    #[inline]
    pub unsafe fn prependVAList(&mut self, format: *const ::core::ffi::c_char, arg1: va_list) {
        SkString_prependVAList(self, format, arg1)
    }
    #[inline]
    pub unsafe fn remove(&mut self, offset: usize, length: usize) {
        SkString_remove(self, offset, length)
    }
    #[inline]
    pub unsafe fn swap(&mut self, other: *mut SkString) {
        SkString_swap(self, other)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkString_SkString(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(len: usize) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkString_SkString1(__bindgen_tmp.as_mut_ptr(), len);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(text: *const ::core::ffi::c_char) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkString_SkString2(__bindgen_tmp.as_mut_ptr(), text);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(text: *const ::core::ffi::c_char, len: usize) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkString_SkString3(__bindgen_tmp.as_mut_ptr(), text, len);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new4(arg1: *const SkString) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkString_SkString4(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new5(arg1: *mut SkString) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkString_SkString5(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new6(arg1: *const std_string) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkString_SkString6(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new7(arg1: std_string_view) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkString_SkString7(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TraitObject {
    pub data: *mut ::core::ffi::c_void,
    pub vtable: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TraitObject"][::core::mem::size_of::<TraitObject>() - 16usize];
    ["Alignment of TraitObject"][::core::mem::align_of::<TraitObject>() - 8usize];
    ["Offset of field: TraitObject::data"][::core::mem::offset_of!(TraitObject, data) - 0usize];
    ["Offset of field: TraitObject::vtable"][::core::mem::offset_of!(TraitObject, vtable) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VecSink<T> {
    pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    pub fn_trait: TraitObject,
    pub set_fn:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut T, arg2: usize, arg3: TraitObject)>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sink<T> {
    pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    pub fn_trait: TraitObject,
    pub set_fn: ::core::option::Option<unsafe extern "C" fn(arg1: *const T, arg2: TraitObject)>,
}
#[repr(C)]
pub struct SkStrings {
    pub strings: __BindgenOpaqueArray<u64, 3usize>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkStrings"][::core::mem::size_of::<SkStrings>() - 24usize];
    ["Alignment of SkStrings"][::core::mem::align_of::<SkStrings>() - 8usize];
    ["Offset of field: SkStrings::strings"][::core::mem::offset_of!(SkStrings, strings) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkIPoint {
    pub fX: i32,
    pub fY: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkIPoint"][::core::mem::size_of::<SkIPoint>() - 8usize];
    ["Alignment of SkIPoint"][::core::mem::align_of::<SkIPoint>() - 4usize];
    ["Offset of field: SkIPoint::fX"][::core::mem::offset_of!(SkIPoint, fX) - 0usize];
    ["Offset of field: SkIPoint::fY"][::core::mem::offset_of!(SkIPoint, fY) - 4usize];
};
pub type SkVector = SkPoint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkPoint {
    pub fX: f32,
    pub fY: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkPoint"][::core::mem::size_of::<SkPoint>() - 8usize];
    ["Alignment of SkPoint"][::core::mem::align_of::<SkPoint>() - 4usize];
    ["Offset of field: SkPoint::fX"][::core::mem::offset_of!(SkPoint, fX) - 0usize];
    ["Offset of field: SkPoint::fY"][::core::mem::offset_of!(SkPoint, fY) - 4usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?normalize@SkPoint@@QEAA_NXZ"]
    pub fn SkPoint_normalize(this: *mut SkPoint) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setNormalize@SkPoint@@QEAA_NMM@Z"]
    pub fn SkPoint_setNormalize(this: *mut SkPoint, x: f32, y: f32) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setLength@SkPoint@@QEAA_NM@Z"]
    pub fn SkPoint_setLength(this: *mut SkPoint, length: f32) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setLength@SkPoint@@QEAA_NMMM@Z"]
    pub fn SkPoint_setLength1(this: *mut SkPoint, x: f32, y: f32, length: f32) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?scale@SkPoint@@QEBAXMPEAU1@@Z"]
    pub fn SkPoint_scale(this: *const SkPoint, scale: f32, dst: *mut SkPoint);
}
unsafe extern "C" {
    #[link_name = "\u{1}?Length@SkPoint@@SAMMM@Z"]
    pub fn SkPoint_Length(x: f32, y: f32) -> f32;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Normalize@SkPoint@@SAMPEAU1@@Z"]
    pub fn SkPoint_Normalize(vec: *mut SkVector) -> f32;
}
impl SkPoint {
    #[inline]
    pub unsafe fn normalize(&mut self) -> bool {
        SkPoint_normalize(self)
    }
    #[inline]
    pub unsafe fn setNormalize(&mut self, x: f32, y: f32) -> bool {
        SkPoint_setNormalize(self, x, y)
    }
    #[inline]
    pub unsafe fn setLength(&mut self, length: f32) -> bool {
        SkPoint_setLength(self, length)
    }
    #[inline]
    pub unsafe fn setLength1(&mut self, x: f32, y: f32, length: f32) -> bool {
        SkPoint_setLength1(self, x, y, length)
    }
    #[inline]
    pub unsafe fn scale(&self, scale: f32, dst: *mut SkPoint) {
        SkPoint_scale(self, scale, dst)
    }
    #[inline]
    pub unsafe fn Length(x: f32, y: f32) -> f32 {
        SkPoint_Length(x, y)
    }
    #[inline]
    pub unsafe fn Normalize(vec: *mut SkVector) -> f32 {
        SkPoint_Normalize(vec)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkPoint3 {
    pub fX: SkScalar,
    pub fY: SkScalar,
    pub fZ: SkScalar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkPoint3"][::core::mem::size_of::<SkPoint3>() - 12usize];
    ["Alignment of SkPoint3"][::core::mem::align_of::<SkPoint3>() - 4usize];
    ["Offset of field: SkPoint3::fX"][::core::mem::offset_of!(SkPoint3, fX) - 0usize];
    ["Offset of field: SkPoint3::fY"][::core::mem::offset_of!(SkPoint3, fY) - 4usize];
    ["Offset of field: SkPoint3::fZ"][::core::mem::offset_of!(SkPoint3, fZ) - 8usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?Length@SkPoint3@@SAMMMM@Z"]
    pub fn SkPoint3_Length(x: SkScalar, y: SkScalar, z: SkScalar) -> SkScalar;
}
unsafe extern "C" {
    #[link_name = "\u{1}?normalize@SkPoint3@@QEAA_NXZ"]
    pub fn SkPoint3_normalize(this: *mut SkPoint3) -> bool;
}
impl SkPoint3 {
    #[inline]
    pub unsafe fn Length(x: SkScalar, y: SkScalar, z: SkScalar) -> SkScalar {
        SkPoint3_Length(x, y, z)
    }
    #[inline]
    pub unsafe fn normalize(&mut self) -> bool {
        SkPoint3_normalize(self)
    }
}
impl SkPathFillType {
    pub const Default: SkPathFillType = SkPathFillType::Winding;
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkPathFillType {
    Winding = 0,
    EvenOdd = 1,
    InverseWinding = 2,
    InverseEvenOdd = 3,
}
impl SkPathDirection {
    pub const Default: SkPathDirection = SkPathDirection::CW;
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkPathDirection {
    CW = 0,
    CCW = 1,
}
pub const SkPathSegmentMask_kLine_SkPathSegmentMask: SkPathSegmentMask = 1;
pub const SkPathSegmentMask_kQuad_SkPathSegmentMask: SkPathSegmentMask = 2;
pub const SkPathSegmentMask_kConic_SkPathSegmentMask: SkPathSegmentMask = 4;
pub const SkPathSegmentMask_kCubic_SkPathSegmentMask: SkPathSegmentMask = 8;
pub type SkPathSegmentMask = ::core::ffi::c_int;
impl SkPathVerb {
    pub const Last_Verb: SkPathVerb = SkPathVerb::Close;
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkPathVerb {
    Move = 0,
    Line = 1,
    Quad = 2,
    Conic = 3,
    Cubic = 4,
    Close = 5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkISize {
    pub fWidth: i32,
    pub fHeight: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkISize"][::core::mem::size_of::<SkISize>() - 8usize];
    ["Alignment of SkISize"][::core::mem::align_of::<SkISize>() - 4usize];
    ["Offset of field: SkISize::fWidth"][::core::mem::offset_of!(SkISize, fWidth) - 0usize];
    ["Offset of field: SkISize::fHeight"][::core::mem::offset_of!(SkISize, fHeight) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkSize {
    pub fWidth: SkScalar,
    pub fHeight: SkScalar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkSize"][::core::mem::size_of::<SkSize>() - 8usize];
    ["Alignment of SkSize"][::core::mem::align_of::<SkSize>() - 4usize];
    ["Offset of field: SkSize::fWidth"][::core::mem::offset_of!(SkSize, fWidth) - 0usize];
    ["Offset of field: SkSize::fHeight"][::core::mem::offset_of!(SkSize, fHeight) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkSpan<T> {
    pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    pub fPtr: *mut T,
    pub fSize: usize,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkIRect {
    pub fLeft: i32,
    pub fTop: i32,
    pub fRight: i32,
    pub fBottom: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkIRect"][::core::mem::size_of::<SkIRect>() - 16usize];
    ["Alignment of SkIRect"][::core::mem::align_of::<SkIRect>() - 4usize];
    ["Offset of field: SkIRect::fLeft"][::core::mem::offset_of!(SkIRect, fLeft) - 0usize];
    ["Offset of field: SkIRect::fTop"][::core::mem::offset_of!(SkIRect, fTop) - 4usize];
    ["Offset of field: SkIRect::fRight"][::core::mem::offset_of!(SkIRect, fRight) - 8usize];
    ["Offset of field: SkIRect::fBottom"][::core::mem::offset_of!(SkIRect, fBottom) - 12usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?intersect@SkIRect@@QEAA_NAEBU1@0@Z"]
    pub fn SkIRect_intersect(this: *mut SkIRect, a: *const SkIRect, b: *const SkIRect) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?join@SkIRect@@QEAAXAEBU1@@Z"]
    pub fn SkIRect_join(this: *mut SkIRect, r: *const SkIRect);
}
impl SkIRect {
    #[inline]
    pub unsafe fn intersect(&mut self, a: *const SkIRect, b: *const SkIRect) -> bool {
        SkIRect_intersect(self, a, b)
    }
    #[inline]
    pub unsafe fn join(&mut self, r: *const SkIRect) {
        SkIRect_join(self, r)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkRect {
    pub fLeft: f32,
    pub fTop: f32,
    pub fRight: f32,
    pub fBottom: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkRect"][::core::mem::size_of::<SkRect>() - 16usize];
    ["Alignment of SkRect"][::core::mem::align_of::<SkRect>() - 4usize];
    ["Offset of field: SkRect::fLeft"][::core::mem::offset_of!(SkRect, fLeft) - 0usize];
    ["Offset of field: SkRect::fTop"][::core::mem::offset_of!(SkRect, fTop) - 4usize];
    ["Offset of field: SkRect::fRight"][::core::mem::offset_of!(SkRect, fRight) - 8usize];
    ["Offset of field: SkRect::fBottom"][::core::mem::offset_of!(SkRect, fBottom) - 12usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?Bounds@SkRect@@SA?AV?$optional@USkRect@@@std@@V?$SkSpan@$$CBUSkPoint@@@@@Z"]
    pub fn SkRect_Bounds(pts: SkSpan<SkPoint>) -> __BindgenOpaqueArray<u32, 5usize>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setBoundsCheck@SkRect@@QEAA_NV?$SkSpan@$$CBUSkPoint@@@@@Z"]
    pub fn SkRect_setBoundsCheck(this: *mut SkRect, pts: SkSpan<SkPoint>) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setBoundsNoCheck@SkRect@@QEAAXV?$SkSpan@$$CBUSkPoint@@@@@Z"]
    pub fn SkRect_setBoundsNoCheck(this: *mut SkRect, pts: SkSpan<SkPoint>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?intersect@SkRect@@QEAA_NAEBU1@@Z"]
    pub fn SkRect_intersect(this: *mut SkRect, r: *const SkRect) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?intersect@SkRect@@QEAA_NAEBU1@0@Z"]
    pub fn SkRect_intersect1(this: *mut SkRect, a: *const SkRect, b: *const SkRect) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?join@SkRect@@QEAAXAEBU1@@Z"]
    pub fn SkRect_join(this: *mut SkRect, r: *const SkRect);
}
unsafe extern "C" {
    #[link_name = "\u{1}?dump@SkRect@@QEBAX_N@Z"]
    pub fn SkRect_dump(this: *const SkRect, asHex: bool);
}
unsafe extern "C" {
    #[link_name = "\u{1}?dumpToString@SkRect@@QEBA?AVSkString@@_N@Z"]
    pub fn SkRect_dumpToString(this: *const SkRect, asHex: bool) -> SkString;
}
impl SkRect {
    #[inline]
    pub unsafe fn Bounds(pts: SkSpan<SkPoint>) -> __BindgenOpaqueArray<u32, 5usize> {
        SkRect_Bounds(pts)
    }
    #[inline]
    pub unsafe fn setBoundsCheck(&mut self, pts: SkSpan<SkPoint>) -> bool {
        SkRect_setBoundsCheck(self, pts)
    }
    #[inline]
    pub unsafe fn setBoundsNoCheck(&mut self, pts: SkSpan<SkPoint>) {
        SkRect_setBoundsNoCheck(self, pts)
    }
    #[inline]
    pub unsafe fn intersect(&mut self, r: *const SkRect) -> bool {
        SkRect_intersect(self, r)
    }
    #[inline]
    pub unsafe fn intersect1(&mut self, a: *const SkRect, b: *const SkRect) -> bool {
        SkRect_intersect1(self, a, b)
    }
    #[inline]
    pub unsafe fn join(&mut self, r: *const SkRect) {
        SkRect_join(self, r)
    }
    #[inline]
    pub unsafe fn dump(&self, asHex: bool) {
        SkRect_dump(self, asHex)
    }
    #[inline]
    pub unsafe fn dumpToString(&self, asHex: bool) -> SkString {
        SkRect_dumpToString(self, asHex)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkMatrix {
    pub fMat: [SkScalar; 9usize],
    pub fTypeMask: i32,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkMatrix_ScaleToFit {
    Fill = 0,
    Start = 1,
    Center = 2,
    End = 3,
}
pub const SkMatrix_TypeMask_kIdentity_Mask: SkMatrix_TypeMask = 0;
pub const SkMatrix_TypeMask_kTranslate_Mask: SkMatrix_TypeMask = 1;
pub const SkMatrix_TypeMask_kScale_Mask: SkMatrix_TypeMask = 2;
pub const SkMatrix_TypeMask_kAffine_Mask: SkMatrix_TypeMask = 4;
pub const SkMatrix_TypeMask_kPerspective_Mask: SkMatrix_TypeMask = 8;
pub type SkMatrix_TypeMask = ::core::ffi::c_int;
pub type SkMatrix_MapPtsProc = ::core::option::Option<
    unsafe extern "C" fn(
        mat: *const SkMatrix,
        dst: *mut SkPoint,
        src: *const SkPoint,
        count: ::core::ffi::c_int,
    ),
>;
pub const SkMatrix_kMScaleX: ::core::ffi::c_int = 0;
pub const SkMatrix_kMSkewX: ::core::ffi::c_int = 1;
pub const SkMatrix_kMTransX: ::core::ffi::c_int = 2;
pub const SkMatrix_kMSkewY: ::core::ffi::c_int = 3;
pub const SkMatrix_kMScaleY: ::core::ffi::c_int = 4;
pub const SkMatrix_kMTransY: ::core::ffi::c_int = 5;
pub const SkMatrix_kMPersp0: ::core::ffi::c_int = 6;
pub const SkMatrix_kMPersp1: ::core::ffi::c_int = 7;
pub const SkMatrix_kMPersp2: ::core::ffi::c_int = 8;
pub const SkMatrix_kAScaleX: ::core::ffi::c_int = 0;
pub const SkMatrix_kASkewY: ::core::ffi::c_int = 1;
pub const SkMatrix_kASkewX: ::core::ffi::c_int = 2;
pub const SkMatrix_kAScaleY: ::core::ffi::c_int = 3;
pub const SkMatrix_kATransX: ::core::ffi::c_int = 4;
pub const SkMatrix_kATransY: ::core::ffi::c_int = 5;
pub const SkMatrix_kRectStaysRect_Mask: ::core::ffi::c_int = 16;
pub const SkMatrix_kOnlyPerspectiveValid_Mask: ::core::ffi::c_int = 64;
pub const SkMatrix_kUnknown_Mask: ::core::ffi::c_int = 128;
pub const SkMatrix_kORableMasks: ::core::ffi::c_int = 15;
pub const SkMatrix_kAllMasks: ::core::ffi::c_int = 31;
unsafe extern "C" {
    #[link_name = "\u{1}?gMapPtsProcs@SkMatrix@@0QBQ6AXAEBV1@QEAUSkPoint@@QEBU2@H@ZB"]
    pub static SkMatrix_gMapPtsProcs: [SkMatrix_MapPtsProc; 0usize];
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkMatrix"][::core::mem::size_of::<SkMatrix>() - 40usize];
    ["Alignment of SkMatrix"][::core::mem::align_of::<SkMatrix>() - 4usize];
    ["Offset of field: SkMatrix::fMat"][::core::mem::offset_of!(SkMatrix, fMat) - 0usize];
    ["Offset of field: SkMatrix::fTypeMask"]
        [::core::mem::offset_of!(SkMatrix, fTypeMask) - 36usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?ScaleTranslate@SkMatrix@@SA?AV1@MMMM@Z"]
    pub fn SkMatrix_ScaleTranslate(sx: f32, sy: f32, tx: f32, ty: f32) -> SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?isSimilarity@SkMatrix@@QEBA_NM@Z"]
    pub fn SkMatrix_isSimilarity(this: *const SkMatrix, tol: SkScalar) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preservesRightAngles@SkMatrix@@QEBA_NM@Z"]
    pub fn SkMatrix_preservesRightAngles(this: *const SkMatrix, tol: SkScalar) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?set9@SkMatrix@@QEAAAEAV1@QEBM@Z"]
    pub fn SkMatrix_set9(this: *mut SkMatrix, buffer: *const SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?reset@SkMatrix@@QEAAAEAV1@XZ"]
    pub fn SkMatrix_reset(this: *mut SkMatrix) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setTranslate@SkMatrix@@QEAAAEAV1@MM@Z"]
    pub fn SkMatrix_setTranslate(this: *mut SkMatrix, dx: SkScalar, dy: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setScale@SkMatrix@@QEAAAEAV1@MMMM@Z"]
    pub fn SkMatrix_setScale(
        this: *mut SkMatrix,
        sx: SkScalar,
        sy: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setScale@SkMatrix@@QEAAAEAV1@MM@Z"]
    pub fn SkMatrix_setScale1(this: *mut SkMatrix, sx: SkScalar, sy: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setRotate@SkMatrix@@QEAAAEAV1@MMM@Z"]
    pub fn SkMatrix_setRotate(
        this: *mut SkMatrix,
        degrees: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setRotate@SkMatrix@@QEAAAEAV1@M@Z"]
    pub fn SkMatrix_setRotate1(this: *mut SkMatrix, degrees: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setSinCos@SkMatrix@@QEAAAEAV1@MMMM@Z"]
    pub fn SkMatrix_setSinCos(
        this: *mut SkMatrix,
        sinValue: SkScalar,
        cosValue: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setSinCos@SkMatrix@@QEAAAEAV1@MM@Z"]
    pub fn SkMatrix_setSinCos1(
        this: *mut SkMatrix,
        sinValue: SkScalar,
        cosValue: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setRSXform@SkMatrix@@QEAAAEAV1@AEBUSkRSXform@@@Z"]
    pub fn SkMatrix_setRSXform(this: *mut SkMatrix, rsxForm: *const SkRSXform) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setSkew@SkMatrix@@QEAAAEAV1@MMMM@Z"]
    pub fn SkMatrix_setSkew(
        this: *mut SkMatrix,
        kx: SkScalar,
        ky: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setSkew@SkMatrix@@QEAAAEAV1@MM@Z"]
    pub fn SkMatrix_setSkew1(this: *mut SkMatrix, kx: SkScalar, ky: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setConcat@SkMatrix@@QEAAAEAV1@AEBV1@0@Z"]
    pub fn SkMatrix_setConcat(
        this: *mut SkMatrix,
        a: *const SkMatrix,
        b: *const SkMatrix,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preTranslate@SkMatrix@@QEAAAEAV1@MM@Z"]
    pub fn SkMatrix_preTranslate(this: *mut SkMatrix, dx: SkScalar, dy: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preScale@SkMatrix@@QEAAAEAV1@MMMM@Z"]
    pub fn SkMatrix_preScale(
        this: *mut SkMatrix,
        sx: SkScalar,
        sy: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preScale@SkMatrix@@QEAAAEAV1@MM@Z"]
    pub fn SkMatrix_preScale1(this: *mut SkMatrix, sx: SkScalar, sy: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preRotate@SkMatrix@@QEAAAEAV1@MMM@Z"]
    pub fn SkMatrix_preRotate(
        this: *mut SkMatrix,
        degrees: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preRotate@SkMatrix@@QEAAAEAV1@M@Z"]
    pub fn SkMatrix_preRotate1(this: *mut SkMatrix, degrees: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preSkew@SkMatrix@@QEAAAEAV1@MMMM@Z"]
    pub fn SkMatrix_preSkew(
        this: *mut SkMatrix,
        kx: SkScalar,
        ky: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preSkew@SkMatrix@@QEAAAEAV1@MM@Z"]
    pub fn SkMatrix_preSkew1(this: *mut SkMatrix, kx: SkScalar, ky: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preConcat@SkMatrix@@QEAAAEAV1@AEBV1@@Z"]
    pub fn SkMatrix_preConcat(this: *mut SkMatrix, other: *const SkMatrix) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?postTranslate@SkMatrix@@QEAAAEAV1@MM@Z"]
    pub fn SkMatrix_postTranslate(this: *mut SkMatrix, dx: SkScalar, dy: SkScalar)
    -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?postScale@SkMatrix@@QEAAAEAV1@MMMM@Z"]
    pub fn SkMatrix_postScale(
        this: *mut SkMatrix,
        sx: SkScalar,
        sy: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?postScale@SkMatrix@@QEAAAEAV1@MM@Z"]
    pub fn SkMatrix_postScale1(this: *mut SkMatrix, sx: SkScalar, sy: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?postRotate@SkMatrix@@QEAAAEAV1@MMM@Z"]
    pub fn SkMatrix_postRotate(
        this: *mut SkMatrix,
        degrees: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?postRotate@SkMatrix@@QEAAAEAV1@M@Z"]
    pub fn SkMatrix_postRotate1(this: *mut SkMatrix, degrees: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?postSkew@SkMatrix@@QEAAAEAV1@MMMM@Z"]
    pub fn SkMatrix_postSkew(
        this: *mut SkMatrix,
        kx: SkScalar,
        ky: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?postSkew@SkMatrix@@QEAAAEAV1@MM@Z"]
    pub fn SkMatrix_postSkew1(this: *mut SkMatrix, kx: SkScalar, ky: SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?postConcat@SkMatrix@@QEAAAEAV1@AEBV1@@Z"]
    pub fn SkMatrix_postConcat(this: *mut SkMatrix, other: *const SkMatrix) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Rect2Rect@SkMatrix@@SA?AV?$optional@VSkMatrix@@@std@@AEBUSkRect@@0W4ScaleToFit@1@@Z"]
    pub fn SkMatrix_Rect2Rect(
        src: *const SkRect,
        dst: *const SkRect,
        arg1: SkMatrix_ScaleToFit,
    ) -> __BindgenOpaqueArray<u32, 11usize>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?PolyToPoly@SkMatrix@@SA?AV?$optional@VSkMatrix@@@std@@V?$SkSpan@$$CBUSkPoint@@@@0@Z"]
    pub fn SkMatrix_PolyToPoly(
        src: SkSpan<SkPoint>,
        dst: SkSpan<SkPoint>,
    ) -> __BindgenOpaqueArray<u32, 11usize>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?invert@SkMatrix@@QEBA?AV?$optional@VSkMatrix@@@std@@XZ"]
    pub fn SkMatrix_invert(this: *const SkMatrix) -> __BindgenOpaqueArray<u32, 11usize>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?SetAffineIdentity@SkMatrix@@SAXQEAM@Z"]
    pub fn SkMatrix_SetAffineIdentity(affine: *mut SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?asAffine@SkMatrix@@QEBA_NQEAM@Z"]
    pub fn SkMatrix_asAffine(this: *const SkMatrix, affine: *mut SkScalar) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setAffine@SkMatrix@@QEAAAEAV1@QEBM@Z"]
    pub fn SkMatrix_setAffine(this: *mut SkMatrix, affine: *const SkScalar) -> *mut SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?mapPoints@SkMatrix@@QEBAXV?$SkSpan@USkPoint@@@@V?$SkSpan@$$CBUSkPoint@@@@@Z"]
    pub fn SkMatrix_mapPoints(this: *const SkMatrix, dst: SkSpan<SkPoint>, src: SkSpan<SkPoint>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?mapHomogeneousPoints@SkMatrix@@QEBAXV?$SkSpan@USkPoint3@@@@V?$SkSpan@$$CBUSkPoint3@@@@@Z"]
    pub fn SkMatrix_mapHomogeneousPoints(
        this: *const SkMatrix,
        dst: SkSpan<SkPoint3>,
        src: SkSpan<SkPoint3>,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?mapPointsToHomogeneous@SkMatrix@@QEBAXV?$SkSpan@USkPoint3@@@@V?$SkSpan@$$CBUSkPoint@@@@@Z"]
    pub fn SkMatrix_mapPointsToHomogeneous(
        this: *const SkMatrix,
        dst: SkSpan<SkPoint3>,
        src: SkSpan<SkPoint>,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?mapVectors@SkMatrix@@QEBAXV?$SkSpan@USkPoint@@@@V?$SkSpan@$$CBUSkPoint@@@@@Z"]
    pub fn SkMatrix_mapVectors(this: *const SkMatrix, dst: SkSpan<SkVector>, src: SkSpan<SkVector>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?mapRect@SkMatrix@@QEBA_NPEAUSkRect@@AEBU2@@Z"]
    pub fn SkMatrix_mapRect(this: *const SkMatrix, dst: *mut SkRect, src: *const SkRect) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?mapRectScaleTranslate@SkMatrix@@QEBAXPEAUSkRect@@AEBU2@@Z"]
    pub fn SkMatrix_mapRectScaleTranslate(
        this: *const SkMatrix,
        dst: *mut SkRect,
        src: *const SkRect,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?mapRadius@SkMatrix@@QEBAMM@Z"]
    pub fn SkMatrix_mapRadius(this: *const SkMatrix, radius: SkScalar) -> SkScalar;
}
unsafe extern "C" {
    #[link_name = "\u{1}?dump@SkMatrix@@QEBAXXZ"]
    pub fn SkMatrix_dump(this: *const SkMatrix);
}
unsafe extern "C" {
    #[link_name = "\u{1}?getMinScale@SkMatrix@@QEBAMXZ"]
    pub fn SkMatrix_getMinScale(this: *const SkMatrix) -> SkScalar;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getMaxScale@SkMatrix@@QEBAMXZ"]
    pub fn SkMatrix_getMaxScale(this: *const SkMatrix) -> SkScalar;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getMinMaxScales@SkMatrix@@QEBA_NQEAM@Z"]
    pub fn SkMatrix_getMinMaxScales(this: *const SkMatrix, scaleFactors: *mut SkScalar) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?decomposeScale@SkMatrix@@QEBA_NPEAUSkSize@@PEAV1@@Z"]
    pub fn SkMatrix_decomposeScale(
        this: *const SkMatrix,
        scale: *mut SkSize,
        remaining: *mut SkMatrix,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?I@SkMatrix@@SAAEBV1@XZ"]
    pub fn SkMatrix_I() -> *const SkMatrix;
}
unsafe extern "C" {
    #[link_name = "\u{1}?InvalidMatrix@SkMatrix@@SAAEBV1@XZ"]
    pub fn SkMatrix_InvalidMatrix() -> *const SkMatrix;
}
impl SkMatrix {
    #[inline]
    pub unsafe fn ScaleTranslate(sx: f32, sy: f32, tx: f32, ty: f32) -> SkMatrix {
        SkMatrix_ScaleTranslate(sx, sy, tx, ty)
    }
    #[inline]
    pub unsafe fn isSimilarity(&self, tol: SkScalar) -> bool {
        SkMatrix_isSimilarity(self, tol)
    }
    #[inline]
    pub unsafe fn preservesRightAngles(&self, tol: SkScalar) -> bool {
        SkMatrix_preservesRightAngles(self, tol)
    }
    #[inline]
    pub unsafe fn set9(&mut self, buffer: *const SkScalar) -> *mut SkMatrix {
        SkMatrix_set9(self, buffer)
    }
    #[inline]
    pub unsafe fn reset(&mut self) -> *mut SkMatrix {
        SkMatrix_reset(self)
    }
    #[inline]
    pub unsafe fn setTranslate(&mut self, dx: SkScalar, dy: SkScalar) -> *mut SkMatrix {
        SkMatrix_setTranslate(self, dx, dy)
    }
    #[inline]
    pub unsafe fn setScale(
        &mut self,
        sx: SkScalar,
        sy: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix {
        SkMatrix_setScale(self, sx, sy, px, py)
    }
    #[inline]
    pub unsafe fn setScale1(&mut self, sx: SkScalar, sy: SkScalar) -> *mut SkMatrix {
        SkMatrix_setScale1(self, sx, sy)
    }
    #[inline]
    pub unsafe fn setRotate(
        &mut self,
        degrees: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix {
        SkMatrix_setRotate(self, degrees, px, py)
    }
    #[inline]
    pub unsafe fn setRotate1(&mut self, degrees: SkScalar) -> *mut SkMatrix {
        SkMatrix_setRotate1(self, degrees)
    }
    #[inline]
    pub unsafe fn setSinCos(
        &mut self,
        sinValue: SkScalar,
        cosValue: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix {
        SkMatrix_setSinCos(self, sinValue, cosValue, px, py)
    }
    #[inline]
    pub unsafe fn setSinCos1(&mut self, sinValue: SkScalar, cosValue: SkScalar) -> *mut SkMatrix {
        SkMatrix_setSinCos1(self, sinValue, cosValue)
    }
    #[inline]
    pub unsafe fn setRSXform(&mut self, rsxForm: *const SkRSXform) -> *mut SkMatrix {
        SkMatrix_setRSXform(self, rsxForm)
    }
    #[inline]
    pub unsafe fn setSkew(
        &mut self,
        kx: SkScalar,
        ky: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix {
        SkMatrix_setSkew(self, kx, ky, px, py)
    }
    #[inline]
    pub unsafe fn setSkew1(&mut self, kx: SkScalar, ky: SkScalar) -> *mut SkMatrix {
        SkMatrix_setSkew1(self, kx, ky)
    }
    #[inline]
    pub unsafe fn setConcat(&mut self, a: *const SkMatrix, b: *const SkMatrix) -> *mut SkMatrix {
        SkMatrix_setConcat(self, a, b)
    }
    #[inline]
    pub unsafe fn preTranslate(&mut self, dx: SkScalar, dy: SkScalar) -> *mut SkMatrix {
        SkMatrix_preTranslate(self, dx, dy)
    }
    #[inline]
    pub unsafe fn preScale(
        &mut self,
        sx: SkScalar,
        sy: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix {
        SkMatrix_preScale(self, sx, sy, px, py)
    }
    #[inline]
    pub unsafe fn preScale1(&mut self, sx: SkScalar, sy: SkScalar) -> *mut SkMatrix {
        SkMatrix_preScale1(self, sx, sy)
    }
    #[inline]
    pub unsafe fn preRotate(
        &mut self,
        degrees: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix {
        SkMatrix_preRotate(self, degrees, px, py)
    }
    #[inline]
    pub unsafe fn preRotate1(&mut self, degrees: SkScalar) -> *mut SkMatrix {
        SkMatrix_preRotate1(self, degrees)
    }
    #[inline]
    pub unsafe fn preSkew(
        &mut self,
        kx: SkScalar,
        ky: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix {
        SkMatrix_preSkew(self, kx, ky, px, py)
    }
    #[inline]
    pub unsafe fn preSkew1(&mut self, kx: SkScalar, ky: SkScalar) -> *mut SkMatrix {
        SkMatrix_preSkew1(self, kx, ky)
    }
    #[inline]
    pub unsafe fn preConcat(&mut self, other: *const SkMatrix) -> *mut SkMatrix {
        SkMatrix_preConcat(self, other)
    }
    #[inline]
    pub unsafe fn postTranslate(&mut self, dx: SkScalar, dy: SkScalar) -> *mut SkMatrix {
        SkMatrix_postTranslate(self, dx, dy)
    }
    #[inline]
    pub unsafe fn postScale(
        &mut self,
        sx: SkScalar,
        sy: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix {
        SkMatrix_postScale(self, sx, sy, px, py)
    }
    #[inline]
    pub unsafe fn postScale1(&mut self, sx: SkScalar, sy: SkScalar) -> *mut SkMatrix {
        SkMatrix_postScale1(self, sx, sy)
    }
    #[inline]
    pub unsafe fn postRotate(
        &mut self,
        degrees: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix {
        SkMatrix_postRotate(self, degrees, px, py)
    }
    #[inline]
    pub unsafe fn postRotate1(&mut self, degrees: SkScalar) -> *mut SkMatrix {
        SkMatrix_postRotate1(self, degrees)
    }
    #[inline]
    pub unsafe fn postSkew(
        &mut self,
        kx: SkScalar,
        ky: SkScalar,
        px: SkScalar,
        py: SkScalar,
    ) -> *mut SkMatrix {
        SkMatrix_postSkew(self, kx, ky, px, py)
    }
    #[inline]
    pub unsafe fn postSkew1(&mut self, kx: SkScalar, ky: SkScalar) -> *mut SkMatrix {
        SkMatrix_postSkew1(self, kx, ky)
    }
    #[inline]
    pub unsafe fn postConcat(&mut self, other: *const SkMatrix) -> *mut SkMatrix {
        SkMatrix_postConcat(self, other)
    }
    #[inline]
    pub unsafe fn Rect2Rect(
        src: *const SkRect,
        dst: *const SkRect,
        arg1: SkMatrix_ScaleToFit,
    ) -> __BindgenOpaqueArray<u32, 11usize> {
        SkMatrix_Rect2Rect(src, dst, arg1)
    }
    #[inline]
    pub unsafe fn PolyToPoly(
        src: SkSpan<SkPoint>,
        dst: SkSpan<SkPoint>,
    ) -> __BindgenOpaqueArray<u32, 11usize> {
        SkMatrix_PolyToPoly(src, dst)
    }
    #[inline]
    pub unsafe fn invert(&self) -> __BindgenOpaqueArray<u32, 11usize> {
        SkMatrix_invert(self)
    }
    #[inline]
    pub unsafe fn SetAffineIdentity(affine: *mut SkScalar) {
        SkMatrix_SetAffineIdentity(affine)
    }
    #[inline]
    pub unsafe fn asAffine(&self, affine: *mut SkScalar) -> bool {
        SkMatrix_asAffine(self, affine)
    }
    #[inline]
    pub unsafe fn setAffine(&mut self, affine: *const SkScalar) -> *mut SkMatrix {
        SkMatrix_setAffine(self, affine)
    }
    #[inline]
    pub unsafe fn mapPoints(&self, dst: SkSpan<SkPoint>, src: SkSpan<SkPoint>) {
        SkMatrix_mapPoints(self, dst, src)
    }
    #[inline]
    pub unsafe fn mapHomogeneousPoints(&self, dst: SkSpan<SkPoint3>, src: SkSpan<SkPoint3>) {
        SkMatrix_mapHomogeneousPoints(self, dst, src)
    }
    #[inline]
    pub unsafe fn mapPointsToHomogeneous(&self, dst: SkSpan<SkPoint3>, src: SkSpan<SkPoint>) {
        SkMatrix_mapPointsToHomogeneous(self, dst, src)
    }
    #[inline]
    pub unsafe fn mapVectors(&self, dst: SkSpan<SkVector>, src: SkSpan<SkVector>) {
        SkMatrix_mapVectors(self, dst, src)
    }
    #[inline]
    pub unsafe fn mapRect(&self, dst: *mut SkRect, src: *const SkRect) -> bool {
        SkMatrix_mapRect(self, dst, src)
    }
    #[inline]
    pub unsafe fn mapRectScaleTranslate(&self, dst: *mut SkRect, src: *const SkRect) {
        SkMatrix_mapRectScaleTranslate(self, dst, src)
    }
    #[inline]
    pub unsafe fn mapRadius(&self, radius: SkScalar) -> SkScalar {
        SkMatrix_mapRadius(self, radius)
    }
    #[inline]
    pub unsafe fn dump(&self) {
        SkMatrix_dump(self)
    }
    #[inline]
    pub unsafe fn getMinScale(&self) -> SkScalar {
        SkMatrix_getMinScale(self)
    }
    #[inline]
    pub unsafe fn getMaxScale(&self) -> SkScalar {
        SkMatrix_getMaxScale(self)
    }
    #[inline]
    pub unsafe fn getMinMaxScales(&self, scaleFactors: *mut SkScalar) -> bool {
        SkMatrix_getMinMaxScales(self, scaleFactors)
    }
    #[inline]
    pub unsafe fn decomposeScale(&self, scale: *mut SkSize, remaining: *mut SkMatrix) -> bool {
        SkMatrix_decomposeScale(self, scale, remaining)
    }
    #[inline]
    pub unsafe fn I() -> *const SkMatrix {
        SkMatrix_I()
    }
    #[inline]
    pub unsafe fn InvalidMatrix() -> *const SkMatrix {
        SkMatrix_InvalidMatrix()
    }
}
impl SkEncodedOrigin {
    pub const Default: SkEncodedOrigin = SkEncodedOrigin::TopLeft;
}
impl SkEncodedOrigin {
    pub const Last: SkEncodedOrigin = SkEncodedOrigin::LeftBottom;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkEncodedOrigin {
    TopLeft = 1,
    TopRight = 2,
    BottomRight = 3,
    BottomLeft = 4,
    LeftTop = 5,
    RightTop = 6,
    RightBottom = 7,
    LeftBottom = 8,
}
impl SkAlphaType {
    pub const LastEnum: SkAlphaType = SkAlphaType::Unpremul;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkAlphaType {
    Unknown = 0,
    Opaque = 1,
    Premul = 2,
    Unpremul = 3,
}
impl SkColorType {
    pub const kLastEnum_SkColorType: SkColorType = SkColorType::kR8_unorm_SkColorType;
}
impl SkColorType {
    pub const kN32_SkColorType: SkColorType = SkColorType::kBGRA_8888_SkColorType;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkColorType {
    kUnknown_SkColorType = 0,
    kAlpha_8_SkColorType = 1,
    kRGB_565_SkColorType = 2,
    kARGB_4444_SkColorType = 3,
    kRGBA_8888_SkColorType = 4,
    kRGB_888x_SkColorType = 5,
    kBGRA_8888_SkColorType = 6,
    kRGBA_1010102_SkColorType = 7,
    kBGRA_1010102_SkColorType = 8,
    kRGB_101010x_SkColorType = 9,
    kBGR_101010x_SkColorType = 10,
    kBGR_101010x_XR_SkColorType = 11,
    kBGRA_10101010_XR_SkColorType = 12,
    kRGBA_10x6_SkColorType = 13,
    kGray_8_SkColorType = 14,
    kRGBA_F16Norm_SkColorType = 15,
    kRGBA_F16_SkColorType = 16,
    kRGB_F16F16F16x_SkColorType = 17,
    kRGBA_F32_SkColorType = 18,
    kR8G8_unorm_SkColorType = 19,
    kA16_float_SkColorType = 20,
    kR16G16_float_SkColorType = 21,
    kA16_unorm_SkColorType = 22,
    kR16_unorm_SkColorType = 23,
    kR16G16_unorm_SkColorType = 24,
    kR16G16B16A16_unorm_SkColorType = 25,
    kSRGBA_8888_SkColorType = 26,
    kR8_unorm_SkColorType = 27,
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkColorTypeBytesPerPixel@@YAHW4SkColorType@@@Z"]
    pub fn SkColorTypeBytesPerPixel(ct: SkColorType) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkColorTypeIsAlwaysOpaque@@YA_NW4SkColorType@@@Z"]
    pub fn SkColorTypeIsAlwaysOpaque(ct: SkColorType) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkColorTypeValidateAlphaType@@YA_NW4SkColorType@@W4SkAlphaType@@PEAW42@@Z"]
    pub fn SkColorTypeValidateAlphaType(
        colorType: SkColorType,
        alphaType: SkAlphaType,
        canonical: *mut SkAlphaType,
    ) -> bool;
}
impl SkYUVColorSpace {
    pub const LastEnum: SkYUVColorSpace = SkYUVColorSpace::Identity;
}
impl SkYUVColorSpace {
    pub const JPEG: SkYUVColorSpace = SkYUVColorSpace::JPEG_Full;
}
impl SkYUVColorSpace {
    pub const Rec601: SkYUVColorSpace = SkYUVColorSpace::Rec601_Limited;
}
impl SkYUVColorSpace {
    pub const Rec709: SkYUVColorSpace = SkYUVColorSpace::Rec709_Limited;
}
impl SkYUVColorSpace {
    pub const BT2020: SkYUVColorSpace = SkYUVColorSpace::BT2020_8bit_Limited;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkYUVColorSpace {
    JPEG_Full = 0,
    Rec601_Limited = 1,
    Rec709_Full = 2,
    Rec709_Limited = 3,
    BT2020_8bit_Full = 4,
    BT2020_8bit_Limited = 5,
    BT2020_10bit_Full = 6,
    BT2020_10bit_Limited = 7,
    BT2020_12bit_Full = 8,
    BT2020_12bit_Limited = 9,
    BT2020_16bit_Full = 10,
    BT2020_16bit_Limited = 11,
    FCC_Full = 12,
    FCC_Limited = 13,
    SMPTE240_Full = 14,
    SMPTE240_Limited = 15,
    YDZDX_Full = 16,
    YDZDX_Limited = 17,
    GBR_Full = 18,
    GBR_Limited = 19,
    YCgCo_8bit_Full = 20,
    YCgCo_8bit_Limited = 21,
    YCgCo_10bit_Full = 22,
    YCgCo_10bit_Limited = 23,
    YCgCo_12bit_Full = 24,
    YCgCo_12bit_Limited = 25,
    YCgCo_16bit_Full = 26,
    YCgCo_16bit_Limited = 27,
    Identity = 28,
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkYUVColorSpaceIsLimitedRange@@YA_NW4SkYUVColorSpace@@@Z"]
    pub fn SkYUVColorSpaceIsLimitedRange(cs: SkYUVColorSpace) -> bool;
}
#[repr(C)]
#[derive(Debug)]
pub struct SkColorInfo {
    pub fColorSpace: sk_sp<SkColorSpace>,
    pub fColorType: SkColorType,
    pub fAlphaType: SkAlphaType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkColorInfo"][::core::mem::size_of::<SkColorInfo>() - 16usize];
    ["Alignment of SkColorInfo"][::core::mem::align_of::<SkColorInfo>() - 8usize];
    ["Offset of field: SkColorInfo::fColorSpace"]
        [::core::mem::offset_of!(SkColorInfo, fColorSpace) - 0usize];
    ["Offset of field: SkColorInfo::fColorType"]
        [::core::mem::offset_of!(SkColorInfo, fColorType) - 8usize];
    ["Offset of field: SkColorInfo::fAlphaType"]
        [::core::mem::offset_of!(SkColorInfo, fAlphaType) - 12usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?colorSpace@SkColorInfo@@QEBAPEAVSkColorSpace@@XZ"]
    pub fn SkColorInfo_colorSpace(this: *const SkColorInfo) -> *mut SkColorSpace;
}
unsafe extern "C" {
    #[link_name = "\u{1}?refColorSpace@SkColorInfo@@QEBA?AV?$sk_sp@VSkColorSpace@@@@XZ"]
    pub fn SkColorInfo_refColorSpace(this: *const SkColorInfo) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?gammaCloseToSRGB@SkColorInfo@@QEBA_NXZ"]
    pub fn SkColorInfo_gammaCloseToSRGB(this: *const SkColorInfo) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeAlphaType@SkColorInfo@@QEBA?AV1@W4SkAlphaType@@@Z"]
    pub fn SkColorInfo_makeAlphaType(
        this: *const SkColorInfo,
        newAlphaType: SkAlphaType,
    ) -> SkColorInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeColorType@SkColorInfo@@QEBA?AV1@W4SkColorType@@@Z"]
    pub fn SkColorInfo_makeColorType(
        this: *const SkColorInfo,
        newColorType: SkColorType,
    ) -> SkColorInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeColorSpace@SkColorInfo@@QEBA?AV1@V?$sk_sp@VSkColorSpace@@@@@Z"]
    pub fn SkColorInfo_makeColorSpace(
        this: *const SkColorInfo,
        cs: sk_sp<SkColorSpace>,
    ) -> SkColorInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?bytesPerPixel@SkColorInfo@@QEBAHXZ"]
    pub fn SkColorInfo_bytesPerPixel(this: *const SkColorInfo) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?shiftPerPixel@SkColorInfo@@QEBAHXZ"]
    pub fn SkColorInfo_shiftPerPixel(this: *const SkColorInfo) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkColorInfo@@QEAA@XZ"]
    pub fn SkColorInfo_SkColorInfo(this: *mut SkColorInfo);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkColorInfo@@QEAA@W4SkColorType@@W4SkAlphaType@@V?$sk_sp@VSkColorSpace@@@@@Z"]
    pub fn SkColorInfo_SkColorInfo1(
        this: *mut SkColorInfo,
        ct: SkColorType,
        at: SkAlphaType,
        cs: sk_sp<SkColorSpace>,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkColorInfo@@QEAA@AEBV0@@Z"]
    pub fn SkColorInfo_SkColorInfo2(this: *mut SkColorInfo, arg1: *const SkColorInfo);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkColorInfo@@QEAA@$$QEAV0@@Z"]
    pub fn SkColorInfo_SkColorInfo3(this: *mut SkColorInfo, arg1: *mut SkColorInfo);
}
impl SkColorInfo {
    #[inline]
    pub unsafe fn colorSpace(&self) -> *mut SkColorSpace {
        SkColorInfo_colorSpace(self)
    }
    #[inline]
    pub unsafe fn refColorSpace(&self) -> sk_sp<SkColorSpace> {
        SkColorInfo_refColorSpace(self)
    }
    #[inline]
    pub unsafe fn gammaCloseToSRGB(&self) -> bool {
        SkColorInfo_gammaCloseToSRGB(self)
    }
    #[inline]
    pub unsafe fn makeAlphaType(&self, newAlphaType: SkAlphaType) -> SkColorInfo {
        SkColorInfo_makeAlphaType(self, newAlphaType)
    }
    #[inline]
    pub unsafe fn makeColorType(&self, newColorType: SkColorType) -> SkColorInfo {
        SkColorInfo_makeColorType(self, newColorType)
    }
    #[inline]
    pub unsafe fn makeColorSpace(&self, cs: sk_sp<SkColorSpace>) -> SkColorInfo {
        SkColorInfo_makeColorSpace(self, cs)
    }
    #[inline]
    pub unsafe fn bytesPerPixel(&self) -> ::core::ffi::c_int {
        SkColorInfo_bytesPerPixel(self)
    }
    #[inline]
    pub unsafe fn shiftPerPixel(&self) -> ::core::ffi::c_int {
        SkColorInfo_shiftPerPixel(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkColorInfo_SkColorInfo(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(ct: SkColorType, at: SkAlphaType, cs: sk_sp<SkColorSpace>) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkColorInfo_SkColorInfo1(__bindgen_tmp.as_mut_ptr(), ct, at, cs);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *const SkColorInfo) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkColorInfo_SkColorInfo2(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(arg1: *mut SkColorInfo) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkColorInfo_SkColorInfo3(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct SkImageInfo {
    pub fColorInfo: SkColorInfo,
    pub fDimensions: SkISize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkImageInfo"][::core::mem::size_of::<SkImageInfo>() - 24usize];
    ["Alignment of SkImageInfo"][::core::mem::align_of::<SkImageInfo>() - 8usize];
    ["Offset of field: SkImageInfo::fColorInfo"]
        [::core::mem::offset_of!(SkImageInfo, fColorInfo) - 0usize];
    ["Offset of field: SkImageInfo::fDimensions"]
        [::core::mem::offset_of!(SkImageInfo, fDimensions) - 16usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?Make@SkImageInfo@@SA?AU1@HHW4SkColorType@@W4SkAlphaType@@@Z"]
    pub fn SkImageInfo_Make(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        ct: SkColorType,
        at: SkAlphaType,
    ) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Make@SkImageInfo@@SA?AU1@HHW4SkColorType@@W4SkAlphaType@@V?$sk_sp@VSkColorSpace@@@@@Z"]
    pub fn SkImageInfo_Make1(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        ct: SkColorType,
        at: SkAlphaType,
        cs: sk_sp<SkColorSpace>,
    ) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Make@SkImageInfo@@SA?AU1@USkISize@@W4SkColorType@@W4SkAlphaType@@@Z"]
    pub fn SkImageInfo_Make2(dimensions: SkISize, ct: SkColorType, at: SkAlphaType) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Make@SkImageInfo@@SA?AU1@USkISize@@W4SkColorType@@W4SkAlphaType@@V?$sk_sp@VSkColorSpace@@@@@Z"]
    pub fn SkImageInfo_Make3(
        dimensions: SkISize,
        ct: SkColorType,
        at: SkAlphaType,
        cs: sk_sp<SkColorSpace>,
    ) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeN32@SkImageInfo@@SA?AU1@HHW4SkAlphaType@@@Z"]
    pub fn SkImageInfo_MakeN32(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        at: SkAlphaType,
    ) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeN32@SkImageInfo@@SA?AU1@HHW4SkAlphaType@@V?$sk_sp@VSkColorSpace@@@@@Z"]
    pub fn SkImageInfo_MakeN321(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        at: SkAlphaType,
        cs: sk_sp<SkColorSpace>,
    ) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeS32@SkImageInfo@@SA?AU1@HHW4SkAlphaType@@@Z"]
    pub fn SkImageInfo_MakeS32(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        at: SkAlphaType,
    ) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeN32Premul@SkImageInfo@@SA?AU1@HH@Z"]
    pub fn SkImageInfo_MakeN32Premul(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
    ) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeN32Premul@SkImageInfo@@SA?AU1@HHV?$sk_sp@VSkColorSpace@@@@@Z"]
    pub fn SkImageInfo_MakeN32Premul1(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        cs: sk_sp<SkColorSpace>,
    ) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeN32Premul@SkImageInfo@@SA?AU1@USkISize@@@Z"]
    pub fn SkImageInfo_MakeN32Premul2(dimensions: SkISize) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeN32Premul@SkImageInfo@@SA?AU1@USkISize@@V?$sk_sp@VSkColorSpace@@@@@Z"]
    pub fn SkImageInfo_MakeN32Premul3(dimensions: SkISize, cs: sk_sp<SkColorSpace>) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeA8@SkImageInfo@@SA?AU1@HH@Z"]
    pub fn SkImageInfo_MakeA8(width: ::core::ffi::c_int, height: ::core::ffi::c_int)
    -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeA8@SkImageInfo@@SA?AU1@USkISize@@@Z"]
    pub fn SkImageInfo_MakeA81(dimensions: SkISize) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeUnknown@SkImageInfo@@SA?AU1@HH@Z"]
    pub fn SkImageInfo_MakeUnknown(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
    ) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?colorSpace@SkImageInfo@@QEBAPEAVSkColorSpace@@XZ"]
    pub fn SkImageInfo_colorSpace(this: *const SkImageInfo) -> *mut SkColorSpace;
}
unsafe extern "C" {
    #[link_name = "\u{1}?refColorSpace@SkImageInfo@@QEBA?AV?$sk_sp@VSkColorSpace@@@@XZ"]
    pub fn SkImageInfo_refColorSpace(this: *const SkImageInfo) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeColorSpace@SkImageInfo@@QEBA?AU1@V?$sk_sp@VSkColorSpace@@@@@Z"]
    pub fn SkImageInfo_makeColorSpace(
        this: *const SkImageInfo,
        cs: sk_sp<SkColorSpace>,
    ) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?computeOffset@SkImageInfo@@QEBA_KHH_K@Z"]
    pub fn SkImageInfo_computeOffset(
        this: *const SkImageInfo,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        rowBytes: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "\u{1}?computeByteSize@SkImageInfo@@QEBA_K_K@Z"]
    pub fn SkImageInfo_computeByteSize(this: *const SkImageInfo, rowBytes: usize) -> usize;
}
impl SkImageInfo {
    #[inline]
    pub unsafe fn Make(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        ct: SkColorType,
        at: SkAlphaType,
    ) -> SkImageInfo {
        SkImageInfo_Make(width, height, ct, at)
    }
    #[inline]
    pub unsafe fn Make1(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        ct: SkColorType,
        at: SkAlphaType,
        cs: sk_sp<SkColorSpace>,
    ) -> SkImageInfo {
        SkImageInfo_Make1(width, height, ct, at, cs)
    }
    #[inline]
    pub unsafe fn Make2(dimensions: SkISize, ct: SkColorType, at: SkAlphaType) -> SkImageInfo {
        SkImageInfo_Make2(dimensions, ct, at)
    }
    #[inline]
    pub unsafe fn Make3(
        dimensions: SkISize,
        ct: SkColorType,
        at: SkAlphaType,
        cs: sk_sp<SkColorSpace>,
    ) -> SkImageInfo {
        SkImageInfo_Make3(dimensions, ct, at, cs)
    }
    #[inline]
    pub unsafe fn MakeN32(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        at: SkAlphaType,
    ) -> SkImageInfo {
        SkImageInfo_MakeN32(width, height, at)
    }
    #[inline]
    pub unsafe fn MakeN321(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        at: SkAlphaType,
        cs: sk_sp<SkColorSpace>,
    ) -> SkImageInfo {
        SkImageInfo_MakeN321(width, height, at, cs)
    }
    #[inline]
    pub unsafe fn MakeS32(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        at: SkAlphaType,
    ) -> SkImageInfo {
        SkImageInfo_MakeS32(width, height, at)
    }
    #[inline]
    pub unsafe fn MakeN32Premul(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
    ) -> SkImageInfo {
        SkImageInfo_MakeN32Premul(width, height)
    }
    #[inline]
    pub unsafe fn MakeN32Premul1(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        cs: sk_sp<SkColorSpace>,
    ) -> SkImageInfo {
        SkImageInfo_MakeN32Premul1(width, height, cs)
    }
    #[inline]
    pub unsafe fn MakeN32Premul2(dimensions: SkISize) -> SkImageInfo {
        SkImageInfo_MakeN32Premul2(dimensions)
    }
    #[inline]
    pub unsafe fn MakeN32Premul3(dimensions: SkISize, cs: sk_sp<SkColorSpace>) -> SkImageInfo {
        SkImageInfo_MakeN32Premul3(dimensions, cs)
    }
    #[inline]
    pub unsafe fn MakeA8(width: ::core::ffi::c_int, height: ::core::ffi::c_int) -> SkImageInfo {
        SkImageInfo_MakeA8(width, height)
    }
    #[inline]
    pub unsafe fn MakeA81(dimensions: SkISize) -> SkImageInfo {
        SkImageInfo_MakeA81(dimensions)
    }
    #[inline]
    pub unsafe fn MakeUnknown(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
    ) -> SkImageInfo {
        SkImageInfo_MakeUnknown(width, height)
    }
    #[inline]
    pub unsafe fn colorSpace(&self) -> *mut SkColorSpace {
        SkImageInfo_colorSpace(self)
    }
    #[inline]
    pub unsafe fn refColorSpace(&self) -> sk_sp<SkColorSpace> {
        SkImageInfo_refColorSpace(self)
    }
    #[inline]
    pub unsafe fn makeColorSpace(&self, cs: sk_sp<SkColorSpace>) -> SkImageInfo {
        SkImageInfo_makeColorSpace(self, cs)
    }
    #[inline]
    pub unsafe fn computeOffset(
        &self,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
        rowBytes: usize,
    ) -> usize {
        SkImageInfo_computeOffset(self, x, y, rowBytes)
    }
    #[inline]
    pub unsafe fn computeByteSize(&self, rowBytes: usize) -> usize {
        SkImageInfo_computeByteSize(self, rowBytes)
    }
}
pub type SkColor = u32;
pub const SK_ColorTRANSPARENT: SkColor = 0;
pub const SK_ColorBLACK: SkColor = 4278190080;
pub const SK_ColorDKGRAY: SkColor = 4282664004;
pub const SK_ColorGRAY: SkColor = 4287137928;
pub const SK_ColorLTGRAY: SkColor = 4291611852;
pub const SK_ColorWHITE: SkColor = 4294967295;
pub const SK_ColorRED: SkColor = 4294901760;
pub const SK_ColorGREEN: SkColor = 4278255360;
pub const SK_ColorBLUE: SkColor = 4278190335;
pub const SK_ColorYELLOW: SkColor = 4294967040;
pub const SK_ColorCYAN: SkColor = 4278255615;
pub const SK_ColorMAGENTA: SkColor = 4294902015;
unsafe extern "C" {
    #[link_name = "\u{1}?SkRGBToHSV@@YAXIIIQEAM@Z"]
    pub fn SkRGBToHSV(red: U8CPU, green: U8CPU, blue: U8CPU, hsv: *mut SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkHSVToColor@@YAIIQEBM@Z"]
    pub fn SkHSVToColor(alpha: U8CPU, hsv: *const SkScalar) -> SkColor;
}
pub type SkPMColor = u32;
unsafe extern "C" {
    #[link_name = "\u{1}?SkPreMultiplyARGB@@YAIIIII@Z"]
    pub fn SkPreMultiplyARGB(a: U8CPU, r: U8CPU, g: U8CPU, b: U8CPU) -> SkPMColor;
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkPreMultiplyColor@@YAII@Z"]
    pub fn SkPreMultiplyColor(c: SkColor) -> SkPMColor;
}
impl SkColorChannel {
    pub const LastEnum: SkColorChannel = SkColorChannel::A;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkColorChannel {
    R = 0,
    G = 1,
    B = 2,
    A = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkColorChannelFlag {
    kRed_SkColorChannelFlag = 1,
    kGreen_SkColorChannelFlag = 2,
    kBlue_SkColorChannelFlag = 4,
    kAlpha_SkColorChannelFlag = 8,
    kGray_SkColorChannelFlag = 16,
    kGrayAlpha_SkColorChannelFlags = 24,
    kRG_SkColorChannelFlags = 3,
    kRGB_SkColorChannelFlags = 7,
    kRGBA_SkColorChannelFlags = 15,
}
unsafe extern "C" {
    #[link_name = "\u{1}FromColor"]
    pub fn SkRGBA4f_FromColor(color: SkColor) -> u8;
}
unsafe extern "C" {
    #[link_name = "\u{1}toSkColor"]
    pub fn SkRGBA4f_toSkColor(this: *const u8) -> SkColor;
}
unsafe extern "C" {
    #[link_name = "\u{1}FromPMColor"]
    pub fn SkRGBA4f_FromPMColor(arg1: SkPMColor) -> u8;
}
unsafe extern "C" {
    #[link_name = "\u{1}toBytes_RGBA"]
    pub fn SkRGBA4f_toBytes_RGBA(this: *const u8) -> u32;
}
unsafe extern "C" {
    #[link_name = "\u{1}FromBytes_RGBA"]
    pub fn SkRGBA4f_FromBytes_RGBA(color: u32) -> u8;
}
pub type SkColor4f = __BindgenOpaqueArray<u32, 4usize>;
impl SkFilterMode {
    pub const Last: SkFilterMode = SkFilterMode::Linear;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkFilterMode {
    Nearest = 0,
    Linear = 1,
}
impl SkMipmapMode {
    pub const Last: SkMipmapMode = SkMipmapMode::Linear;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkMipmapMode {
    None = 0,
    Nearest = 1,
    Linear = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkCubicResampler {
    pub B: f32,
    pub C: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCubicResampler"][::core::mem::size_of::<SkCubicResampler>() - 8usize];
    ["Alignment of SkCubicResampler"][::core::mem::align_of::<SkCubicResampler>() - 4usize];
    ["Offset of field: SkCubicResampler::B"][::core::mem::offset_of!(SkCubicResampler, B) - 0usize];
    ["Offset of field: SkCubicResampler::C"][::core::mem::offset_of!(SkCubicResampler, C) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkSamplingOptions {
    pub maxAniso: ::core::ffi::c_int,
    pub useCubic: bool,
    pub cubic: SkCubicResampler,
    pub filter: SkFilterMode,
    pub mipmap: SkMipmapMode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkSamplingOptions"][::core::mem::size_of::<SkSamplingOptions>() - 24usize];
    ["Alignment of SkSamplingOptions"][::core::mem::align_of::<SkSamplingOptions>() - 4usize];
    ["Offset of field: SkSamplingOptions::maxAniso"]
        [::core::mem::offset_of!(SkSamplingOptions, maxAniso) - 0usize];
    ["Offset of field: SkSamplingOptions::useCubic"]
        [::core::mem::offset_of!(SkSamplingOptions, useCubic) - 4usize];
    ["Offset of field: SkSamplingOptions::cubic"]
        [::core::mem::offset_of!(SkSamplingOptions, cubic) - 8usize];
    ["Offset of field: SkSamplingOptions::filter"]
        [::core::mem::offset_of!(SkSamplingOptions, filter) - 16usize];
    ["Offset of field: SkSamplingOptions::mipmap"]
        [::core::mem::offset_of!(SkSamplingOptions, mipmap) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkMask {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug)]
pub struct SkPixmap {
    pub fPixels: *const ::core::ffi::c_void,
    pub fRowBytes: usize,
    pub fInfo: SkImageInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkPixmap"][::core::mem::size_of::<SkPixmap>() - 40usize];
    ["Alignment of SkPixmap"][::core::mem::align_of::<SkPixmap>() - 8usize];
    ["Offset of field: SkPixmap::fPixels"][::core::mem::offset_of!(SkPixmap, fPixels) - 0usize];
    ["Offset of field: SkPixmap::fRowBytes"][::core::mem::offset_of!(SkPixmap, fRowBytes) - 8usize];
    ["Offset of field: SkPixmap::fInfo"][::core::mem::offset_of!(SkPixmap, fInfo) - 16usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?reset@SkPixmap@@QEAAXXZ"]
    pub fn SkPixmap_reset(this: *mut SkPixmap);
}
unsafe extern "C" {
    #[link_name = "\u{1}?reset@SkPixmap@@QEAAXAEBUSkImageInfo@@PEBX_K@Z"]
    pub fn SkPixmap_reset1(
        this: *mut SkPixmap,
        info: *const SkImageInfo,
        addr: *const ::core::ffi::c_void,
        rowBytes: usize,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?setColorSpace@SkPixmap@@QEAAXV?$sk_sp@VSkColorSpace@@@@@Z"]
    pub fn SkPixmap_setColorSpace(this: *mut SkPixmap, colorSpace: sk_sp<SkColorSpace>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?reset@SkPixmap@@QEAA_NAEBUSkMask@@@Z"]
    pub fn SkPixmap_reset2(this: *mut SkPixmap, mask: *const SkMask) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?extractSubset@SkPixmap@@QEBA_NPEAV1@AEBUSkIRect@@@Z"]
    pub fn SkPixmap_extractSubset(
        this: *const SkPixmap,
        subset: *mut SkPixmap,
        area: *const SkIRect,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?colorSpace@SkPixmap@@QEBAPEAVSkColorSpace@@XZ"]
    pub fn SkPixmap_colorSpace(this: *const SkPixmap) -> *mut SkColorSpace;
}
unsafe extern "C" {
    #[link_name = "\u{1}?refColorSpace@SkPixmap@@QEBA?AV?$sk_sp@VSkColorSpace@@@@XZ"]
    pub fn SkPixmap_refColorSpace(this: *const SkPixmap) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?computeIsOpaque@SkPixmap@@QEBA_NXZ"]
    pub fn SkPixmap_computeIsOpaque(this: *const SkPixmap) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getColor@SkPixmap@@QEBAIHH@Z"]
    pub fn SkPixmap_getColor(
        this: *const SkPixmap,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
    ) -> SkColor;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getColor4f@SkPixmap@@QEBA?AU?$SkRGBA4f@$02@@HH@Z"]
    pub fn SkPixmap_getColor4f(
        this: *const SkPixmap,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
    ) -> SkColor4f;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getAlphaf@SkPixmap@@QEBAMHH@Z"]
    pub fn SkPixmap_getAlphaf(
        this: *const SkPixmap,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
    ) -> f32;
}
unsafe extern "C" {
    #[link_name = "\u{1}?readPixels@SkPixmap@@QEBA_NAEBUSkImageInfo@@PEAX_KHH@Z"]
    pub fn SkPixmap_readPixels(
        this: *const SkPixmap,
        dstInfo: *const SkImageInfo,
        dstPixels: *mut ::core::ffi::c_void,
        dstRowBytes: usize,
        srcX: ::core::ffi::c_int,
        srcY: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?scalePixels@SkPixmap@@QEBA_NAEBV1@AEBUSkSamplingOptions@@@Z"]
    pub fn SkPixmap_scalePixels(
        this: *const SkPixmap,
        dst: *const SkPixmap,
        arg1: *const SkSamplingOptions,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?erase@SkPixmap@@QEBA_NIAEBUSkIRect@@@Z"]
    pub fn SkPixmap_erase(this: *const SkPixmap, color: SkColor, subset: *const SkIRect) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?erase@SkPixmap@@QEBA_NAEBU?$SkRGBA4f@$02@@PEBUSkIRect@@@Z"]
    pub fn SkPixmap_erase1(
        this: *const SkPixmap,
        color: *const SkColor4f,
        subset: *const SkIRect,
    ) -> bool;
}
impl SkPixmap {
    #[inline]
    pub unsafe fn reset(&mut self) {
        SkPixmap_reset(self)
    }
    #[inline]
    pub unsafe fn reset1(
        &mut self,
        info: *const SkImageInfo,
        addr: *const ::core::ffi::c_void,
        rowBytes: usize,
    ) {
        SkPixmap_reset1(self, info, addr, rowBytes)
    }
    #[inline]
    pub unsafe fn setColorSpace(&mut self, colorSpace: sk_sp<SkColorSpace>) {
        SkPixmap_setColorSpace(self, colorSpace)
    }
    #[inline]
    pub unsafe fn reset2(&mut self, mask: *const SkMask) -> bool {
        SkPixmap_reset2(self, mask)
    }
    #[inline]
    pub unsafe fn extractSubset(&self, subset: *mut SkPixmap, area: *const SkIRect) -> bool {
        SkPixmap_extractSubset(self, subset, area)
    }
    #[inline]
    pub unsafe fn colorSpace(&self) -> *mut SkColorSpace {
        SkPixmap_colorSpace(self)
    }
    #[inline]
    pub unsafe fn refColorSpace(&self) -> sk_sp<SkColorSpace> {
        SkPixmap_refColorSpace(self)
    }
    #[inline]
    pub unsafe fn computeIsOpaque(&self) -> bool {
        SkPixmap_computeIsOpaque(self)
    }
    #[inline]
    pub unsafe fn getColor(&self, x: ::core::ffi::c_int, y: ::core::ffi::c_int) -> SkColor {
        SkPixmap_getColor(self, x, y)
    }
    #[inline]
    pub unsafe fn getColor4f(&self, x: ::core::ffi::c_int, y: ::core::ffi::c_int) -> SkColor4f {
        SkPixmap_getColor4f(self, x, y)
    }
    #[inline]
    pub unsafe fn getAlphaf(&self, x: ::core::ffi::c_int, y: ::core::ffi::c_int) -> f32 {
        SkPixmap_getAlphaf(self, x, y)
    }
    #[inline]
    pub unsafe fn readPixels(
        &self,
        dstInfo: *const SkImageInfo,
        dstPixels: *mut ::core::ffi::c_void,
        dstRowBytes: usize,
        srcX: ::core::ffi::c_int,
        srcY: ::core::ffi::c_int,
    ) -> bool {
        SkPixmap_readPixels(self, dstInfo, dstPixels, dstRowBytes, srcX, srcY)
    }
    #[inline]
    pub unsafe fn scalePixels(&self, dst: *const SkPixmap, arg1: *const SkSamplingOptions) -> bool {
        SkPixmap_scalePixels(self, dst, arg1)
    }
    #[inline]
    pub unsafe fn erase(&self, color: SkColor, subset: *const SkIRect) -> bool {
        SkPixmap_erase(self, color, subset)
    }
    #[inline]
    pub unsafe fn erase1(&self, color: *const SkColor4f, subset: *const SkIRect) -> bool {
        SkPixmap_erase1(self, color, subset)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct SkData {
    pub _base: SkNVRefCnt,
    pub fReleaseProc: SkData_ReleaseProc,
    pub fReleaseProcContext: *mut ::core::ffi::c_void,
    pub fSpan: SkSpan<std_byte>,
}
pub type SkData_ReleaseProc = ::core::option::Option<
    unsafe extern "C" fn(ptr: *const ::core::ffi::c_void, context: *mut ::core::ffi::c_void),
>;
pub type SkData_INHERITED = SkRefCnt;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkData"][::core::mem::size_of::<SkData>() - 40usize];
    ["Alignment of SkData"][::core::mem::align_of::<SkData>() - 8usize];
    ["Offset of field: SkData::fReleaseProc"]
        [::core::mem::offset_of!(SkData, fReleaseProc) - 8usize];
    ["Offset of field: SkData::fReleaseProcContext"]
        [::core::mem::offset_of!(SkData, fReleaseProcContext) - 16usize];
    ["Offset of field: SkData::fSpan"][::core::mem::offset_of!(SkData, fSpan) - 24usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?copySubset@SkData@@QEBA?AV?$sk_sp@VSkData@@@@_K0@Z"]
    pub fn SkData_copySubset(this: *const SkData, offset: usize, length: usize) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?shareSubset@SkData@@QEAA?AV?$sk_sp@VSkData@@@@_K0@Z"]
    pub fn SkData_shareSubset(this: *mut SkData, offset: usize, length: usize) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?copyRange@SkData@@QEBA_K_K0PEAX@Z"]
    pub fn SkData_copyRange(
        this: *const SkData,
        offset: usize,
        length: usize,
        buffer: *mut ::core::ffi::c_void,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeWithCopy@SkData@@SA?AV?$sk_sp@VSkData@@@@PEBX_K@Z"]
    pub fn SkData_MakeWithCopy(data: *const ::core::ffi::c_void, length: usize) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeUninitialized@SkData@@SA?AV?$sk_sp@VSkData@@@@_K@Z"]
    pub fn SkData_MakeUninitialized(length: usize) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeZeroInitialized@SkData@@SA?AV?$sk_sp@VSkData@@@@_K@Z"]
    pub fn SkData_MakeZeroInitialized(length: usize) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeWithCString@SkData@@SA?AV?$sk_sp@VSkData@@@@QEBD@Z"]
    pub fn SkData_MakeWithCString(cstr: *const ::core::ffi::c_char) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeWithProc@SkData@@SA?AV?$sk_sp@VSkData@@@@PEBX_KP6AX0PEAX@Z2@Z"]
    pub fn SkData_MakeWithProc(
        ptr: *const ::core::ffi::c_void,
        length: usize,
        proc_: SkData_ReleaseProc,
        ctx: *mut ::core::ffi::c_void,
    ) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeFromMalloc@SkData@@SA?AV?$sk_sp@VSkData@@@@PEBX_K@Z"]
    pub fn SkData_MakeFromMalloc(data: *const ::core::ffi::c_void, length: usize) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeFromFileName@SkData@@SA?AV?$sk_sp@VSkData@@@@QEBD@Z"]
    pub fn SkData_MakeFromFileName(path: *const ::core::ffi::c_char) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeFromFILE@SkData@@SA?AV?$sk_sp@VSkData@@@@PEAU_iobuf@@@Z"]
    pub fn SkData_MakeFromFILE(f: *mut FILE) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeFromFD@SkData@@SA?AV?$sk_sp@VSkData@@@@H@Z"]
    pub fn SkData_MakeFromFD(fd: ::core::ffi::c_int) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeFromStream@SkData@@SA?AV?$sk_sp@VSkData@@@@PEAVSkStream@@_K@Z"]
    pub fn SkData_MakeFromStream(arg1: *mut SkStream, size: usize) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeEmpty@SkData@@SA?AV?$sk_sp@VSkData@@@@XZ"]
    pub fn SkData_MakeEmpty() -> sk_sp<SkData>;
}
impl SkData {
    #[inline]
    pub unsafe fn copySubset(&self, offset: usize, length: usize) -> sk_sp<SkData> {
        SkData_copySubset(self, offset, length)
    }
    #[inline]
    pub unsafe fn shareSubset(&mut self, offset: usize, length: usize) -> sk_sp<SkData> {
        SkData_shareSubset(self, offset, length)
    }
    #[inline]
    pub unsafe fn copyRange(
        &self,
        offset: usize,
        length: usize,
        buffer: *mut ::core::ffi::c_void,
    ) -> usize {
        SkData_copyRange(self, offset, length, buffer)
    }
    #[inline]
    pub unsafe fn MakeWithCopy(data: *const ::core::ffi::c_void, length: usize) -> sk_sp<SkData> {
        SkData_MakeWithCopy(data, length)
    }
    #[inline]
    pub unsafe fn MakeUninitialized(length: usize) -> sk_sp<SkData> {
        SkData_MakeUninitialized(length)
    }
    #[inline]
    pub unsafe fn MakeZeroInitialized(length: usize) -> sk_sp<SkData> {
        SkData_MakeZeroInitialized(length)
    }
    #[inline]
    pub unsafe fn MakeWithCString(cstr: *const ::core::ffi::c_char) -> sk_sp<SkData> {
        SkData_MakeWithCString(cstr)
    }
    #[inline]
    pub unsafe fn MakeWithProc(
        ptr: *const ::core::ffi::c_void,
        length: usize,
        proc_: SkData_ReleaseProc,
        ctx: *mut ::core::ffi::c_void,
    ) -> sk_sp<SkData> {
        SkData_MakeWithProc(ptr, length, proc_, ctx)
    }
    #[inline]
    pub unsafe fn MakeFromMalloc(data: *const ::core::ffi::c_void, length: usize) -> sk_sp<SkData> {
        SkData_MakeFromMalloc(data, length)
    }
    #[inline]
    pub unsafe fn MakeFromFileName(path: *const ::core::ffi::c_char) -> sk_sp<SkData> {
        SkData_MakeFromFileName(path)
    }
    #[inline]
    pub unsafe fn MakeFromFILE(f: *mut FILE) -> sk_sp<SkData> {
        SkData_MakeFromFILE(f)
    }
    #[inline]
    pub unsafe fn MakeFromFD(fd: ::core::ffi::c_int) -> sk_sp<SkData> {
        SkData_MakeFromFD(fd)
    }
    #[inline]
    pub unsafe fn MakeFromStream(arg1: *mut SkStream, size: usize) -> sk_sp<SkData> {
        SkData_MakeFromStream(arg1, size)
    }
    #[inline]
    pub unsafe fn MakeEmpty() -> sk_sp<SkData> {
        SkData_MakeEmpty()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkYUVAInfo {
    pub fDimensions: SkISize,
    pub fPlaneConfig: SkYUVAInfo_PlaneConfig,
    pub fSubsampling: SkYUVAInfo_Subsampling,
    pub fYUVColorSpace: SkYUVColorSpace,
    pub fOrigin: SkEncodedOrigin,
    pub fSitingX: SkYUVAInfo_Siting,
    pub fSitingY: SkYUVAInfo_Siting,
}
impl SkYUVAInfo_YUVAChannels {
    pub const kLast: SkYUVAInfo_YUVAChannels = SkYUVAInfo_YUVAChannels::kA;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkYUVAInfo_YUVAChannels {
    kY = 0,
    kU = 1,
    kV = 2,
    kA = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkYUVAInfo_YUVALocation {
    _unused: [u8; 0],
}
pub type SkYUVAInfo_YUVALocations = u8;
impl SkYUVAInfo_PlaneConfig {
    pub const Last: SkYUVAInfo_PlaneConfig = SkYUVAInfo_PlaneConfig::UYVA;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkYUVAInfo_PlaneConfig {
    Unknown = 0,
    Y_U_V = 1,
    Y_V_U = 2,
    Y_UV = 3,
    Y_VU = 4,
    YUV = 5,
    UYV = 6,
    Y_U_V_A = 7,
    Y_V_U_A = 8,
    Y_UV_A = 9,
    Y_VU_A = 10,
    YUVA = 11,
    UYVA = 12,
}
impl SkYUVAInfo_Subsampling {
    pub const kLast: SkYUVAInfo_Subsampling = SkYUVAInfo_Subsampling::k410;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkYUVAInfo_Subsampling {
    kUnknown = 0,
    k444 = 1,
    k422 = 2,
    k420 = 3,
    k440 = 4,
    k411 = 5,
    k410 = 6,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkYUVAInfo_Siting {
    Centered = 0,
}
pub const SkYUVAInfo_kYUVAChannelCount: ::core::ffi::c_int = 4;
pub const SkYUVAInfo_kMaxPlanes: ::core::ffi::c_int = 4;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkYUVAInfo"][::core::mem::size_of::<SkYUVAInfo>() - 32usize];
    ["Alignment of SkYUVAInfo"][::core::mem::align_of::<SkYUVAInfo>() - 4usize];
    ["Offset of field: SkYUVAInfo::fDimensions"]
        [::core::mem::offset_of!(SkYUVAInfo, fDimensions) - 0usize];
    ["Offset of field: SkYUVAInfo::fPlaneConfig"]
        [::core::mem::offset_of!(SkYUVAInfo, fPlaneConfig) - 8usize];
    ["Offset of field: SkYUVAInfo::fSubsampling"]
        [::core::mem::offset_of!(SkYUVAInfo, fSubsampling) - 12usize];
    ["Offset of field: SkYUVAInfo::fYUVColorSpace"]
        [::core::mem::offset_of!(SkYUVAInfo, fYUVColorSpace) - 16usize];
    ["Offset of field: SkYUVAInfo::fOrigin"]
        [::core::mem::offset_of!(SkYUVAInfo, fOrigin) - 20usize];
    ["Offset of field: SkYUVAInfo::fSitingX"]
        [::core::mem::offset_of!(SkYUVAInfo, fSitingX) - 24usize];
    ["Offset of field: SkYUVAInfo::fSitingY"]
        [::core::mem::offset_of!(SkYUVAInfo, fSitingY) - 28usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?SubsamplingFactors@SkYUVAInfo@@SA?AV?$tuple@HH@std@@W4Subsampling@1@@Z"]
    pub fn SkYUVAInfo_SubsamplingFactors(
        arg1: SkYUVAInfo_Subsampling,
    ) -> __BindgenOpaqueArray<u32, 2usize>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?PlaneSubsamplingFactors@SkYUVAInfo@@SA?AV?$tuple@HH@std@@W4PlaneConfig@1@W4Subsampling@1@H@Z"]
    pub fn SkYUVAInfo_PlaneSubsamplingFactors(
        arg1: SkYUVAInfo_PlaneConfig,
        arg2: SkYUVAInfo_Subsampling,
        planeIdx: ::core::ffi::c_int,
    ) -> __BindgenOpaqueArray<u32, 2usize>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?PlaneDimensions@SkYUVAInfo@@SAHUSkISize@@W4PlaneConfig@1@W4Subsampling@1@W4SkEncodedOrigin@@QEAU2@@Z"]
    pub fn SkYUVAInfo_PlaneDimensions(
        imageDimensions: SkISize,
        arg1: SkYUVAInfo_PlaneConfig,
        arg2: SkYUVAInfo_Subsampling,
        arg3: SkEncodedOrigin,
        planeDimensions: *mut SkISize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?GetYUVALocations@SkYUVAInfo@@SA?AV?$array@UYUVALocation@SkYUVAInfo@@$03@std@@W4PlaneConfig@1@PEBI@Z"]
    pub fn SkYUVAInfo_GetYUVALocations(
        arg1: SkYUVAInfo_PlaneConfig,
        planeChannelFlags: *const u32,
    ) -> SkYUVAInfo_YUVALocations;
}
unsafe extern "C" {
    #[link_name = "\u{1}?HasAlpha@SkYUVAInfo@@SA_NW4PlaneConfig@1@@Z"]
    pub fn SkYUVAInfo_HasAlpha(arg1: SkYUVAInfo_PlaneConfig) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?computeTotalBytes@SkYUVAInfo@@QEBA_KQEB_KQEA_K@Z"]
    pub fn SkYUVAInfo_computeTotalBytes(
        this: *const SkYUVAInfo,
        rowBytes: *const usize,
        planeSizes: *mut usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "\u{1}?toYUVALocations@SkYUVAInfo@@QEBA?AV?$array@UYUVALocation@SkYUVAInfo@@$03@std@@PEBI@Z"]
    pub fn SkYUVAInfo_toYUVALocations(
        this: *const SkYUVAInfo,
        channelFlags: *const u32,
    ) -> SkYUVAInfo_YUVALocations;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeSubsampling@SkYUVAInfo@@QEBA?AV1@W4Subsampling@1@@Z"]
    pub fn SkYUVAInfo_makeSubsampling(
        this: *const SkYUVAInfo,
        arg1: SkYUVAInfo_Subsampling,
    ) -> SkYUVAInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeDimensions@SkYUVAInfo@@QEBA?AV1@USkISize@@@Z"]
    pub fn SkYUVAInfo_makeDimensions(this: *const SkYUVAInfo, arg1: SkISize) -> SkYUVAInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkYUVAInfo@@QEAA@USkISize@@W4PlaneConfig@0@W4Subsampling@0@W4SkYUVColorSpace@@W4SkEncodedOrigin@@W4Siting@0@5@Z"]
    pub fn SkYUVAInfo_SkYUVAInfo(
        this: *mut SkYUVAInfo,
        dimensions: SkISize,
        arg1: SkYUVAInfo_PlaneConfig,
        arg2: SkYUVAInfo_Subsampling,
        arg3: SkYUVColorSpace,
        origin: SkEncodedOrigin,
        sitingX: SkYUVAInfo_Siting,
        sitingY: SkYUVAInfo_Siting,
    );
}
impl SkYUVAInfo {
    #[inline]
    pub unsafe fn SubsamplingFactors(
        arg1: SkYUVAInfo_Subsampling,
    ) -> __BindgenOpaqueArray<u32, 2usize> {
        SkYUVAInfo_SubsamplingFactors(arg1)
    }
    #[inline]
    pub unsafe fn PlaneSubsamplingFactors(
        arg1: SkYUVAInfo_PlaneConfig,
        arg2: SkYUVAInfo_Subsampling,
        planeIdx: ::core::ffi::c_int,
    ) -> __BindgenOpaqueArray<u32, 2usize> {
        SkYUVAInfo_PlaneSubsamplingFactors(arg1, arg2, planeIdx)
    }
    #[inline]
    pub unsafe fn PlaneDimensions(
        imageDimensions: SkISize,
        arg1: SkYUVAInfo_PlaneConfig,
        arg2: SkYUVAInfo_Subsampling,
        arg3: SkEncodedOrigin,
        planeDimensions: *mut SkISize,
    ) -> ::core::ffi::c_int {
        SkYUVAInfo_PlaneDimensions(imageDimensions, arg1, arg2, arg3, planeDimensions)
    }
    #[inline]
    pub unsafe fn GetYUVALocations(
        arg1: SkYUVAInfo_PlaneConfig,
        planeChannelFlags: *const u32,
    ) -> SkYUVAInfo_YUVALocations {
        SkYUVAInfo_GetYUVALocations(arg1, planeChannelFlags)
    }
    #[inline]
    pub unsafe fn HasAlpha(arg1: SkYUVAInfo_PlaneConfig) -> bool {
        SkYUVAInfo_HasAlpha(arg1)
    }
    #[inline]
    pub unsafe fn computeTotalBytes(
        &self,
        rowBytes: *const usize,
        planeSizes: *mut usize,
    ) -> usize {
        SkYUVAInfo_computeTotalBytes(self, rowBytes, planeSizes)
    }
    #[inline]
    pub unsafe fn toYUVALocations(&self, channelFlags: *const u32) -> SkYUVAInfo_YUVALocations {
        SkYUVAInfo_toYUVALocations(self, channelFlags)
    }
    #[inline]
    pub unsafe fn makeSubsampling(&self, arg1: SkYUVAInfo_Subsampling) -> SkYUVAInfo {
        SkYUVAInfo_makeSubsampling(self, arg1)
    }
    #[inline]
    pub unsafe fn makeDimensions(&self, arg1: SkISize) -> SkYUVAInfo {
        SkYUVAInfo_makeDimensions(self, arg1)
    }
    #[inline]
    pub unsafe fn new(
        dimensions: SkISize,
        arg1: SkYUVAInfo_PlaneConfig,
        arg2: SkYUVAInfo_Subsampling,
        arg3: SkYUVColorSpace,
        origin: SkEncodedOrigin,
        sitingX: SkYUVAInfo_Siting,
        sitingY: SkYUVAInfo_Siting,
    ) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkYUVAInfo_SkYUVAInfo(
            __bindgen_tmp.as_mut_ptr(),
            dimensions,
            arg1,
            arg2,
            arg3,
            origin,
            sitingX,
            sitingY,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
pub struct SkYUVAPixmapInfo {
    pub fYUVAInfo: SkYUVAInfo,
    pub fPlaneInfos: __BindgenOpaqueArray<u64, 12usize>,
    pub fRowBytes: __BindgenOpaqueArray<u64, 4usize>,
    pub fDataType: SkYUVAPixmapInfo_DataType,
}
pub use self::SkYUVAInfo_PlaneConfig as SkYUVAPixmapInfo_PlaneConfig;
pub use self::SkYUVAInfo_Subsampling as SkYUVAPixmapInfo_Subsampling;
impl SkYUVAPixmapInfo_DataType {
    pub const Last: SkYUVAPixmapInfo_DataType = SkYUVAPixmapInfo_DataType::Unorm10_Unorm2;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkYUVAPixmapInfo_DataType {
    Unorm8 = 0,
    Unorm16 = 1,
    Float16 = 2,
    Unorm10_Unorm2 = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkYUVAPixmapInfo_SupportedDataTypes {
    pub fDataTypeSupport: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkYUVAPixmapInfo_SupportedDataTypes"]
        [::core::mem::size_of::<SkYUVAPixmapInfo_SupportedDataTypes>() - 4usize];
    ["Alignment of SkYUVAPixmapInfo_SupportedDataTypes"]
        [::core::mem::align_of::<SkYUVAPixmapInfo_SupportedDataTypes>() - 4usize];
    ["Offset of field: SkYUVAPixmapInfo_SupportedDataTypes::fDataTypeSupport"]
        [::core::mem::offset_of!(SkYUVAPixmapInfo_SupportedDataTypes, fDataTypeSupport) - 0usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?enableDataType@SupportedDataTypes@SkYUVAPixmapInfo@@QEAAXW4DataType@2@H@Z"]
    pub fn SkYUVAPixmapInfo_SupportedDataTypes_enableDataType(
        this: *mut SkYUVAPixmapInfo_SupportedDataTypes,
        arg1: SkYUVAPixmapInfo_DataType,
        numChannels: ::core::ffi::c_int,
    );
}
impl SkYUVAPixmapInfo_SupportedDataTypes {
    #[inline]
    pub unsafe fn enableDataType(
        &mut self,
        arg1: SkYUVAPixmapInfo_DataType,
        numChannels: ::core::ffi::c_int,
    ) {
        SkYUVAPixmapInfo_SupportedDataTypes_enableDataType(self, arg1, numChannels)
    }
}
pub const SkYUVAPixmapInfo_kMaxPlanes: ::core::ffi::c_int = 4;
pub const SkYUVAPixmapInfo_kDataTypeCnt: ::core::ffi::c_int = 4;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkYUVAPixmapInfo"][::core::mem::size_of::<SkYUVAPixmapInfo>() - 168usize];
    ["Alignment of SkYUVAPixmapInfo"][::core::mem::align_of::<SkYUVAPixmapInfo>() - 8usize];
    ["Offset of field: SkYUVAPixmapInfo::fYUVAInfo"]
        [::core::mem::offset_of!(SkYUVAPixmapInfo, fYUVAInfo) - 0usize];
    ["Offset of field: SkYUVAPixmapInfo::fPlaneInfos"]
        [::core::mem::offset_of!(SkYUVAPixmapInfo, fPlaneInfos) - 32usize];
    ["Offset of field: SkYUVAPixmapInfo::fRowBytes"]
        [::core::mem::offset_of!(SkYUVAPixmapInfo, fRowBytes) - 128usize];
    ["Offset of field: SkYUVAPixmapInfo::fDataType"]
        [::core::mem::offset_of!(SkYUVAPixmapInfo, fDataType) - 160usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?NumChannelsAndDataType@SkYUVAPixmapInfo@@SA?AV?$tuple@HW4DataType@SkYUVAPixmapInfo@@@std@@W4SkColorType@@@Z"]
    pub fn SkYUVAPixmapInfo_NumChannelsAndDataType(
        arg1: SkColorType,
    ) -> __BindgenOpaqueArray<u32, 2usize>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?computeTotalBytes@SkYUVAPixmapInfo@@QEBA_KQEA_K@Z"]
    pub fn SkYUVAPixmapInfo_computeTotalBytes(
        this: *const SkYUVAPixmapInfo,
        planeSizes: *mut usize,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "\u{1}?initPixmapsFromSingleAllocation@SkYUVAPixmapInfo@@QEBA_NPEAXQEAVSkPixmap@@@Z"]
    pub fn SkYUVAPixmapInfo_initPixmapsFromSingleAllocation(
        this: *const SkYUVAPixmapInfo,
        memory: *mut ::core::ffi::c_void,
        pixmaps: *mut SkPixmap,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?isSupported@SkYUVAPixmapInfo@@QEBA_NAEBVSupportedDataTypes@1@@Z"]
    pub fn SkYUVAPixmapInfo_isSupported(
        this: *const SkYUVAPixmapInfo,
        arg1: *const SkYUVAPixmapInfo_SupportedDataTypes,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkYUVAPixmapInfo@@QEAA@AEBVSkYUVAInfo@@QEBW4SkColorType@@QEB_K@Z"]
    pub fn SkYUVAPixmapInfo_SkYUVAPixmapInfo(
        this: *mut SkYUVAPixmapInfo,
        arg1: *const SkYUVAInfo,
        arg2: *const SkColorType,
        rowBytes: *const usize,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkYUVAPixmapInfo@@QEAA@AEBVSkYUVAInfo@@W4DataType@0@QEB_K@Z"]
    pub fn SkYUVAPixmapInfo_SkYUVAPixmapInfo1(
        this: *mut SkYUVAPixmapInfo,
        arg1: *const SkYUVAInfo,
        arg2: SkYUVAPixmapInfo_DataType,
        rowBytes: *const usize,
    );
}
impl SkYUVAPixmapInfo {
    #[inline]
    pub unsafe fn NumChannelsAndDataType(arg1: SkColorType) -> __BindgenOpaqueArray<u32, 2usize> {
        SkYUVAPixmapInfo_NumChannelsAndDataType(arg1)
    }
    #[inline]
    pub unsafe fn computeTotalBytes(&self, planeSizes: *mut usize) -> usize {
        SkYUVAPixmapInfo_computeTotalBytes(self, planeSizes)
    }
    #[inline]
    pub unsafe fn initPixmapsFromSingleAllocation(
        &self,
        memory: *mut ::core::ffi::c_void,
        pixmaps: *mut SkPixmap,
    ) -> bool {
        SkYUVAPixmapInfo_initPixmapsFromSingleAllocation(self, memory, pixmaps)
    }
    #[inline]
    pub unsafe fn isSupported(&self, arg1: *const SkYUVAPixmapInfo_SupportedDataTypes) -> bool {
        SkYUVAPixmapInfo_isSupported(self, arg1)
    }
    #[inline]
    pub unsafe fn new(
        arg1: *const SkYUVAInfo,
        arg2: *const SkColorType,
        rowBytes: *const usize,
    ) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkYUVAPixmapInfo_SkYUVAPixmapInfo(__bindgen_tmp.as_mut_ptr(), arg1, arg2, rowBytes);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        arg1: *const SkYUVAInfo,
        arg2: SkYUVAPixmapInfo_DataType,
        rowBytes: *const usize,
    ) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkYUVAPixmapInfo_SkYUVAPixmapInfo1(__bindgen_tmp.as_mut_ptr(), arg1, arg2, rowBytes);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
pub struct SkYUVAPixmaps {
    pub fPlanes: __BindgenOpaqueArray<u64, 20usize>,
    pub fData: sk_sp<SkData>,
    pub fYUVAInfo: SkYUVAInfo,
    pub fDataType: SkYUVAPixmaps_DataType,
}
pub use self::SkYUVAPixmapInfo_DataType as SkYUVAPixmaps_DataType;
pub const SkYUVAPixmaps_kMaxPlanes: ::core::ffi::c_int = 4;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkYUVAPixmaps"][::core::mem::size_of::<SkYUVAPixmaps>() - 208usize];
    ["Alignment of SkYUVAPixmaps"][::core::mem::align_of::<SkYUVAPixmaps>() - 8usize];
    ["Offset of field: SkYUVAPixmaps::fPlanes"]
        [::core::mem::offset_of!(SkYUVAPixmaps, fPlanes) - 0usize];
    ["Offset of field: SkYUVAPixmaps::fData"]
        [::core::mem::offset_of!(SkYUVAPixmaps, fData) - 160usize];
    ["Offset of field: SkYUVAPixmaps::fYUVAInfo"]
        [::core::mem::offset_of!(SkYUVAPixmaps, fYUVAInfo) - 168usize];
    ["Offset of field: SkYUVAPixmaps::fDataType"]
        [::core::mem::offset_of!(SkYUVAPixmaps, fDataType) - 200usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?RecommendedRGBAColorType@SkYUVAPixmaps@@SA?AW4SkColorType@@W4DataType@SkYUVAPixmapInfo@@@Z"]
    pub fn SkYUVAPixmaps_RecommendedRGBAColorType(arg1: SkYUVAPixmaps_DataType) -> SkColorType;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Allocate@SkYUVAPixmaps@@SA?AV1@AEBVSkYUVAPixmapInfo@@@Z"]
    pub fn SkYUVAPixmaps_Allocate(yuvaPixmapInfo: *const SkYUVAPixmapInfo) -> SkYUVAPixmaps;
}
unsafe extern "C" {
    #[link_name = "\u{1}?FromData@SkYUVAPixmaps@@SA?AV1@AEBVSkYUVAPixmapInfo@@V?$sk_sp@VSkData@@@@@Z"]
    pub fn SkYUVAPixmaps_FromData(
        arg1: *const SkYUVAPixmapInfo,
        arg2: sk_sp<SkData>,
    ) -> SkYUVAPixmaps;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeCopy@SkYUVAPixmaps@@SA?AV1@AEBV1@@Z"]
    pub fn SkYUVAPixmaps_MakeCopy(src: *const SkYUVAPixmaps) -> SkYUVAPixmaps;
}
unsafe extern "C" {
    #[link_name = "\u{1}?FromExternalMemory@SkYUVAPixmaps@@SA?AV1@AEBVSkYUVAPixmapInfo@@PEAX@Z"]
    pub fn SkYUVAPixmaps_FromExternalMemory(
        arg1: *const SkYUVAPixmapInfo,
        memory: *mut ::core::ffi::c_void,
    ) -> SkYUVAPixmaps;
}
unsafe extern "C" {
    #[link_name = "\u{1}?FromExternalPixmaps@SkYUVAPixmaps@@SA?AV1@AEBVSkYUVAInfo@@QEBVSkPixmap@@@Z"]
    pub fn SkYUVAPixmaps_FromExternalPixmaps(
        arg1: *const SkYUVAInfo,
        arg2: *const SkPixmap,
    ) -> SkYUVAPixmaps;
}
unsafe extern "C" {
    #[link_name = "\u{1}?pixmapsInfo@SkYUVAPixmaps@@QEBA?AVSkYUVAPixmapInfo@@XZ"]
    pub fn SkYUVAPixmaps_pixmapsInfo(this: *const SkYUVAPixmaps) -> SkYUVAPixmapInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?toYUVALocations@SkYUVAPixmaps@@QEBA?AV?$array@UYUVALocation@SkYUVAInfo@@$03@std@@XZ"]
    pub fn SkYUVAPixmaps_toYUVALocations(this: *const SkYUVAPixmaps) -> SkYUVAInfo_YUVALocations;
}
impl SkYUVAPixmaps {
    #[inline]
    pub unsafe fn RecommendedRGBAColorType(arg1: SkYUVAPixmaps_DataType) -> SkColorType {
        SkYUVAPixmaps_RecommendedRGBAColorType(arg1)
    }
    #[inline]
    pub unsafe fn Allocate(yuvaPixmapInfo: *const SkYUVAPixmapInfo) -> SkYUVAPixmaps {
        SkYUVAPixmaps_Allocate(yuvaPixmapInfo)
    }
    #[inline]
    pub unsafe fn FromData(arg1: *const SkYUVAPixmapInfo, arg2: sk_sp<SkData>) -> SkYUVAPixmaps {
        SkYUVAPixmaps_FromData(arg1, arg2)
    }
    #[inline]
    pub unsafe fn MakeCopy(src: *const SkYUVAPixmaps) -> SkYUVAPixmaps {
        SkYUVAPixmaps_MakeCopy(src)
    }
    #[inline]
    pub unsafe fn FromExternalMemory(
        arg1: *const SkYUVAPixmapInfo,
        memory: *mut ::core::ffi::c_void,
    ) -> SkYUVAPixmaps {
        SkYUVAPixmaps_FromExternalMemory(arg1, memory)
    }
    #[inline]
    pub unsafe fn FromExternalPixmaps(
        arg1: *const SkYUVAInfo,
        arg2: *const SkPixmap,
    ) -> SkYUVAPixmaps {
        SkYUVAPixmaps_FromExternalPixmaps(arg1, arg2)
    }
    #[inline]
    pub unsafe fn pixmapsInfo(&self) -> SkYUVAPixmapInfo {
        SkYUVAPixmaps_pixmapsInfo(self)
    }
    #[inline]
    pub unsafe fn toYUVALocations(&self) -> SkYUVAInfo_YUVALocations {
        SkYUVAPixmaps_toYUVALocations(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkOnce {
    pub fState: u8,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkOnce_State {
    NotStarted = 0,
    Claimed = 1,
    Done = 2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkOnce"][::core::mem::size_of::<SkOnce>() - 1usize];
    ["Alignment of SkOnce"][::core::mem::align_of::<SkOnce>() - 1usize];
    ["Offset of field: SkOnce::fState"][::core::mem::offset_of!(SkOnce, fState) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct skcms_Matrix3x3 {
    pub vals: [[f32; 3usize]; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skcms_Matrix3x3"][::core::mem::size_of::<skcms_Matrix3x3>() - 36usize];
    ["Alignment of skcms_Matrix3x3"][::core::mem::align_of::<skcms_Matrix3x3>() - 4usize];
    ["Offset of field: skcms_Matrix3x3::vals"]
        [::core::mem::offset_of!(skcms_Matrix3x3, vals) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct skcms_Matrix3x4 {
    pub vals: [[f32; 4usize]; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skcms_Matrix3x4"][::core::mem::size_of::<skcms_Matrix3x4>() - 48usize];
    ["Alignment of skcms_Matrix3x4"][::core::mem::align_of::<skcms_Matrix3x4>() - 4usize];
    ["Offset of field: skcms_Matrix3x4::vals"]
        [::core::mem::offset_of!(skcms_Matrix3x4, vals) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct skcms_TransferFunction {
    pub g: f32,
    pub a: f32,
    pub b: f32,
    pub c: f32,
    pub d: f32,
    pub e: f32,
    pub f: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skcms_TransferFunction"][::core::mem::size_of::<skcms_TransferFunction>() - 28usize];
    ["Alignment of skcms_TransferFunction"]
        [::core::mem::align_of::<skcms_TransferFunction>() - 4usize];
    ["Offset of field: skcms_TransferFunction::g"]
        [::core::mem::offset_of!(skcms_TransferFunction, g) - 0usize];
    ["Offset of field: skcms_TransferFunction::a"]
        [::core::mem::offset_of!(skcms_TransferFunction, a) - 4usize];
    ["Offset of field: skcms_TransferFunction::b"]
        [::core::mem::offset_of!(skcms_TransferFunction, b) - 8usize];
    ["Offset of field: skcms_TransferFunction::c"]
        [::core::mem::offset_of!(skcms_TransferFunction, c) - 12usize];
    ["Offset of field: skcms_TransferFunction::d"]
        [::core::mem::offset_of!(skcms_TransferFunction, d) - 16usize];
    ["Offset of field: skcms_TransferFunction::e"]
        [::core::mem::offset_of!(skcms_TransferFunction, e) - 20usize];
    ["Offset of field: skcms_TransferFunction::f"]
        [::core::mem::offset_of!(skcms_TransferFunction, f) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union skcms_Curve {
    pub __bindgen_anon_1: skcms_Curve__bindgen_ty_1,
    pub __bindgen_anon_2: skcms_Curve__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct skcms_Curve__bindgen_ty_1 {
    pub alias_of_table_entries: u32,
    pub parametric: skcms_TransferFunction,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skcms_Curve__bindgen_ty_1"]
        [::core::mem::size_of::<skcms_Curve__bindgen_ty_1>() - 32usize];
    ["Alignment of skcms_Curve__bindgen_ty_1"]
        [::core::mem::align_of::<skcms_Curve__bindgen_ty_1>() - 4usize];
    ["Offset of field: skcms_Curve__bindgen_ty_1::alias_of_table_entries"]
        [::core::mem::offset_of!(skcms_Curve__bindgen_ty_1, alias_of_table_entries) - 0usize];
    ["Offset of field: skcms_Curve__bindgen_ty_1::parametric"]
        [::core::mem::offset_of!(skcms_Curve__bindgen_ty_1, parametric) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct skcms_Curve__bindgen_ty_2 {
    pub table_entries: u32,
    pub table_8: *const u8,
    pub table_16: *const u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skcms_Curve__bindgen_ty_2"]
        [::core::mem::size_of::<skcms_Curve__bindgen_ty_2>() - 24usize];
    ["Alignment of skcms_Curve__bindgen_ty_2"]
        [::core::mem::align_of::<skcms_Curve__bindgen_ty_2>() - 8usize];
    ["Offset of field: skcms_Curve__bindgen_ty_2::table_entries"]
        [::core::mem::offset_of!(skcms_Curve__bindgen_ty_2, table_entries) - 0usize];
    ["Offset of field: skcms_Curve__bindgen_ty_2::table_8"]
        [::core::mem::offset_of!(skcms_Curve__bindgen_ty_2, table_8) - 8usize];
    ["Offset of field: skcms_Curve__bindgen_ty_2::table_16"]
        [::core::mem::offset_of!(skcms_Curve__bindgen_ty_2, table_16) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skcms_Curve"][::core::mem::size_of::<skcms_Curve>() - 32usize];
    ["Alignment of skcms_Curve"][::core::mem::align_of::<skcms_Curve>() - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct skcms_A2B {
    pub input_curves: [skcms_Curve; 4usize],
    pub grid_8: *const u8,
    pub grid_16: *const u8,
    pub input_channels: u32,
    pub grid_points: [u8; 4usize],
    pub matrix_curves: [skcms_Curve; 3usize],
    pub matrix: skcms_Matrix3x4,
    pub matrix_channels: u32,
    pub output_channels: u32,
    pub output_curves: [skcms_Curve; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skcms_A2B"][::core::mem::size_of::<skcms_A2B>() - 400usize];
    ["Alignment of skcms_A2B"][::core::mem::align_of::<skcms_A2B>() - 8usize];
    ["Offset of field: skcms_A2B::input_curves"]
        [::core::mem::offset_of!(skcms_A2B, input_curves) - 0usize];
    ["Offset of field: skcms_A2B::grid_8"][::core::mem::offset_of!(skcms_A2B, grid_8) - 128usize];
    ["Offset of field: skcms_A2B::grid_16"][::core::mem::offset_of!(skcms_A2B, grid_16) - 136usize];
    ["Offset of field: skcms_A2B::input_channels"]
        [::core::mem::offset_of!(skcms_A2B, input_channels) - 144usize];
    ["Offset of field: skcms_A2B::grid_points"]
        [::core::mem::offset_of!(skcms_A2B, grid_points) - 148usize];
    ["Offset of field: skcms_A2B::matrix_curves"]
        [::core::mem::offset_of!(skcms_A2B, matrix_curves) - 152usize];
    ["Offset of field: skcms_A2B::matrix"][::core::mem::offset_of!(skcms_A2B, matrix) - 248usize];
    ["Offset of field: skcms_A2B::matrix_channels"]
        [::core::mem::offset_of!(skcms_A2B, matrix_channels) - 296usize];
    ["Offset of field: skcms_A2B::output_channels"]
        [::core::mem::offset_of!(skcms_A2B, output_channels) - 300usize];
    ["Offset of field: skcms_A2B::output_curves"]
        [::core::mem::offset_of!(skcms_A2B, output_curves) - 304usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct skcms_B2A {
    pub input_curves: [skcms_Curve; 3usize],
    pub input_channels: u32,
    pub matrix_channels: u32,
    pub matrix_curves: [skcms_Curve; 3usize],
    pub matrix: skcms_Matrix3x4,
    pub output_curves: [skcms_Curve; 4usize],
    pub grid_8: *const u8,
    pub grid_16: *const u8,
    pub grid_points: [u8; 4usize],
    pub output_channels: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skcms_B2A"][::core::mem::size_of::<skcms_B2A>() - 400usize];
    ["Alignment of skcms_B2A"][::core::mem::align_of::<skcms_B2A>() - 8usize];
    ["Offset of field: skcms_B2A::input_curves"]
        [::core::mem::offset_of!(skcms_B2A, input_curves) - 0usize];
    ["Offset of field: skcms_B2A::input_channels"]
        [::core::mem::offset_of!(skcms_B2A, input_channels) - 96usize];
    ["Offset of field: skcms_B2A::matrix_channels"]
        [::core::mem::offset_of!(skcms_B2A, matrix_channels) - 100usize];
    ["Offset of field: skcms_B2A::matrix_curves"]
        [::core::mem::offset_of!(skcms_B2A, matrix_curves) - 104usize];
    ["Offset of field: skcms_B2A::matrix"][::core::mem::offset_of!(skcms_B2A, matrix) - 200usize];
    ["Offset of field: skcms_B2A::output_curves"]
        [::core::mem::offset_of!(skcms_B2A, output_curves) - 248usize];
    ["Offset of field: skcms_B2A::grid_8"][::core::mem::offset_of!(skcms_B2A, grid_8) - 376usize];
    ["Offset of field: skcms_B2A::grid_16"][::core::mem::offset_of!(skcms_B2A, grid_16) - 384usize];
    ["Offset of field: skcms_B2A::grid_points"]
        [::core::mem::offset_of!(skcms_B2A, grid_points) - 392usize];
    ["Offset of field: skcms_B2A::output_channels"]
        [::core::mem::offset_of!(skcms_B2A, output_channels) - 396usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct skcms_CICP {
    pub color_primaries: u8,
    pub transfer_characteristics: u8,
    pub matrix_coefficients: u8,
    pub video_full_range_flag: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skcms_CICP"][::core::mem::size_of::<skcms_CICP>() - 4usize];
    ["Alignment of skcms_CICP"][::core::mem::align_of::<skcms_CICP>() - 1usize];
    ["Offset of field: skcms_CICP::color_primaries"]
        [::core::mem::offset_of!(skcms_CICP, color_primaries) - 0usize];
    ["Offset of field: skcms_CICP::transfer_characteristics"]
        [::core::mem::offset_of!(skcms_CICP, transfer_characteristics) - 1usize];
    ["Offset of field: skcms_CICP::matrix_coefficients"]
        [::core::mem::offset_of!(skcms_CICP, matrix_coefficients) - 2usize];
    ["Offset of field: skcms_CICP::video_full_range_flag"]
        [::core::mem::offset_of!(skcms_CICP, video_full_range_flag) - 3usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct skcms_ICCProfile {
    pub buffer: *const u8,
    pub size: u32,
    pub data_color_space: u32,
    pub pcs: u32,
    pub tag_count: u32,
    pub trc: [skcms_Curve; 3usize],
    pub toXYZD50: skcms_Matrix3x3,
    pub A2B: skcms_A2B,
    pub B2A: skcms_B2A,
    pub CICP: skcms_CICP,
    pub has_trc: bool,
    pub has_toXYZD50: bool,
    pub has_A2B: bool,
    pub has_B2A: bool,
    pub has_CICP: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skcms_ICCProfile"][::core::mem::size_of::<skcms_ICCProfile>() - 976usize];
    ["Alignment of skcms_ICCProfile"][::core::mem::align_of::<skcms_ICCProfile>() - 8usize];
    ["Offset of field: skcms_ICCProfile::buffer"]
        [::core::mem::offset_of!(skcms_ICCProfile, buffer) - 0usize];
    ["Offset of field: skcms_ICCProfile::size"]
        [::core::mem::offset_of!(skcms_ICCProfile, size) - 8usize];
    ["Offset of field: skcms_ICCProfile::data_color_space"]
        [::core::mem::offset_of!(skcms_ICCProfile, data_color_space) - 12usize];
    ["Offset of field: skcms_ICCProfile::pcs"]
        [::core::mem::offset_of!(skcms_ICCProfile, pcs) - 16usize];
    ["Offset of field: skcms_ICCProfile::tag_count"]
        [::core::mem::offset_of!(skcms_ICCProfile, tag_count) - 20usize];
    ["Offset of field: skcms_ICCProfile::trc"]
        [::core::mem::offset_of!(skcms_ICCProfile, trc) - 24usize];
    ["Offset of field: skcms_ICCProfile::toXYZD50"]
        [::core::mem::offset_of!(skcms_ICCProfile, toXYZD50) - 120usize];
    ["Offset of field: skcms_ICCProfile::A2B"]
        [::core::mem::offset_of!(skcms_ICCProfile, A2B) - 160usize];
    ["Offset of field: skcms_ICCProfile::B2A"]
        [::core::mem::offset_of!(skcms_ICCProfile, B2A) - 560usize];
    ["Offset of field: skcms_ICCProfile::CICP"]
        [::core::mem::offset_of!(skcms_ICCProfile, CICP) - 960usize];
    ["Offset of field: skcms_ICCProfile::has_trc"]
        [::core::mem::offset_of!(skcms_ICCProfile, has_trc) - 964usize];
    ["Offset of field: skcms_ICCProfile::has_toXYZD50"]
        [::core::mem::offset_of!(skcms_ICCProfile, has_toXYZD50) - 965usize];
    ["Offset of field: skcms_ICCProfile::has_A2B"]
        [::core::mem::offset_of!(skcms_ICCProfile, has_A2B) - 966usize];
    ["Offset of field: skcms_ICCProfile::has_B2A"]
        [::core::mem::offset_of!(skcms_ICCProfile, has_B2A) - 967usize];
    ["Offset of field: skcms_ICCProfile::has_CICP"]
        [::core::mem::offset_of!(skcms_ICCProfile, has_CICP) - 968usize];
};
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum skcms_PixelFormat {
    skcms_PixelFormat_A_8 = 0,
    skcms_PixelFormat_A_8_ = 1,
    skcms_PixelFormat_G_8 = 2,
    skcms_PixelFormat_G_8_ = 3,
    skcms_PixelFormat_GA_88 = 4,
    skcms_PixelFormat_GA_88_ = 5,
    skcms_PixelFormat_RGB_565 = 6,
    skcms_PixelFormat_BGR_565 = 7,
    skcms_PixelFormat_ABGR_4444 = 8,
    skcms_PixelFormat_ARGB_4444 = 9,
    skcms_PixelFormat_RGB_888 = 10,
    skcms_PixelFormat_BGR_888 = 11,
    skcms_PixelFormat_RGBA_8888 = 12,
    skcms_PixelFormat_BGRA_8888 = 13,
    skcms_PixelFormat_RGBA_8888_sRGB = 14,
    skcms_PixelFormat_BGRA_8888_sRGB = 15,
    skcms_PixelFormat_RGBA_1010102 = 16,
    skcms_PixelFormat_BGRA_1010102 = 17,
    skcms_PixelFormat_RGB_161616LE = 18,
    skcms_PixelFormat_BGR_161616LE = 19,
    skcms_PixelFormat_RGBA_16161616LE = 20,
    skcms_PixelFormat_BGRA_16161616LE = 21,
    skcms_PixelFormat_RGB_161616BE = 22,
    skcms_PixelFormat_BGR_161616BE = 23,
    skcms_PixelFormat_RGBA_16161616BE = 24,
    skcms_PixelFormat_BGRA_16161616BE = 25,
    skcms_PixelFormat_RGB_hhh_Norm = 26,
    skcms_PixelFormat_BGR_hhh_Norm = 27,
    skcms_PixelFormat_RGBA_hhhh_Norm = 28,
    skcms_PixelFormat_BGRA_hhhh_Norm = 29,
    skcms_PixelFormat_RGB_hhh = 30,
    skcms_PixelFormat_BGR_hhh = 31,
    skcms_PixelFormat_RGBA_hhhh = 32,
    skcms_PixelFormat_BGRA_hhhh = 33,
    skcms_PixelFormat_RGB_fff = 34,
    skcms_PixelFormat_BGR_fff = 35,
    skcms_PixelFormat_RGBA_ffff = 36,
    skcms_PixelFormat_BGRA_ffff = 37,
    skcms_PixelFormat_RGB_101010x_XR = 38,
    skcms_PixelFormat_BGR_101010x_XR = 39,
    skcms_PixelFormat_RGBA_10101010_XR = 40,
    skcms_PixelFormat_BGRA_10101010_XR = 41,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum skcms_AlphaFormat {
    skcms_AlphaFormat_Opaque = 0,
    skcms_AlphaFormat_Unpremul = 1,
    skcms_AlphaFormat_PremulAsEncoded = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkColorSpacePrimaries {
    pub fRX: f32,
    pub fRY: f32,
    pub fGX: f32,
    pub fGY: f32,
    pub fBX: f32,
    pub fBY: f32,
    pub fWX: f32,
    pub fWY: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkColorSpacePrimaries"][::core::mem::size_of::<SkColorSpacePrimaries>() - 32usize];
    ["Alignment of SkColorSpacePrimaries"]
        [::core::mem::align_of::<SkColorSpacePrimaries>() - 4usize];
    ["Offset of field: SkColorSpacePrimaries::fRX"]
        [::core::mem::offset_of!(SkColorSpacePrimaries, fRX) - 0usize];
    ["Offset of field: SkColorSpacePrimaries::fRY"]
        [::core::mem::offset_of!(SkColorSpacePrimaries, fRY) - 4usize];
    ["Offset of field: SkColorSpacePrimaries::fGX"]
        [::core::mem::offset_of!(SkColorSpacePrimaries, fGX) - 8usize];
    ["Offset of field: SkColorSpacePrimaries::fGY"]
        [::core::mem::offset_of!(SkColorSpacePrimaries, fGY) - 12usize];
    ["Offset of field: SkColorSpacePrimaries::fBX"]
        [::core::mem::offset_of!(SkColorSpacePrimaries, fBX) - 16usize];
    ["Offset of field: SkColorSpacePrimaries::fBY"]
        [::core::mem::offset_of!(SkColorSpacePrimaries, fBY) - 20usize];
    ["Offset of field: SkColorSpacePrimaries::fWX"]
        [::core::mem::offset_of!(SkColorSpacePrimaries, fWX) - 24usize];
    ["Offset of field: SkColorSpacePrimaries::fWY"]
        [::core::mem::offset_of!(SkColorSpacePrimaries, fWY) - 28usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?toXYZD50@SkColorSpacePrimaries@@QEBA_NPEAUskcms_Matrix3x3@@@Z"]
    pub fn SkColorSpacePrimaries_toXYZD50(
        this: *const SkColorSpacePrimaries,
        toXYZD50: *mut skcms_Matrix3x3,
    ) -> bool;
}
impl SkColorSpacePrimaries {
    #[inline]
    pub unsafe fn toXYZD50(&self, toXYZD50: *mut skcms_Matrix3x3) -> bool {
        SkColorSpacePrimaries_toXYZD50(self, toXYZD50)
    }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkNamedPrimaries_CicpId {
    Rec709 = 1,
    Rec470SystemM = 4,
    Rec470SystemBG = 5,
    Rec601 = 6,
    SMPTE_ST_240 = 7,
    GenericFilm = 8,
    Rec2020 = 9,
    SMPTE_ST_428_1 = 10,
    SMPTE_RP_431_2 = 11,
    SMPTE_EG_432_1 = 12,
    ITU_T_H273_Value22 = 22,
}
impl SkNamedTransferFn_CicpId {
    pub const SRGB: SkNamedTransferFn_CicpId = SkNamedTransferFn_CicpId::IEC61966_2_1;
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkNamedTransferFn_CicpId {
    Rec709 = 1,
    Rec470SystemM = 4,
    Rec470SystemBG = 5,
    Rec601 = 6,
    SMPTE_ST_240 = 7,
    Linear = 8,
    IEC61966_2_4 = 11,
    IEC61966_2_1 = 13,
    Rec2020_10bit = 14,
    Rec2020_12bit = 15,
    PQ = 16,
    SMPTE_ST_428_1 = 17,
    HLG = 18,
}
#[repr(C)]
#[derive(Debug)]
pub struct SkColorSpace {
    pub _base: SkNVRefCnt,
    pub fTransferFnHash: u32,
    pub fToXYZD50Hash: u32,
    pub fTransferFn: skcms_TransferFunction,
    pub fToXYZD50: skcms_Matrix3x3,
    pub fInvTransferFn: skcms_TransferFunction,
    pub fFromXYZD50: skcms_Matrix3x3,
    pub fLazyDstFieldsOnce: SkOnce,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkColorSpace"][::core::mem::size_of::<SkColorSpace>() - 144usize];
    ["Alignment of SkColorSpace"][::core::mem::align_of::<SkColorSpace>() - 4usize];
    ["Offset of field: SkColorSpace::fTransferFnHash"]
        [::core::mem::offset_of!(SkColorSpace, fTransferFnHash) - 4usize];
    ["Offset of field: SkColorSpace::fToXYZD50Hash"]
        [::core::mem::offset_of!(SkColorSpace, fToXYZD50Hash) - 8usize];
    ["Offset of field: SkColorSpace::fTransferFn"]
        [::core::mem::offset_of!(SkColorSpace, fTransferFn) - 12usize];
    ["Offset of field: SkColorSpace::fToXYZD50"]
        [::core::mem::offset_of!(SkColorSpace, fToXYZD50) - 40usize];
    ["Offset of field: SkColorSpace::fInvTransferFn"]
        [::core::mem::offset_of!(SkColorSpace, fInvTransferFn) - 76usize];
    ["Offset of field: SkColorSpace::fFromXYZD50"]
        [::core::mem::offset_of!(SkColorSpace, fFromXYZD50) - 104usize];
    ["Offset of field: SkColorSpace::fLazyDstFieldsOnce"]
        [::core::mem::offset_of!(SkColorSpace, fLazyDstFieldsOnce) - 140usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?MakeSRGB@SkColorSpace@@SA?AV?$sk_sp@VSkColorSpace@@@@XZ"]
    pub fn SkColorSpace_MakeSRGB() -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeSRGBLinear@SkColorSpace@@SA?AV?$sk_sp@VSkColorSpace@@@@XZ"]
    pub fn SkColorSpace_MakeSRGBLinear() -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeRGB@SkColorSpace@@SA?AV?$sk_sp@VSkColorSpace@@@@AEBUskcms_TransferFunction@@AEBUskcms_Matrix3x3@@@Z"]
    pub fn SkColorSpace_MakeRGB(
        transferFn: *const skcms_TransferFunction,
        toXYZ: *const skcms_Matrix3x3,
    ) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeCICP@SkColorSpace@@SA?AV?$sk_sp@VSkColorSpace@@@@W4CicpId@SkNamedPrimaries@@W43SkNamedTransferFn@@@Z"]
    pub fn SkColorSpace_MakeCICP(
        color_primaries: SkNamedPrimaries_CicpId,
        transfer_characteristics: SkNamedTransferFn_CicpId,
    ) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Make@SkColorSpace@@SA?AV?$sk_sp@VSkColorSpace@@@@AEBUskcms_ICCProfile@@@Z"]
    pub fn SkColorSpace_Make(arg1: *const skcms_ICCProfile) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?toProfile@SkColorSpace@@QEBAXPEAUskcms_ICCProfile@@@Z"]
    pub fn SkColorSpace_toProfile(this: *const SkColorSpace, arg1: *mut skcms_ICCProfile);
}
unsafe extern "C" {
    #[link_name = "\u{1}?gammaCloseToSRGB@SkColorSpace@@QEBA_NXZ"]
    pub fn SkColorSpace_gammaCloseToSRGB(this: *const SkColorSpace) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?gammaIsLinear@SkColorSpace@@QEBA_NXZ"]
    pub fn SkColorSpace_gammaIsLinear(this: *const SkColorSpace) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?isNumericalTransferFn@SkColorSpace@@QEBA_NPEAUskcms_TransferFunction@@@Z"]
    pub fn SkColorSpace_isNumericalTransferFn(
        this: *const SkColorSpace,
        fn_: *mut skcms_TransferFunction,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?toXYZD50@SkColorSpace@@QEBA_NPEAUskcms_Matrix3x3@@@Z"]
    pub fn SkColorSpace_toXYZD50(this: *const SkColorSpace, toXYZD50: *mut skcms_Matrix3x3)
    -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeLinearGamma@SkColorSpace@@QEBA?AV?$sk_sp@VSkColorSpace@@@@XZ"]
    pub fn SkColorSpace_makeLinearGamma(this: *const SkColorSpace) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeSRGBGamma@SkColorSpace@@QEBA?AV?$sk_sp@VSkColorSpace@@@@XZ"]
    pub fn SkColorSpace_makeSRGBGamma(this: *const SkColorSpace) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeColorSpin@SkColorSpace@@QEBA?AV?$sk_sp@VSkColorSpace@@@@XZ"]
    pub fn SkColorSpace_makeColorSpin(this: *const SkColorSpace) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?isSRGB@SkColorSpace@@QEBA_NXZ"]
    pub fn SkColorSpace_isSRGB(this: *const SkColorSpace) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?serialize@SkColorSpace@@QEBA?AV?$sk_sp@VSkData@@@@XZ"]
    pub fn SkColorSpace_serialize(this: *const SkColorSpace) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?writeToMemory@SkColorSpace@@QEBA_KPEAX@Z"]
    pub fn SkColorSpace_writeToMemory(
        this: *const SkColorSpace,
        memory: *mut ::core::ffi::c_void,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Deserialize@SkColorSpace@@SA?AV?$sk_sp@VSkColorSpace@@@@PEBX_K@Z"]
    pub fn SkColorSpace_Deserialize(
        data: *const ::core::ffi::c_void,
        length: usize,
    ) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Equals@SkColorSpace@@SA_NPEBV1@0@Z"]
    pub fn SkColorSpace_Equals(arg1: *const SkColorSpace, arg2: *const SkColorSpace) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?transferFn@SkColorSpace@@QEBAXQEAM@Z"]
    pub fn SkColorSpace_transferFn(this: *const SkColorSpace, gabcdef: *mut f32);
}
unsafe extern "C" {
    #[link_name = "\u{1}?transferFn@SkColorSpace@@QEBAXPEAUskcms_TransferFunction@@@Z"]
    pub fn SkColorSpace_transferFn1(this: *const SkColorSpace, fn_: *mut skcms_TransferFunction);
}
unsafe extern "C" {
    #[link_name = "\u{1}?invTransferFn@SkColorSpace@@QEBAXPEAUskcms_TransferFunction@@@Z"]
    pub fn SkColorSpace_invTransferFn(this: *const SkColorSpace, fn_: *mut skcms_TransferFunction);
}
unsafe extern "C" {
    #[link_name = "\u{1}?gamutTransformTo@SkColorSpace@@QEBAXPEBV1@PEAUskcms_Matrix3x3@@@Z"]
    pub fn SkColorSpace_gamutTransformTo(
        this: *const SkColorSpace,
        dst: *const SkColorSpace,
        src_to_dst: *mut skcms_Matrix3x3,
    );
}
impl SkColorSpace {
    #[inline]
    pub unsafe fn MakeSRGB() -> sk_sp<SkColorSpace> {
        SkColorSpace_MakeSRGB()
    }
    #[inline]
    pub unsafe fn MakeSRGBLinear() -> sk_sp<SkColorSpace> {
        SkColorSpace_MakeSRGBLinear()
    }
    #[inline]
    pub unsafe fn MakeRGB(
        transferFn: *const skcms_TransferFunction,
        toXYZ: *const skcms_Matrix3x3,
    ) -> sk_sp<SkColorSpace> {
        SkColorSpace_MakeRGB(transferFn, toXYZ)
    }
    #[inline]
    pub unsafe fn MakeCICP(
        color_primaries: SkNamedPrimaries_CicpId,
        transfer_characteristics: SkNamedTransferFn_CicpId,
    ) -> sk_sp<SkColorSpace> {
        SkColorSpace_MakeCICP(color_primaries, transfer_characteristics)
    }
    #[inline]
    pub unsafe fn Make(arg1: *const skcms_ICCProfile) -> sk_sp<SkColorSpace> {
        SkColorSpace_Make(arg1)
    }
    #[inline]
    pub unsafe fn toProfile(&self, arg1: *mut skcms_ICCProfile) {
        SkColorSpace_toProfile(self, arg1)
    }
    #[inline]
    pub unsafe fn gammaCloseToSRGB(&self) -> bool {
        SkColorSpace_gammaCloseToSRGB(self)
    }
    #[inline]
    pub unsafe fn gammaIsLinear(&self) -> bool {
        SkColorSpace_gammaIsLinear(self)
    }
    #[inline]
    pub unsafe fn isNumericalTransferFn(&self, fn_: *mut skcms_TransferFunction) -> bool {
        SkColorSpace_isNumericalTransferFn(self, fn_)
    }
    #[inline]
    pub unsafe fn toXYZD50(&self, toXYZD50: *mut skcms_Matrix3x3) -> bool {
        SkColorSpace_toXYZD50(self, toXYZD50)
    }
    #[inline]
    pub unsafe fn makeLinearGamma(&self) -> sk_sp<SkColorSpace> {
        SkColorSpace_makeLinearGamma(self)
    }
    #[inline]
    pub unsafe fn makeSRGBGamma(&self) -> sk_sp<SkColorSpace> {
        SkColorSpace_makeSRGBGamma(self)
    }
    #[inline]
    pub unsafe fn makeColorSpin(&self) -> sk_sp<SkColorSpace> {
        SkColorSpace_makeColorSpin(self)
    }
    #[inline]
    pub unsafe fn isSRGB(&self) -> bool {
        SkColorSpace_isSRGB(self)
    }
    #[inline]
    pub unsafe fn serialize(&self) -> sk_sp<SkData> {
        SkColorSpace_serialize(self)
    }
    #[inline]
    pub unsafe fn writeToMemory(&self, memory: *mut ::core::ffi::c_void) -> usize {
        SkColorSpace_writeToMemory(self, memory)
    }
    #[inline]
    pub unsafe fn Deserialize(
        data: *const ::core::ffi::c_void,
        length: usize,
    ) -> sk_sp<SkColorSpace> {
        SkColorSpace_Deserialize(data, length)
    }
    #[inline]
    pub unsafe fn Equals(arg1: *const SkColorSpace, arg2: *const SkColorSpace) -> bool {
        SkColorSpace_Equals(arg1, arg2)
    }
    #[inline]
    pub unsafe fn transferFn(&self, gabcdef: *mut f32) {
        SkColorSpace_transferFn(self, gabcdef)
    }
    #[inline]
    pub unsafe fn transferFn1(&self, fn_: *mut skcms_TransferFunction) {
        SkColorSpace_transferFn1(self, fn_)
    }
    #[inline]
    pub unsafe fn invTransferFn(&self, fn_: *mut skcms_TransferFunction) {
        SkColorSpace_invTransferFn(self, fn_)
    }
    #[inline]
    pub unsafe fn gamutTransformTo(
        &self,
        dst: *const SkColorSpace,
        src_to_dst: *mut skcms_Matrix3x3,
    ) {
        SkColorSpace_gamutTransformTo(self, dst, src_to_dst)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct skhdr_ContentLightLevelInformation {
    pub fMaxCLL: f32,
    pub fMaxFALL: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skhdr_ContentLightLevelInformation"]
        [::core::mem::size_of::<skhdr_ContentLightLevelInformation>() - 8usize];
    ["Alignment of skhdr_ContentLightLevelInformation"]
        [::core::mem::align_of::<skhdr_ContentLightLevelInformation>() - 4usize];
    ["Offset of field: skhdr_ContentLightLevelInformation::fMaxCLL"]
        [::core::mem::offset_of!(skhdr_ContentLightLevelInformation, fMaxCLL) - 0usize];
    ["Offset of field: skhdr_ContentLightLevelInformation::fMaxFALL"]
        [::core::mem::offset_of!(skhdr_ContentLightLevelInformation, fMaxFALL) - 4usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?parse@ContentLightLevelInformation@skhdr@@QEAA_NPEBVSkData@@@Z"]
    pub fn skhdr_ContentLightLevelInformation_parse(
        this: *mut skhdr_ContentLightLevelInformation,
        data: *const SkData,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?serialize@ContentLightLevelInformation@skhdr@@QEBA?AV?$sk_sp@VSkData@@@@XZ"]
    pub fn skhdr_ContentLightLevelInformation_serialize(
        this: *const skhdr_ContentLightLevelInformation,
    ) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?parsePngChunk@ContentLightLevelInformation@skhdr@@QEAA_NPEBVSkData@@@Z"]
    pub fn skhdr_ContentLightLevelInformation_parsePngChunk(
        this: *mut skhdr_ContentLightLevelInformation,
        data: *const SkData,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?serializePngChunk@ContentLightLevelInformation@skhdr@@QEBA?AV?$sk_sp@VSkData@@@@XZ"]
    pub fn skhdr_ContentLightLevelInformation_serializePngChunk(
        this: *const skhdr_ContentLightLevelInformation,
    ) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?toString@ContentLightLevelInformation@skhdr@@QEBA?AVSkString@@XZ"]
    pub fn skhdr_ContentLightLevelInformation_toString(
        this: *const skhdr_ContentLightLevelInformation,
    ) -> SkString;
}
impl skhdr_ContentLightLevelInformation {
    #[inline]
    pub unsafe fn parse(&mut self, data: *const SkData) -> bool {
        skhdr_ContentLightLevelInformation_parse(self, data)
    }
    #[inline]
    pub unsafe fn serialize(&self) -> sk_sp<SkData> {
        skhdr_ContentLightLevelInformation_serialize(self)
    }
    #[inline]
    pub unsafe fn parsePngChunk(&mut self, data: *const SkData) -> bool {
        skhdr_ContentLightLevelInformation_parsePngChunk(self, data)
    }
    #[inline]
    pub unsafe fn serializePngChunk(&self) -> sk_sp<SkData> {
        skhdr_ContentLightLevelInformation_serializePngChunk(self)
    }
    #[inline]
    pub unsafe fn toString(&self) -> SkString {
        skhdr_ContentLightLevelInformation_toString(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct skhdr_MasteringDisplayColorVolume {
    pub fDisplayPrimaries: SkColorSpacePrimaries,
    pub fMaximumDisplayMasteringLuminance: f32,
    pub fMinimumDisplayMasteringLuminance: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skhdr_MasteringDisplayColorVolume"]
        [::core::mem::size_of::<skhdr_MasteringDisplayColorVolume>() - 40usize];
    ["Alignment of skhdr_MasteringDisplayColorVolume"]
        [::core::mem::align_of::<skhdr_MasteringDisplayColorVolume>() - 4usize];
    ["Offset of field: skhdr_MasteringDisplayColorVolume::fDisplayPrimaries"]
        [::core::mem::offset_of!(skhdr_MasteringDisplayColorVolume, fDisplayPrimaries) - 0usize];
    ["Offset of field: skhdr_MasteringDisplayColorVolume::fMaximumDisplayMasteringLuminance"][::core::mem::offset_of!(
        skhdr_MasteringDisplayColorVolume,
        fMaximumDisplayMasteringLuminance
    )
        - 32usize];
    ["Offset of field: skhdr_MasteringDisplayColorVolume::fMinimumDisplayMasteringLuminance"][::core::mem::offset_of!(
        skhdr_MasteringDisplayColorVolume,
        fMinimumDisplayMasteringLuminance
    )
        - 36usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?parse@MasteringDisplayColorVolume@skhdr@@QEAA_NPEBVSkData@@@Z"]
    pub fn skhdr_MasteringDisplayColorVolume_parse(
        this: *mut skhdr_MasteringDisplayColorVolume,
        data: *const SkData,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?serialize@MasteringDisplayColorVolume@skhdr@@QEBA?AV?$sk_sp@VSkData@@@@XZ"]
    pub fn skhdr_MasteringDisplayColorVolume_serialize(
        this: *const skhdr_MasteringDisplayColorVolume,
    ) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?toString@MasteringDisplayColorVolume@skhdr@@QEBA?AVSkString@@XZ"]
    pub fn skhdr_MasteringDisplayColorVolume_toString(
        this: *const skhdr_MasteringDisplayColorVolume,
    ) -> SkString;
}
impl skhdr_MasteringDisplayColorVolume {
    #[inline]
    pub unsafe fn parse(&mut self, data: *const SkData) -> bool {
        skhdr_MasteringDisplayColorVolume_parse(self, data)
    }
    #[inline]
    pub unsafe fn serialize(&self) -> sk_sp<SkData> {
        skhdr_MasteringDisplayColorVolume_serialize(self)
    }
    #[inline]
    pub unsafe fn toString(&self) -> SkString {
        skhdr_MasteringDisplayColorVolume_toString(self)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct skhdr_Metadata {
    pub fContentLightLevelInformation: __BindgenOpaqueArray<u32, 3usize>,
    pub fMasteringDisplayColorVolume: __BindgenOpaqueArray<u32, 11usize>,
    pub fAgtm: sk_sp<SkData>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of skhdr_Metadata"][::core::mem::size_of::<skhdr_Metadata>() - 64usize];
    ["Alignment of skhdr_Metadata"][::core::mem::align_of::<skhdr_Metadata>() - 8usize];
    ["Offset of field: skhdr_Metadata::fContentLightLevelInformation"]
        [::core::mem::offset_of!(skhdr_Metadata, fContentLightLevelInformation) - 0usize];
    ["Offset of field: skhdr_Metadata::fMasteringDisplayColorVolume"]
        [::core::mem::offset_of!(skhdr_Metadata, fMasteringDisplayColorVolume) - 12usize];
    ["Offset of field: skhdr_Metadata::fAgtm"]
        [::core::mem::offset_of!(skhdr_Metadata, fAgtm) - 56usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?MakeEmpty@Metadata@skhdr@@SA?AV12@XZ"]
    pub fn skhdr_Metadata_MakeEmpty() -> skhdr_Metadata;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getContentLightLevelInformation@Metadata@skhdr@@QEBA_NPEAUContentLightLevelInformation@2@@Z"]
    pub fn skhdr_Metadata_getContentLightLevelInformation(
        this: *const skhdr_Metadata,
        clli: *mut skhdr_ContentLightLevelInformation,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setContentLightLevelInformation@Metadata@skhdr@@QEAAXAEBUContentLightLevelInformation@2@@Z"]
    pub fn skhdr_Metadata_setContentLightLevelInformation(
        this: *mut skhdr_Metadata,
        clli: *const skhdr_ContentLightLevelInformation,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?getMasteringDisplayColorVolume@Metadata@skhdr@@QEBA_NPEAUMasteringDisplayColorVolume@2@@Z"]
    pub fn skhdr_Metadata_getMasteringDisplayColorVolume(
        this: *const skhdr_Metadata,
        mdcv: *mut skhdr_MasteringDisplayColorVolume,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setMasteringDisplayColorVolume@Metadata@skhdr@@QEAAXAEBUMasteringDisplayColorVolume@2@@Z"]
    pub fn skhdr_Metadata_setMasteringDisplayColorVolume(
        this: *mut skhdr_Metadata,
        mdcv: *const skhdr_MasteringDisplayColorVolume,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?getSerializedAgtm@Metadata@skhdr@@QEBA?AV?$sk_sp@$$CBVSkData@@@@XZ"]
    pub fn skhdr_Metadata_getSerializedAgtm(this: *const skhdr_Metadata) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setSerializedAgtm@Metadata@skhdr@@QEAAXV?$sk_sp@$$CBVSkData@@@@@Z"]
    pub fn skhdr_Metadata_setSerializedAgtm(this: *mut skhdr_Metadata, arg1: sk_sp<SkData>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?toString@Metadata@skhdr@@QEBA?AVSkString@@XZ"]
    pub fn skhdr_Metadata_toString(this: *const skhdr_Metadata) -> SkString;
}
impl skhdr_Metadata {
    #[inline]
    pub unsafe fn MakeEmpty() -> skhdr_Metadata {
        skhdr_Metadata_MakeEmpty()
    }
    #[inline]
    pub unsafe fn getContentLightLevelInformation(
        &self,
        clli: *mut skhdr_ContentLightLevelInformation,
    ) -> bool {
        skhdr_Metadata_getContentLightLevelInformation(self, clli)
    }
    #[inline]
    pub unsafe fn setContentLightLevelInformation(
        &mut self,
        clli: *const skhdr_ContentLightLevelInformation,
    ) {
        skhdr_Metadata_setContentLightLevelInformation(self, clli)
    }
    #[inline]
    pub unsafe fn getMasteringDisplayColorVolume(
        &self,
        mdcv: *mut skhdr_MasteringDisplayColorVolume,
    ) -> bool {
        skhdr_Metadata_getMasteringDisplayColorVolume(self, mdcv)
    }
    #[inline]
    pub unsafe fn setMasteringDisplayColorVolume(
        &mut self,
        mdcv: *const skhdr_MasteringDisplayColorVolume,
    ) {
        skhdr_Metadata_setMasteringDisplayColorVolume(self, mdcv)
    }
    #[inline]
    pub unsafe fn getSerializedAgtm(&self) -> sk_sp<SkData> {
        skhdr_Metadata_getSerializedAgtm(self)
    }
    #[inline]
    pub unsafe fn setSerializedAgtm(&mut self, arg1: sk_sp<SkData>) {
        skhdr_Metadata_setSerializedAgtm(self, arg1)
    }
    #[inline]
    pub unsafe fn toString(&self) -> SkString {
        skhdr_Metadata_toString(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkCodecs_ColorProfile {
    _unused: [u8; 0],
}
pub type SkCodecs_DecodeContext = *mut ::core::ffi::c_void;
pub type SkCodecs_IsFormatCallback = ::core::option::Option<
    unsafe extern "C" fn(data: *const ::core::ffi::c_void, len: usize) -> bool,
>;
pub type SkCodecs_MakeFromStreamCallback = ::core::option::Option<
    unsafe extern "C" fn(arg1: u64, arg2: *mut SkCodec_Result, arg3: SkCodecs_DecodeContext) -> u64,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkCodecs_Decoder {
    pub id: std_string_view,
    pub isFormat: SkCodecs_IsFormatCallback,
    pub makeFromStream: SkCodecs_MakeFromStreamCallback,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCodecs_Decoder"][::core::mem::size_of::<SkCodecs_Decoder>() - 32usize];
    ["Alignment of SkCodecs_Decoder"][::core::mem::align_of::<SkCodecs_Decoder>() - 8usize];
    ["Offset of field: SkCodecs_Decoder::id"]
        [::core::mem::offset_of!(SkCodecs_Decoder, id) - 0usize];
    ["Offset of field: SkCodecs_Decoder::isFormat"]
        [::core::mem::offset_of!(SkCodecs_Decoder, isFormat) - 16usize];
    ["Offset of field: SkCodecs_Decoder::makeFromStream"]
        [::core::mem::offset_of!(SkCodecs_Decoder, makeFromStream) - 24usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct SkEncodedInfo {
    pub fWidth: ::core::ffi::c_int,
    pub fHeight: ::core::ffi::c_int,
    pub fColor: SkEncodedInfo_Color,
    pub fAlpha: SkEncodedInfo_Alpha,
    pub fBitsPerComponent: u8,
    pub fColorDepth: u8,
    pub fColorProfile: u64,
    pub fHdrMetadata: skhdr_Metadata,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkEncodedInfo_Alpha {
    kOpaque_Alpha = 0,
    kUnpremul_Alpha = 1,
    kBinary_Alpha = 2,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkEncodedInfo_Color {
    kGray_Color = 0,
    kGrayAlpha_Color = 1,
    kXAlpha_Color = 2,
    k565_Color = 3,
    kPalette_Color = 4,
    kRGB_Color = 5,
    kRGBA_Color = 6,
    kBGR_Color = 7,
    kBGRX_Color = 8,
    kBGRA_Color = 9,
    kYUV_Color = 10,
    kYUVA_Color = 11,
    kInvertedCMYK_Color = 12,
    kYCCK_Color = 13,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkEncodedInfo"][::core::mem::size_of::<SkEncodedInfo>() - 96usize];
    ["Alignment of SkEncodedInfo"][::core::mem::align_of::<SkEncodedInfo>() - 8usize];
    ["Offset of field: SkEncodedInfo::fWidth"]
        [::core::mem::offset_of!(SkEncodedInfo, fWidth) - 0usize];
    ["Offset of field: SkEncodedInfo::fHeight"]
        [::core::mem::offset_of!(SkEncodedInfo, fHeight) - 4usize];
    ["Offset of field: SkEncodedInfo::fColor"]
        [::core::mem::offset_of!(SkEncodedInfo, fColor) - 8usize];
    ["Offset of field: SkEncodedInfo::fAlpha"]
        [::core::mem::offset_of!(SkEncodedInfo, fAlpha) - 12usize];
    ["Offset of field: SkEncodedInfo::fBitsPerComponent"]
        [::core::mem::offset_of!(SkEncodedInfo, fBitsPerComponent) - 16usize];
    ["Offset of field: SkEncodedInfo::fColorDepth"]
        [::core::mem::offset_of!(SkEncodedInfo, fColorDepth) - 17usize];
    ["Offset of field: SkEncodedInfo::fColorProfile"]
        [::core::mem::offset_of!(SkEncodedInfo, fColorProfile) - 24usize];
    ["Offset of field: SkEncodedInfo::fHdrMetadata"]
        [::core::mem::offset_of!(SkEncodedInfo, fHdrMetadata) - 32usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?Make@SkEncodedInfo@@SA?AU1@HHW4Color@1@W4Alpha@1@H@Z"]
    pub fn SkEncodedInfo_Make(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: SkEncodedInfo_Color,
        alpha: SkEncodedInfo_Alpha,
        bitsPerComponent: ::core::ffi::c_int,
    ) -> SkEncodedInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Make@SkEncodedInfo@@SA?AU1@HHW4Color@1@W4Alpha@1@HV?$unique_ptr@VColorProfile@SkCodecs@@U?$default_delete@VColorProfile@SkCodecs@@@std@@@std@@@Z"]
    pub fn SkEncodedInfo_Make1(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: SkEncodedInfo_Color,
        alpha: SkEncodedInfo_Alpha,
        bitsPerComponent: ::core::ffi::c_int,
        profile: u8,
    ) -> SkEncodedInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Make@SkEncodedInfo@@SA?AU1@HHW4Color@1@W4Alpha@1@HV?$unique_ptr@VColorProfile@SkCodecs@@U?$default_delete@VColorProfile@SkCodecs@@@std@@@std@@H@Z"]
    pub fn SkEncodedInfo_Make2(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: SkEncodedInfo_Color,
        alpha: SkEncodedInfo_Alpha,
        bitsPerComponent: ::core::ffi::c_int,
        profile: u8,
        colorDepth: ::core::ffi::c_int,
    ) -> SkEncodedInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Make@SkEncodedInfo@@SA?AU1@HHW4Color@1@W4Alpha@1@HHV?$unique_ptr@VColorProfile@SkCodecs@@U?$default_delete@VColorProfile@SkCodecs@@@std@@@std@@AEBVMetadata@skhdr@@@Z"]
    pub fn SkEncodedInfo_Make3(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: SkEncodedInfo_Color,
        alpha: SkEncodedInfo_Alpha,
        bitsPerComponent: ::core::ffi::c_int,
        colorDepth: ::core::ffi::c_int,
        profile: u8,
        hdrMetadata: *const skhdr_Metadata,
    ) -> SkEncodedInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeImageInfo@SkEncodedInfo@@QEBA?AUSkImageInfo@@XZ"]
    pub fn SkEncodedInfo_makeImageInfo(this: *const SkEncodedInfo) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?profile@SkEncodedInfo@@QEBAPEBUskcms_ICCProfile@@XZ"]
    pub fn SkEncodedInfo_profile(this: *const SkEncodedInfo) -> *const skcms_ICCProfile;
}
unsafe extern "C" {
    #[link_name = "\u{1}?profileData@SkEncodedInfo@@QEBA?AV?$sk_sp@$$CBVSkData@@@@XZ"]
    pub fn SkEncodedInfo_profileData(this: *const SkEncodedInfo) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?copy@SkEncodedInfo@@QEBA?AU1@XZ"]
    pub fn SkEncodedInfo_copy(this: *const SkEncodedInfo) -> SkEncodedInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkEncodedInfo@@QEAA@$$QEAU0@@Z"]
    pub fn SkEncodedInfo_SkEncodedInfo(this: *mut SkEncodedInfo, orig: *mut SkEncodedInfo);
}
impl SkEncodedInfo {
    #[inline]
    pub unsafe fn Make(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: SkEncodedInfo_Color,
        alpha: SkEncodedInfo_Alpha,
        bitsPerComponent: ::core::ffi::c_int,
    ) -> SkEncodedInfo {
        SkEncodedInfo_Make(width, height, color, alpha, bitsPerComponent)
    }
    #[inline]
    pub unsafe fn Make1(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: SkEncodedInfo_Color,
        alpha: SkEncodedInfo_Alpha,
        bitsPerComponent: ::core::ffi::c_int,
        profile: u8,
    ) -> SkEncodedInfo {
        SkEncodedInfo_Make1(width, height, color, alpha, bitsPerComponent, profile)
    }
    #[inline]
    pub unsafe fn Make2(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: SkEncodedInfo_Color,
        alpha: SkEncodedInfo_Alpha,
        bitsPerComponent: ::core::ffi::c_int,
        profile: u8,
        colorDepth: ::core::ffi::c_int,
    ) -> SkEncodedInfo {
        SkEncodedInfo_Make2(
            width,
            height,
            color,
            alpha,
            bitsPerComponent,
            profile,
            colorDepth,
        )
    }
    #[inline]
    pub unsafe fn Make3(
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        color: SkEncodedInfo_Color,
        alpha: SkEncodedInfo_Alpha,
        bitsPerComponent: ::core::ffi::c_int,
        colorDepth: ::core::ffi::c_int,
        profile: u8,
        hdrMetadata: *const skhdr_Metadata,
    ) -> SkEncodedInfo {
        SkEncodedInfo_Make3(
            width,
            height,
            color,
            alpha,
            bitsPerComponent,
            colorDepth,
            profile,
            hdrMetadata,
        )
    }
    #[inline]
    pub unsafe fn makeImageInfo(&self) -> SkImageInfo {
        SkEncodedInfo_makeImageInfo(self)
    }
    #[inline]
    pub unsafe fn profile(&self) -> *const skcms_ICCProfile {
        SkEncodedInfo_profile(self)
    }
    #[inline]
    pub unsafe fn profileData(&self) -> sk_sp<SkData> {
        SkEncodedInfo_profileData(self)
    }
    #[inline]
    pub unsafe fn copy(&self) -> SkEncodedInfo {
        SkEncodedInfo_copy(self)
    }
    #[inline]
    pub unsafe fn new(orig: *mut SkEncodedInfo) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkEncodedInfo_SkEncodedInfo(__bindgen_tmp.as_mut_ptr(), orig);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkNoncopyable {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkNoncopyable"][::core::mem::size_of::<SkNoncopyable>() - 1usize];
    ["Alignment of SkNoncopyable"][::core::mem::align_of::<SkNoncopyable>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkPngChunkReader {
    _unused: [u8; 0],
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCodecAnimation_DisposalMethod {
    Keep = 1,
    RestoreBGColor = 2,
    RestorePrevious = 3,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCodecAnimation_Blend {
    SrcOver = 0,
    Src = 1,
}
#[repr(C)]
pub struct SkCodec__bindgen_vtable(::core::ffi::c_void);
#[repr(C)]
pub struct SkCodec {
    pub vtable_: *const SkCodec__bindgen_vtable,
    pub fEncodedInfo: SkEncodedInfo,
    pub fSrcXformFormat: SkCodec_XformFormat,
    pub fStream: u64,
    pub fNeedsRewind: bool,
    pub fOrigin: SkEncodedOrigin,
    pub fDstInfo: SkImageInfo,
    pub fOptions: SkCodec_Options,
    pub fXformTime: SkCodec_XformTime,
    pub fDstXformFormat: SkCodec_XformFormat,
    pub fDstProfileStorage: skcms_ICCProfile,
    pub fDstProfile: *const skcms_ICCProfile,
    pub fDstXformAlphaFormat: skcms_AlphaFormat,
    pub fCurrScanline: ::core::ffi::c_int,
    pub fDecodeBudget: usize,
    pub fStartedIncrementalDecode: bool,
    pub fUsingCallbackForHandleFrameIndex: bool,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCodec_Result {
    Success = 0,
    IncompleteInput = 1,
    ErrorInInput = 2,
    InvalidConversion = 3,
    InvalidScale = 4,
    InvalidParameters = 5,
    InvalidInput = 6,
    CouldNotRewind = 7,
    InternalError = 8,
    Unimplemented = 9,
    OutOfMemory = 10,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCodec_SelectionPolicy {
    PreferStillImage = 0,
    PreferAnimation = 1,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCodec_ZeroInitialized {
    Yes = 0,
    No = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkCodec_Options {
    pub fZeroInitialized: SkCodec_ZeroInitialized,
    pub fSubset: *const SkIRect,
    pub fFrameIndex: ::core::ffi::c_int,
    pub fPriorFrame: ::core::ffi::c_int,
    pub fMaxDecodeMemory: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCodec_Options"][::core::mem::size_of::<SkCodec_Options>() - 32usize];
    ["Alignment of SkCodec_Options"][::core::mem::align_of::<SkCodec_Options>() - 8usize];
    ["Offset of field: SkCodec_Options::fZeroInitialized"]
        [::core::mem::offset_of!(SkCodec_Options, fZeroInitialized) - 0usize];
    ["Offset of field: SkCodec_Options::fSubset"]
        [::core::mem::offset_of!(SkCodec_Options, fSubset) - 8usize];
    ["Offset of field: SkCodec_Options::fFrameIndex"]
        [::core::mem::offset_of!(SkCodec_Options, fFrameIndex) - 16usize];
    ["Offset of field: SkCodec_Options::fPriorFrame"]
        [::core::mem::offset_of!(SkCodec_Options, fPriorFrame) - 20usize];
    ["Offset of field: SkCodec_Options::fMaxDecodeMemory"]
        [::core::mem::offset_of!(SkCodec_Options, fMaxDecodeMemory) - 24usize];
};
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCodec_SkScanlineOrder {
    TopDown = 0,
    BottomUp = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkCodec_FrameInfo {
    pub fRequiredFrame: ::core::ffi::c_int,
    pub fDuration: ::core::ffi::c_int,
    pub fFullyReceived: bool,
    pub fAlphaType: SkAlphaType,
    pub fHasAlphaWithinBounds: bool,
    pub fDisposalMethod: SkCodecAnimation_DisposalMethod,
    pub fBlend: SkCodecAnimation_Blend,
    pub fFrameRect: SkIRect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCodec_FrameInfo"][::core::mem::size_of::<SkCodec_FrameInfo>() - 44usize];
    ["Alignment of SkCodec_FrameInfo"][::core::mem::align_of::<SkCodec_FrameInfo>() - 4usize];
    ["Offset of field: SkCodec_FrameInfo::fRequiredFrame"]
        [::core::mem::offset_of!(SkCodec_FrameInfo, fRequiredFrame) - 0usize];
    ["Offset of field: SkCodec_FrameInfo::fDuration"]
        [::core::mem::offset_of!(SkCodec_FrameInfo, fDuration) - 4usize];
    ["Offset of field: SkCodec_FrameInfo::fFullyReceived"]
        [::core::mem::offset_of!(SkCodec_FrameInfo, fFullyReceived) - 8usize];
    ["Offset of field: SkCodec_FrameInfo::fAlphaType"]
        [::core::mem::offset_of!(SkCodec_FrameInfo, fAlphaType) - 12usize];
    ["Offset of field: SkCodec_FrameInfo::fHasAlphaWithinBounds"]
        [::core::mem::offset_of!(SkCodec_FrameInfo, fHasAlphaWithinBounds) - 16usize];
    ["Offset of field: SkCodec_FrameInfo::fDisposalMethod"]
        [::core::mem::offset_of!(SkCodec_FrameInfo, fDisposalMethod) - 20usize];
    ["Offset of field: SkCodec_FrameInfo::fBlend"]
        [::core::mem::offset_of!(SkCodec_FrameInfo, fBlend) - 24usize];
    ["Offset of field: SkCodec_FrameInfo::fFrameRect"]
        [::core::mem::offset_of!(SkCodec_FrameInfo, fFrameRect) - 28usize];
};
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCodec_IsAnimated {
    Yes = 0,
    No = 1,
    Unknown = 2,
}
pub use self::skcms_PixelFormat as SkCodec_XformFormat;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCodec_XformTime {
    kNo_XformTime = 0,
    kPalette_XformTime = 1,
    kDecodeRow_XformTime = 2,
}
pub type SkCodec_GetPixelsCallback = __BindgenOpaqueArray<u64, 8usize>;
pub const SkCodec_kNoFrame: ::core::ffi::c_int = -1;
pub const SkCodec_kRepetitionCountInfinite: ::core::ffi::c_int = -1;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCodec"][::core::mem::size_of::<SkCodec>() - 1200usize];
    ["Alignment of SkCodec"][::core::mem::align_of::<SkCodec>() - 8usize];
    ["Offset of field: SkCodec::fEncodedInfo"]
        [::core::mem::offset_of!(SkCodec, fEncodedInfo) - 8usize];
    ["Offset of field: SkCodec::fSrcXformFormat"]
        [::core::mem::offset_of!(SkCodec, fSrcXformFormat) - 104usize];
    ["Offset of field: SkCodec::fStream"][::core::mem::offset_of!(SkCodec, fStream) - 112usize];
    ["Offset of field: SkCodec::fNeedsRewind"]
        [::core::mem::offset_of!(SkCodec, fNeedsRewind) - 120usize];
    ["Offset of field: SkCodec::fOrigin"][::core::mem::offset_of!(SkCodec, fOrigin) - 124usize];
    ["Offset of field: SkCodec::fDstInfo"][::core::mem::offset_of!(SkCodec, fDstInfo) - 128usize];
    ["Offset of field: SkCodec::fOptions"][::core::mem::offset_of!(SkCodec, fOptions) - 152usize];
    ["Offset of field: SkCodec::fXformTime"]
        [::core::mem::offset_of!(SkCodec, fXformTime) - 184usize];
    ["Offset of field: SkCodec::fDstXformFormat"]
        [::core::mem::offset_of!(SkCodec, fDstXformFormat) - 188usize];
    ["Offset of field: SkCodec::fDstProfileStorage"]
        [::core::mem::offset_of!(SkCodec, fDstProfileStorage) - 192usize];
    ["Offset of field: SkCodec::fDstProfile"]
        [::core::mem::offset_of!(SkCodec, fDstProfile) - 1168usize];
    ["Offset of field: SkCodec::fDstXformAlphaFormat"]
        [::core::mem::offset_of!(SkCodec, fDstXformAlphaFormat) - 1176usize];
    ["Offset of field: SkCodec::fCurrScanline"]
        [::core::mem::offset_of!(SkCodec, fCurrScanline) - 1180usize];
    ["Offset of field: SkCodec::fDecodeBudget"]
        [::core::mem::offset_of!(SkCodec, fDecodeBudget) - 1184usize];
    ["Offset of field: SkCodec::fStartedIncrementalDecode"]
        [::core::mem::offset_of!(SkCodec, fStartedIncrementalDecode) - 1192usize];
    ["Offset of field: SkCodec::fUsingCallbackForHandleFrameIndex"]
        [::core::mem::offset_of!(SkCodec, fUsingCallbackForHandleFrameIndex) - 1193usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?ResultToString@SkCodec@@SAPEBDW4Result@1@@Z"]
    pub fn SkCodec_ResultToString(arg1: SkCodec_Result) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeFromStream@SkCodec@@SA?AV?$unique_ptr@VSkCodec@@U?$default_delete@VSkCodec@@@std@@@std@@V?$unique_ptr@VSkStream@@U?$default_delete@VSkStream@@@std@@@3@V?$SkSpan@$$CBUDecoder@SkCodecs@@@@PEAW4Result@1@PEAVSkPngChunkReader@@W4SelectionPolicy@1@@Z"]
    pub fn SkCodec_MakeFromStream(
        arg1: u64,
        decoders: SkSpan<SkCodecs_Decoder>,
        arg2: *mut SkCodec_Result,
        arg3: *mut SkPngChunkReader,
        selectionPolicy: SkCodec_SelectionPolicy,
    ) -> u64;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeFromStream@SkCodec@@SA?AV?$unique_ptr@VSkCodec@@U?$default_delete@VSkCodec@@@std@@@std@@V?$unique_ptr@VSkStream@@U?$default_delete@VSkStream@@@std@@@3@PEAW4Result@1@PEAVSkPngChunkReader@@W4SelectionPolicy@1@@Z"]
    pub fn SkCodec_MakeFromStream1(
        arg1: u64,
        arg2: *mut SkCodec_Result,
        arg3: *mut SkPngChunkReader,
        selectionPolicy: SkCodec_SelectionPolicy,
    ) -> u64;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeFromData@SkCodec@@SA?AV?$unique_ptr@VSkCodec@@U?$default_delete@VSkCodec@@@std@@@std@@V?$sk_sp@$$CBVSkData@@@@V?$SkSpan@$$CBUDecoder@SkCodecs@@@@PEAVSkPngChunkReader@@@Z"]
    pub fn SkCodec_MakeFromData(
        arg1: sk_sp<SkData>,
        decoders: SkSpan<SkCodecs_Decoder>,
        arg2: *mut SkPngChunkReader,
    ) -> u64;
}
unsafe extern "C" {
    #[link_name = "\u{1}?MakeFromData@SkCodec@@SA?AV?$unique_ptr@VSkCodec@@U?$default_delete@VSkCodec@@@std@@@std@@V?$sk_sp@$$CBVSkData@@@@PEAVSkPngChunkReader@@@Z"]
    pub fn SkCodec_MakeFromData1(arg1: sk_sp<SkData>, arg2: *mut SkPngChunkReader) -> u64;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getPixels@SkCodec@@QEAA?AW4Result@1@AEBUSkImageInfo@@PEAX_KPEBUOptions@1@@Z"]
    pub fn SkCodec_getPixels(
        this: *mut SkCodec,
        info: *const SkImageInfo,
        pixels: *mut ::core::ffi::c_void,
        rowBytes: usize,
        arg1: *const SkCodec_Options,
    ) -> SkCodec_Result;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getImage@SkCodec@@QEAA?AV?$tuple@V?$sk_sp@VSkImage@@@@W4Result@SkCodec@@@std@@AEBUSkImageInfo@@PEBUOptions@1@@Z"]
    pub fn SkCodec_getImage(
        this: *mut SkCodec,
        info: *const SkImageInfo,
        opts: *const SkCodec_Options,
    ) -> __BindgenOpaqueArray<u64, 2usize>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getImage@SkCodec@@QEAA?AV?$tuple@V?$sk_sp@VSkImage@@@@W4Result@SkCodec@@@std@@XZ"]
    pub fn SkCodec_getImage1(this: *mut SkCodec) -> __BindgenOpaqueArray<u64, 2usize>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?queryYUVAInfo@SkCodec@@QEBA_NAEBVSupportedDataTypes@SkYUVAPixmapInfo@@PEAV3@@Z"]
    pub fn SkCodec_queryYUVAInfo(
        this: *const SkCodec,
        supportedDataTypes: *const SkYUVAPixmapInfo_SupportedDataTypes,
        yuvaPixmapInfo: *mut SkYUVAPixmapInfo,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getYUVAPlanes@SkCodec@@QEAA?AW4Result@1@AEBVSkYUVAPixmaps@@@Z"]
    pub fn SkCodec_getYUVAPlanes(
        this: *mut SkCodec,
        yuvaPixmaps: *const SkYUVAPixmaps,
    ) -> SkCodec_Result;
}
unsafe extern "C" {
    #[link_name = "\u{1}?startIncrementalDecode@SkCodec@@QEAA?AW4Result@1@AEBUSkImageInfo@@PEAX_KPEBUOptions@1@@Z"]
    pub fn SkCodec_startIncrementalDecode(
        this: *mut SkCodec,
        dstInfo: *const SkImageInfo,
        dst: *mut ::core::ffi::c_void,
        rowBytes: usize,
        arg1: *const SkCodec_Options,
    ) -> SkCodec_Result;
}
unsafe extern "C" {
    #[link_name = "\u{1}?startScanlineDecode@SkCodec@@QEAA?AW4Result@1@AEBUSkImageInfo@@PEBUOptions@1@@Z"]
    pub fn SkCodec_startScanlineDecode(
        this: *mut SkCodec,
        dstInfo: *const SkImageInfo,
        options: *const SkCodec_Options,
    ) -> SkCodec_Result;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getScanlines@SkCodec@@QEAAHPEAXH_K@Z"]
    pub fn SkCodec_getScanlines(
        this: *mut SkCodec,
        dst: *mut ::core::ffi::c_void,
        countLines: ::core::ffi::c_int,
        rowBytes: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?skipScanlines@SkCodec@@QEAA_NH@Z"]
    pub fn SkCodec_skipScanlines(this: *mut SkCodec, countLines: ::core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?outputScanline@SkCodec@@QEBAHH@Z"]
    pub fn SkCodec_outputScanline(
        this: *const SkCodec,
        inputScanline: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getFrameInfo@SkCodec@@QEAA?AV?$vector@UFrameInfo@SkCodec@@V?$allocator@UFrameInfo@SkCodec@@@std@@@std@@XZ"]
    pub fn SkCodec_getFrameInfo(this: *mut SkCodec) -> u8;
}
unsafe extern "C" {
    #[link_name = "\u{1}?rewindIfNeeded@SkCodec@@IEAA_NXZ"]
    pub fn SkCodec_rewindIfNeeded(this: *mut SkCodec) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?rewindStream@SkCodec@@IEAA_NXZ"]
    pub fn SkCodec_rewindStream(this: *mut SkCodec) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?applyColorXform@SkCodec@@IEBAXPEAXPEBXH@Z"]
    pub fn SkCodec_applyColorXform(
        this: *const SkCodec,
        dst: *mut ::core::ffi::c_void,
        src: *const ::core::ffi::c_void,
        count: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?allocateFromBudget@SkCodec@@IEAA_N_K@Z"]
    pub fn SkCodec_allocateFromBudget(this: *mut SkCodec, numBytes: usize) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkCodec@@IEAA@$$QEAUSkEncodedInfo@@W4skcms_PixelFormat@@V?$unique_ptr@VSkStream@@U?$default_delete@VSkStream@@@std@@@std@@W4SkEncodedOrigin@@@Z"]
    pub fn SkCodec_SkCodec(
        this: *mut SkCodec,
        arg1: *mut SkEncodedInfo,
        srcFormat: SkCodec_XformFormat,
        arg2: u64,
        arg3: SkEncodedOrigin,
    );
}
impl SkCodec {
    #[inline]
    pub unsafe fn ResultToString(arg1: SkCodec_Result) -> *const ::core::ffi::c_char {
        SkCodec_ResultToString(arg1)
    }
    #[inline]
    pub unsafe fn MakeFromStream(
        arg1: u64,
        decoders: SkSpan<SkCodecs_Decoder>,
        arg2: *mut SkCodec_Result,
        arg3: *mut SkPngChunkReader,
        selectionPolicy: SkCodec_SelectionPolicy,
    ) -> u64 {
        SkCodec_MakeFromStream(arg1, decoders, arg2, arg3, selectionPolicy)
    }
    #[inline]
    pub unsafe fn MakeFromStream1(
        arg1: u64,
        arg2: *mut SkCodec_Result,
        arg3: *mut SkPngChunkReader,
        selectionPolicy: SkCodec_SelectionPolicy,
    ) -> u64 {
        SkCodec_MakeFromStream1(arg1, arg2, arg3, selectionPolicy)
    }
    #[inline]
    pub unsafe fn MakeFromData(
        arg1: sk_sp<SkData>,
        decoders: SkSpan<SkCodecs_Decoder>,
        arg2: *mut SkPngChunkReader,
    ) -> u64 {
        SkCodec_MakeFromData(arg1, decoders, arg2)
    }
    #[inline]
    pub unsafe fn MakeFromData1(arg1: sk_sp<SkData>, arg2: *mut SkPngChunkReader) -> u64 {
        SkCodec_MakeFromData1(arg1, arg2)
    }
    #[inline]
    pub unsafe fn getPixels(
        &mut self,
        info: *const SkImageInfo,
        pixels: *mut ::core::ffi::c_void,
        rowBytes: usize,
        arg1: *const SkCodec_Options,
    ) -> SkCodec_Result {
        SkCodec_getPixels(self, info, pixels, rowBytes, arg1)
    }
    #[inline]
    pub unsafe fn getImage(
        &mut self,
        info: *const SkImageInfo,
        opts: *const SkCodec_Options,
    ) -> __BindgenOpaqueArray<u64, 2usize> {
        SkCodec_getImage(self, info, opts)
    }
    #[inline]
    pub unsafe fn getImage1(&mut self) -> __BindgenOpaqueArray<u64, 2usize> {
        SkCodec_getImage1(self)
    }
    #[inline]
    pub unsafe fn queryYUVAInfo(
        &self,
        supportedDataTypes: *const SkYUVAPixmapInfo_SupportedDataTypes,
        yuvaPixmapInfo: *mut SkYUVAPixmapInfo,
    ) -> bool {
        SkCodec_queryYUVAInfo(self, supportedDataTypes, yuvaPixmapInfo)
    }
    #[inline]
    pub unsafe fn getYUVAPlanes(&mut self, yuvaPixmaps: *const SkYUVAPixmaps) -> SkCodec_Result {
        SkCodec_getYUVAPlanes(self, yuvaPixmaps)
    }
    #[inline]
    pub unsafe fn startIncrementalDecode(
        &mut self,
        dstInfo: *const SkImageInfo,
        dst: *mut ::core::ffi::c_void,
        rowBytes: usize,
        arg1: *const SkCodec_Options,
    ) -> SkCodec_Result {
        SkCodec_startIncrementalDecode(self, dstInfo, dst, rowBytes, arg1)
    }
    #[inline]
    pub unsafe fn startScanlineDecode(
        &mut self,
        dstInfo: *const SkImageInfo,
        options: *const SkCodec_Options,
    ) -> SkCodec_Result {
        SkCodec_startScanlineDecode(self, dstInfo, options)
    }
    #[inline]
    pub unsafe fn getScanlines(
        &mut self,
        dst: *mut ::core::ffi::c_void,
        countLines: ::core::ffi::c_int,
        rowBytes: usize,
    ) -> ::core::ffi::c_int {
        SkCodec_getScanlines(self, dst, countLines, rowBytes)
    }
    #[inline]
    pub unsafe fn skipScanlines(&mut self, countLines: ::core::ffi::c_int) -> bool {
        SkCodec_skipScanlines(self, countLines)
    }
    #[inline]
    pub unsafe fn outputScanline(&self, inputScanline: ::core::ffi::c_int) -> ::core::ffi::c_int {
        SkCodec_outputScanline(self, inputScanline)
    }
    #[inline]
    pub unsafe fn getFrameInfo(&mut self) -> u8 {
        SkCodec_getFrameInfo(self)
    }
    #[inline]
    pub unsafe fn rewindIfNeeded(&mut self) -> bool {
        SkCodec_rewindIfNeeded(self)
    }
    #[inline]
    pub unsafe fn rewindStream(&mut self) -> bool {
        SkCodec_rewindStream(self)
    }
    #[inline]
    pub unsafe fn applyColorXform(
        &self,
        dst: *mut ::core::ffi::c_void,
        src: *const ::core::ffi::c_void,
        count: ::core::ffi::c_int,
    ) {
        SkCodec_applyColorXform(self, dst, src, count)
    }
    #[inline]
    pub unsafe fn allocateFromBudget(&mut self, numBytes: usize) -> bool {
        SkCodec_allocateFromBudget(self, numBytes)
    }
    #[inline]
    pub unsafe fn new(
        arg1: *mut SkEncodedInfo,
        srcFormat: SkCodec_XformFormat,
        arg2: u64,
        arg3: SkEncodedOrigin,
    ) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCodec_SkCodec(__bindgen_tmp.as_mut_ptr(), arg1, srcFormat, arg2, arg3);
        __bindgen_tmp.assume_init()
    }
}
unsafe extern "C" {
    #[link_name = "\u{1}?getEncodedData@SkCodec@@UEBA?AV?$unique_ptr@VSkStream@@U?$default_delete@VSkStream@@@std@@@std@@XZ"]
    pub fn SkCodec_getEncodedData(this: *mut ::core::ffi::c_void) -> u64;
}
unsafe extern "C" {
    #[link_name = "\u{1}?onOutputScanline@SkCodec@@MEBAHH@Z"]
    pub fn SkCodec_onOutputScanline(
        this: *mut ::core::ffi::c_void,
        inputScanline: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?conversionSupported@SkCodec@@MEAA_NAEBUSkImageInfo@@_N1@Z"]
    pub fn SkCodec_conversionSupported(
        this: *mut ::core::ffi::c_void,
        dst: *const SkImageInfo,
        srcIsOpaque: bool,
        needsColorXform: bool,
    ) -> bool;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkEncodedImageFormat {
    BMP = 0,
    GIF = 1,
    ICO = 2,
    JPEG = 3,
    PNG = 4,
    WBMP = 5,
    WEBP = 6,
    PKM = 7,
    KTX = 8,
    ASTC = 9,
    DNG = 10,
    HEIF = 11,
    AVIF = 12,
    JPEGXL = 13,
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkAnnotateRectWithURL@@YAXPEAVSkCanvas@@AEBUSkRect@@PEAVSkData@@@Z"]
    pub fn SkAnnotateRectWithURL(arg1: *mut SkCanvas, arg2: *const SkRect, arg3: *mut SkData);
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkAnnotateNamedDestination@@YAXPEAVSkCanvas@@AEBUSkPoint@@PEAVSkData@@@Z"]
    pub fn SkAnnotateNamedDestination(arg1: *mut SkCanvas, arg2: *const SkPoint, arg3: *mut SkData);
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkAnnotateLinkToDestination@@YAXPEAVSkCanvas@@AEBUSkRect@@PEAVSkData@@@Z"]
    pub fn SkAnnotateLinkToDestination(arg1: *mut SkCanvas, arg2: *const SkRect, arg3: *mut SkData);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkArc {
    pub fOval: SkRect,
    pub fStartAngle: SkScalar,
    pub fSweepAngle: SkScalar,
    pub fType: SkArc_Type,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkArc_Type {
    Arc = 0,
    Wedge = 1,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkArc"][::core::mem::size_of::<SkArc>() - 28usize];
    ["Alignment of SkArc"][::core::mem::align_of::<SkArc>() - 4usize];
    ["Offset of field: SkArc::fOval"][::core::mem::offset_of!(SkArc, fOval) - 0usize];
    ["Offset of field: SkArc::fStartAngle"][::core::mem::offset_of!(SkArc, fStartAngle) - 16usize];
    ["Offset of field: SkArc::fSweepAngle"][::core::mem::offset_of!(SkArc, fSweepAngle) - 20usize];
    ["Offset of field: SkArc::fType"][::core::mem::offset_of!(SkArc, fType) - 24usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct SkBBoxHierarchy {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkBBoxHierarchy_Metadata {
    pub isDraw: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkBBoxHierarchy_Metadata"]
        [::core::mem::size_of::<SkBBoxHierarchy_Metadata>() - 1usize];
    ["Alignment of SkBBoxHierarchy_Metadata"]
        [::core::mem::align_of::<SkBBoxHierarchy_Metadata>() - 1usize];
    ["Offset of field: SkBBoxHierarchy_Metadata::isDraw"]
        [::core::mem::offset_of!(SkBBoxHierarchy_Metadata, isDraw) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkBBoxHierarchy"][::core::mem::size_of::<SkBBoxHierarchy>() - 16usize];
    ["Alignment of SkBBoxHierarchy"][::core::mem::align_of::<SkBBoxHierarchy>() - 8usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?insert@SkBBoxHierarchy@@UEAAXQEBUSkRect@@QEBUMetadata@1@H@Z"]
    pub fn SkBBoxHierarchy_insert1(
        this: *mut ::core::ffi::c_void,
        arg1: *const SkRect,
        arg2: *const SkBBoxHierarchy_Metadata,
        N: ::core::ffi::c_int,
    );
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct SkBBHFactory {
    pub _bindgen_opaque_blob: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkBBHFactory"][::core::mem::size_of::<SkBBHFactory>() - 8usize];
    ["Alignment of SkBBHFactory"][::core::mem::align_of::<SkBBHFactory>() - 8usize];
};
impl SkBlendMode {
    pub const LastCoeffMode: SkBlendMode = SkBlendMode::Screen;
}
impl SkBlendMode {
    pub const LastSeparableMode: SkBlendMode = SkBlendMode::Multiply;
}
impl SkBlendMode {
    pub const LastMode: SkBlendMode = SkBlendMode::Luminosity;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkBlendMode {
    Clear = 0,
    Src = 1,
    Dst = 2,
    SrcOver = 3,
    DstOver = 4,
    SrcIn = 5,
    DstIn = 6,
    SrcOut = 7,
    DstOut = 8,
    SrcATop = 9,
    DstATop = 10,
    Xor = 11,
    Plus = 12,
    Modulate = 13,
    Screen = 14,
    Overlay = 15,
    Darken = 16,
    Lighten = 17,
    ColorDodge = 18,
    ColorBurn = 19,
    HardLight = 20,
    SoftLight = 21,
    Difference = 22,
    Exclusion = 23,
    Multiply = 24,
    Hue = 25,
    Saturation = 26,
    Color = 27,
    Luminosity = 28,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkBlendModeCoeff {
    Zero = 0,
    One = 1,
    SC = 2,
    ISC = 3,
    DC = 4,
    IDC = 5,
    SA = 6,
    ISA = 7,
    DA = 8,
    IDA = 9,
    CoeffCount = 10,
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkBlendMode_AsCoeff@@YA_NW4SkBlendMode@@PEAW4SkBlendModeCoeff@@1@Z"]
    pub fn SkBlendMode_AsCoeff(
        mode: SkBlendMode,
        src: *mut SkBlendModeCoeff,
        dst: *mut SkBlendModeCoeff,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?SkBlendMode_Name@@YAPEBDW4SkBlendMode@@@Z"]
    pub fn SkBlendMode_Name(blendMode: SkBlendMode) -> *const ::core::ffi::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkMipmap {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug)]
pub struct SkBitmap {
    pub fPixelRef: sk_sp<SkPixelRef>,
    pub fPixmap: SkPixmap,
    pub fMips: sk_sp<SkMipmap>,
}
pub const SkBitmap_AllocFlags_kZeroPixels_AllocFlag: SkBitmap_AllocFlags = 1;
pub type SkBitmap_AllocFlags = ::core::ffi::c_int;
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct SkBitmap_Allocator {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
pub type SkBitmap_Allocator_INHERITED = SkRefCnt;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkBitmap_Allocator"][::core::mem::size_of::<SkBitmap_Allocator>() - 16usize];
    ["Alignment of SkBitmap_Allocator"][::core::mem::align_of::<SkBitmap_Allocator>() - 8usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct SkBitmap_HeapAllocator {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkBitmap_HeapAllocator"][::core::mem::size_of::<SkBitmap_HeapAllocator>() - 16usize];
    ["Alignment of SkBitmap_HeapAllocator"]
        [::core::mem::align_of::<SkBitmap_HeapAllocator>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkBitmap"][::core::mem::size_of::<SkBitmap>() - 56usize];
    ["Alignment of SkBitmap"][::core::mem::align_of::<SkBitmap>() - 8usize];
    ["Offset of field: SkBitmap::fPixelRef"][::core::mem::offset_of!(SkBitmap, fPixelRef) - 0usize];
    ["Offset of field: SkBitmap::fPixmap"][::core::mem::offset_of!(SkBitmap, fPixmap) - 8usize];
    ["Offset of field: SkBitmap::fMips"][::core::mem::offset_of!(SkBitmap, fMips) - 48usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?swap@SkBitmap@@QEAAXAEAV1@@Z"]
    pub fn SkBitmap_swap(this: *mut SkBitmap, other: *mut SkBitmap);
}
unsafe extern "C" {
    #[link_name = "\u{1}?colorSpace@SkBitmap@@QEBAPEAVSkColorSpace@@XZ"]
    pub fn SkBitmap_colorSpace(this: *const SkBitmap) -> *mut SkColorSpace;
}
unsafe extern "C" {
    #[link_name = "\u{1}?refColorSpace@SkBitmap@@QEBA?AV?$sk_sp@VSkColorSpace@@@@XZ"]
    pub fn SkBitmap_refColorSpace(this: *const SkBitmap) -> sk_sp<SkColorSpace>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setAlphaType@SkBitmap@@QEAA_NW4SkAlphaType@@@Z"]
    pub fn SkBitmap_setAlphaType(this: *mut SkBitmap, alphaType: SkAlphaType) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setColorSpace@SkBitmap@@QEAAXV?$sk_sp@VSkColorSpace@@@@@Z"]
    pub fn SkBitmap_setColorSpace(this: *mut SkBitmap, colorSpace: sk_sp<SkColorSpace>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?isImmutable@SkBitmap@@QEBA_NXZ"]
    pub fn SkBitmap_isImmutable(this: *const SkBitmap) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setImmutable@SkBitmap@@QEAAXXZ"]
    pub fn SkBitmap_setImmutable(this: *mut SkBitmap);
}
unsafe extern "C" {
    #[link_name = "\u{1}?reset@SkBitmap@@QEAAXXZ"]
    pub fn SkBitmap_reset(this: *mut SkBitmap);
}
unsafe extern "C" {
    #[link_name = "\u{1}?getBounds@SkBitmap@@QEBAXPEAUSkRect@@@Z"]
    pub fn SkBitmap_getBounds(this: *const SkBitmap, bounds: *mut SkRect);
}
unsafe extern "C" {
    #[link_name = "\u{1}?getBounds@SkBitmap@@QEBAXPEAUSkIRect@@@Z"]
    pub fn SkBitmap_getBounds1(this: *const SkBitmap, bounds: *mut SkIRect);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setInfo@SkBitmap@@QEAA_NAEBUSkImageInfo@@_K@Z"]
    pub fn SkBitmap_setInfo(
        this: *mut SkBitmap,
        imageInfo: *const SkImageInfo,
        rowBytes: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?tryAllocPixelsFlags@SkBitmap@@QEAA_NAEBUSkImageInfo@@I@Z"]
    pub fn SkBitmap_tryAllocPixelsFlags(
        this: *mut SkBitmap,
        info: *const SkImageInfo,
        flags: u32,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?allocPixelsFlags@SkBitmap@@QEAAXAEBUSkImageInfo@@I@Z"]
    pub fn SkBitmap_allocPixelsFlags(this: *mut SkBitmap, info: *const SkImageInfo, flags: u32);
}
unsafe extern "C" {
    #[link_name = "\u{1}?tryAllocPixels@SkBitmap@@QEAA_NAEBUSkImageInfo@@_K@Z"]
    pub fn SkBitmap_tryAllocPixels(
        this: *mut SkBitmap,
        info: *const SkImageInfo,
        rowBytes: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?allocPixels@SkBitmap@@QEAAXAEBUSkImageInfo@@_K@Z"]
    pub fn SkBitmap_allocPixels(this: *mut SkBitmap, info: *const SkImageInfo, rowBytes: usize);
}
unsafe extern "C" {
    #[link_name = "\u{1}?allocPixels@SkBitmap@@QEAAXAEBUSkImageInfo@@@Z"]
    pub fn SkBitmap_allocPixels1(this: *mut SkBitmap, info: *const SkImageInfo);
}
unsafe extern "C" {
    #[link_name = "\u{1}?tryAllocN32Pixels@SkBitmap@@QEAA_NHH_N@Z"]
    pub fn SkBitmap_tryAllocN32Pixels(
        this: *mut SkBitmap,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        isOpaque: bool,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?allocN32Pixels@SkBitmap@@QEAAXHH_N@Z"]
    pub fn SkBitmap_allocN32Pixels(
        this: *mut SkBitmap,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        isOpaque: bool,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?installPixels@SkBitmap@@QEAA_NAEBUSkImageInfo@@PEAX_KP6AX11@Z1@Z"]
    pub fn SkBitmap_installPixels(
        this: *mut SkBitmap,
        info: *const SkImageInfo,
        pixels: *mut ::core::ffi::c_void,
        rowBytes: usize,
        releaseProc: ::core::option::Option<
            unsafe extern "C" fn(addr: *mut ::core::ffi::c_void, context: *mut ::core::ffi::c_void),
        >,
        context: *mut ::core::ffi::c_void,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?installPixels@SkBitmap@@QEAA_NAEBVSkPixmap@@@Z"]
    pub fn SkBitmap_installPixels1(this: *mut SkBitmap, pixmap: *const SkPixmap) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setPixels@SkBitmap@@QEAAXPEAX@Z"]
    pub fn SkBitmap_setPixels(this: *mut SkBitmap, pixels: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    #[link_name = "\u{1}?allocPixels@SkBitmap@@QEAAXXZ"]
    pub fn SkBitmap_allocPixels2(this: *mut SkBitmap);
}
unsafe extern "C" {
    #[link_name = "\u{1}?tryAllocPixels@SkBitmap@@QEAA_NPEAVAllocator@1@@Z"]
    pub fn SkBitmap_tryAllocPixels1(
        this: *mut SkBitmap,
        allocator: *mut SkBitmap_Allocator,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?allocPixels@SkBitmap@@QEAAXPEAVAllocator@1@@Z"]
    pub fn SkBitmap_allocPixels3(this: *mut SkBitmap, allocator: *mut SkBitmap_Allocator);
}
unsafe extern "C" {
    #[link_name = "\u{1}?pixelRefOrigin@SkBitmap@@QEBA?AUSkIPoint@@XZ"]
    pub fn SkBitmap_pixelRefOrigin(this: *const SkBitmap) -> SkIPoint;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setPixelRef@SkBitmap@@QEAAXV?$sk_sp@VSkPixelRef@@@@HH@Z"]
    pub fn SkBitmap_setPixelRef(
        this: *mut SkBitmap,
        pixelRef: sk_sp<SkPixelRef>,
        dx: ::core::ffi::c_int,
        dy: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?getGenerationID@SkBitmap@@QEBAIXZ"]
    pub fn SkBitmap_getGenerationID(this: *const SkBitmap) -> u32;
}
unsafe extern "C" {
    #[link_name = "\u{1}?notifyPixelsChanged@SkBitmap@@QEBAXXZ"]
    pub fn SkBitmap_notifyPixelsChanged(this: *const SkBitmap);
}
unsafe extern "C" {
    #[link_name = "\u{1}?eraseColor@SkBitmap@@QEBAXU?$SkRGBA4f@$02@@@Z"]
    pub fn SkBitmap_eraseColor(this: *const SkBitmap, arg1: SkColor4f);
}
unsafe extern "C" {
    #[link_name = "\u{1}?eraseColor@SkBitmap@@QEBAXI@Z"]
    pub fn SkBitmap_eraseColor1(this: *const SkBitmap, c: SkColor);
}
unsafe extern "C" {
    #[link_name = "\u{1}?erase@SkBitmap@@QEBAXU?$SkRGBA4f@$02@@AEBUSkIRect@@@Z"]
    pub fn SkBitmap_erase(this: *const SkBitmap, c: SkColor4f, area: *const SkIRect);
}
unsafe extern "C" {
    #[link_name = "\u{1}?erase@SkBitmap@@QEBAXIAEBUSkIRect@@@Z"]
    pub fn SkBitmap_erase1(this: *const SkBitmap, c: SkColor, area: *const SkIRect);
}
unsafe extern "C" {
    #[link_name = "\u{1}?getAddr@SkBitmap@@QEBAPEAXHH@Z"]
    pub fn SkBitmap_getAddr(
        this: *const SkBitmap,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "\u{1}?extractSubset@SkBitmap@@QEBA_NPEAV1@AEBUSkIRect@@@Z"]
    pub fn SkBitmap_extractSubset(
        this: *const SkBitmap,
        dst: *mut SkBitmap,
        subset: *const SkIRect,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?readPixels@SkBitmap@@QEBA_NAEBUSkImageInfo@@PEAX_KHH@Z"]
    pub fn SkBitmap_readPixels(
        this: *const SkBitmap,
        dstInfo: *const SkImageInfo,
        dstPixels: *mut ::core::ffi::c_void,
        dstRowBytes: usize,
        srcX: ::core::ffi::c_int,
        srcY: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?readPixels@SkBitmap@@QEBA_NAEBVSkPixmap@@HH@Z"]
    pub fn SkBitmap_readPixels1(
        this: *const SkBitmap,
        dst: *const SkPixmap,
        srcX: ::core::ffi::c_int,
        srcY: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?writePixels@SkBitmap@@QEAA_NAEBVSkPixmap@@HH@Z"]
    pub fn SkBitmap_writePixels(
        this: *mut SkBitmap,
        src: *const SkPixmap,
        dstX: ::core::ffi::c_int,
        dstY: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?extractAlpha@SkBitmap@@QEBA_NPEAV1@PEBVSkPaint@@PEAVAllocator@1@PEAUSkIPoint@@@Z"]
    pub fn SkBitmap_extractAlpha(
        this: *const SkBitmap,
        dst: *mut SkBitmap,
        paint: *const SkPaint,
        allocator: *mut SkBitmap_Allocator,
        offset: *mut SkIPoint,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?peekPixels@SkBitmap@@QEBA_NPEAVSkPixmap@@@Z"]
    pub fn SkBitmap_peekPixels(this: *const SkBitmap, pixmap: *mut SkPixmap) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeShader@SkBitmap@@QEBA?AV?$sk_sp@VSkShader@@@@W4SkTileMode@@0AEBUSkSamplingOptions@@PEBVSkMatrix@@@Z"]
    pub fn SkBitmap_makeShader(
        this: *const SkBitmap,
        tmx: SkTileMode,
        tmy: SkTileMode,
        arg1: *const SkSamplingOptions,
        localMatrix: *const SkMatrix,
    ) -> sk_sp<SkShader>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeShader@SkBitmap@@QEBA?AV?$sk_sp@VSkShader@@@@W4SkTileMode@@0AEBUSkSamplingOptions@@AEBVSkMatrix@@@Z"]
    pub fn SkBitmap_makeShader1(
        this: *const SkBitmap,
        tmx: SkTileMode,
        tmy: SkTileMode,
        sampling: *const SkSamplingOptions,
        lm: *const SkMatrix,
    ) -> sk_sp<SkShader>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeShader@SkBitmap@@QEBA?AV?$sk_sp@VSkShader@@@@AEBUSkSamplingOptions@@AEBVSkMatrix@@@Z"]
    pub fn SkBitmap_makeShader2(
        this: *const SkBitmap,
        sampling: *const SkSamplingOptions,
        lm: *const SkMatrix,
    ) -> sk_sp<SkShader>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeShader@SkBitmap@@QEBA?AV?$sk_sp@VSkShader@@@@AEBUSkSamplingOptions@@PEBVSkMatrix@@@Z"]
    pub fn SkBitmap_makeShader3(
        this: *const SkBitmap,
        sampling: *const SkSamplingOptions,
        lm: *const SkMatrix,
    ) -> sk_sp<SkShader>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?asImage@SkBitmap@@QEBA?AV?$sk_sp@VSkImage@@@@XZ"]
    pub fn SkBitmap_asImage(this: *const SkBitmap) -> sk_sp<SkImage>;
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkBitmap@@QEAA@XZ"]
    pub fn SkBitmap_SkBitmap(this: *mut SkBitmap);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkBitmap@@QEAA@AEBV0@@Z"]
    pub fn SkBitmap_SkBitmap1(this: *mut SkBitmap, src: *const SkBitmap);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkBitmap@@QEAA@$$QEAV0@@Z"]
    pub fn SkBitmap_SkBitmap2(this: *mut SkBitmap, src: *mut SkBitmap);
}
impl SkBitmap {
    #[inline]
    pub unsafe fn swap(&mut self, other: *mut SkBitmap) {
        SkBitmap_swap(self, other)
    }
    #[inline]
    pub unsafe fn colorSpace(&self) -> *mut SkColorSpace {
        SkBitmap_colorSpace(self)
    }
    #[inline]
    pub unsafe fn refColorSpace(&self) -> sk_sp<SkColorSpace> {
        SkBitmap_refColorSpace(self)
    }
    #[inline]
    pub unsafe fn setAlphaType(&mut self, alphaType: SkAlphaType) -> bool {
        SkBitmap_setAlphaType(self, alphaType)
    }
    #[inline]
    pub unsafe fn setColorSpace(&mut self, colorSpace: sk_sp<SkColorSpace>) {
        SkBitmap_setColorSpace(self, colorSpace)
    }
    #[inline]
    pub unsafe fn isImmutable(&self) -> bool {
        SkBitmap_isImmutable(self)
    }
    #[inline]
    pub unsafe fn setImmutable(&mut self) {
        SkBitmap_setImmutable(self)
    }
    #[inline]
    pub unsafe fn reset(&mut self) {
        SkBitmap_reset(self)
    }
    #[inline]
    pub unsafe fn getBounds(&self, bounds: *mut SkRect) {
        SkBitmap_getBounds(self, bounds)
    }
    #[inline]
    pub unsafe fn getBounds1(&self, bounds: *mut SkIRect) {
        SkBitmap_getBounds1(self, bounds)
    }
    #[inline]
    pub unsafe fn setInfo(&mut self, imageInfo: *const SkImageInfo, rowBytes: usize) -> bool {
        SkBitmap_setInfo(self, imageInfo, rowBytes)
    }
    #[inline]
    pub unsafe fn tryAllocPixelsFlags(&mut self, info: *const SkImageInfo, flags: u32) -> bool {
        SkBitmap_tryAllocPixelsFlags(self, info, flags)
    }
    #[inline]
    pub unsafe fn allocPixelsFlags(&mut self, info: *const SkImageInfo, flags: u32) {
        SkBitmap_allocPixelsFlags(self, info, flags)
    }
    #[inline]
    pub unsafe fn tryAllocPixels(&mut self, info: *const SkImageInfo, rowBytes: usize) -> bool {
        SkBitmap_tryAllocPixels(self, info, rowBytes)
    }
    #[inline]
    pub unsafe fn allocPixels(&mut self, info: *const SkImageInfo, rowBytes: usize) {
        SkBitmap_allocPixels(self, info, rowBytes)
    }
    #[inline]
    pub unsafe fn allocPixels1(&mut self, info: *const SkImageInfo) {
        SkBitmap_allocPixels1(self, info)
    }
    #[inline]
    pub unsafe fn tryAllocN32Pixels(
        &mut self,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        isOpaque: bool,
    ) -> bool {
        SkBitmap_tryAllocN32Pixels(self, width, height, isOpaque)
    }
    #[inline]
    pub unsafe fn allocN32Pixels(
        &mut self,
        width: ::core::ffi::c_int,
        height: ::core::ffi::c_int,
        isOpaque: bool,
    ) {
        SkBitmap_allocN32Pixels(self, width, height, isOpaque)
    }
    #[inline]
    pub unsafe fn installPixels(
        &mut self,
        info: *const SkImageInfo,
        pixels: *mut ::core::ffi::c_void,
        rowBytes: usize,
        releaseProc: ::core::option::Option<
            unsafe extern "C" fn(addr: *mut ::core::ffi::c_void, context: *mut ::core::ffi::c_void),
        >,
        context: *mut ::core::ffi::c_void,
    ) -> bool {
        SkBitmap_installPixels(self, info, pixels, rowBytes, releaseProc, context)
    }
    #[inline]
    pub unsafe fn installPixels1(&mut self, pixmap: *const SkPixmap) -> bool {
        SkBitmap_installPixels1(self, pixmap)
    }
    #[inline]
    pub unsafe fn setPixels(&mut self, pixels: *mut ::core::ffi::c_void) {
        SkBitmap_setPixels(self, pixels)
    }
    #[inline]
    pub unsafe fn allocPixels2(&mut self) {
        SkBitmap_allocPixels2(self)
    }
    #[inline]
    pub unsafe fn tryAllocPixels1(&mut self, allocator: *mut SkBitmap_Allocator) -> bool {
        SkBitmap_tryAllocPixels1(self, allocator)
    }
    #[inline]
    pub unsafe fn allocPixels3(&mut self, allocator: *mut SkBitmap_Allocator) {
        SkBitmap_allocPixels3(self, allocator)
    }
    #[inline]
    pub unsafe fn pixelRefOrigin(&self) -> SkIPoint {
        SkBitmap_pixelRefOrigin(self)
    }
    #[inline]
    pub unsafe fn setPixelRef(
        &mut self,
        pixelRef: sk_sp<SkPixelRef>,
        dx: ::core::ffi::c_int,
        dy: ::core::ffi::c_int,
    ) {
        SkBitmap_setPixelRef(self, pixelRef, dx, dy)
    }
    #[inline]
    pub unsafe fn getGenerationID(&self) -> u32 {
        SkBitmap_getGenerationID(self)
    }
    #[inline]
    pub unsafe fn notifyPixelsChanged(&self) {
        SkBitmap_notifyPixelsChanged(self)
    }
    #[inline]
    pub unsafe fn eraseColor(&self, arg1: SkColor4f) {
        SkBitmap_eraseColor(self, arg1)
    }
    #[inline]
    pub unsafe fn eraseColor1(&self, c: SkColor) {
        SkBitmap_eraseColor1(self, c)
    }
    #[inline]
    pub unsafe fn erase(&self, c: SkColor4f, area: *const SkIRect) {
        SkBitmap_erase(self, c, area)
    }
    #[inline]
    pub unsafe fn erase1(&self, c: SkColor, area: *const SkIRect) {
        SkBitmap_erase1(self, c, area)
    }
    #[inline]
    pub unsafe fn getAddr(
        &self,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void {
        SkBitmap_getAddr(self, x, y)
    }
    #[inline]
    pub unsafe fn extractSubset(&self, dst: *mut SkBitmap, subset: *const SkIRect) -> bool {
        SkBitmap_extractSubset(self, dst, subset)
    }
    #[inline]
    pub unsafe fn readPixels(
        &self,
        dstInfo: *const SkImageInfo,
        dstPixels: *mut ::core::ffi::c_void,
        dstRowBytes: usize,
        srcX: ::core::ffi::c_int,
        srcY: ::core::ffi::c_int,
    ) -> bool {
        SkBitmap_readPixels(self, dstInfo, dstPixels, dstRowBytes, srcX, srcY)
    }
    #[inline]
    pub unsafe fn readPixels1(
        &self,
        dst: *const SkPixmap,
        srcX: ::core::ffi::c_int,
        srcY: ::core::ffi::c_int,
    ) -> bool {
        SkBitmap_readPixels1(self, dst, srcX, srcY)
    }
    #[inline]
    pub unsafe fn writePixels(
        &mut self,
        src: *const SkPixmap,
        dstX: ::core::ffi::c_int,
        dstY: ::core::ffi::c_int,
    ) -> bool {
        SkBitmap_writePixels(self, src, dstX, dstY)
    }
    #[inline]
    pub unsafe fn extractAlpha(
        &self,
        dst: *mut SkBitmap,
        paint: *const SkPaint,
        allocator: *mut SkBitmap_Allocator,
        offset: *mut SkIPoint,
    ) -> bool {
        SkBitmap_extractAlpha(self, dst, paint, allocator, offset)
    }
    #[inline]
    pub unsafe fn peekPixels(&self, pixmap: *mut SkPixmap) -> bool {
        SkBitmap_peekPixels(self, pixmap)
    }
    #[inline]
    pub unsafe fn makeShader(
        &self,
        tmx: SkTileMode,
        tmy: SkTileMode,
        arg1: *const SkSamplingOptions,
        localMatrix: *const SkMatrix,
    ) -> sk_sp<SkShader> {
        SkBitmap_makeShader(self, tmx, tmy, arg1, localMatrix)
    }
    #[inline]
    pub unsafe fn makeShader1(
        &self,
        tmx: SkTileMode,
        tmy: SkTileMode,
        sampling: *const SkSamplingOptions,
        lm: *const SkMatrix,
    ) -> sk_sp<SkShader> {
        SkBitmap_makeShader1(self, tmx, tmy, sampling, lm)
    }
    #[inline]
    pub unsafe fn makeShader2(
        &self,
        sampling: *const SkSamplingOptions,
        lm: *const SkMatrix,
    ) -> sk_sp<SkShader> {
        SkBitmap_makeShader2(self, sampling, lm)
    }
    #[inline]
    pub unsafe fn makeShader3(
        &self,
        sampling: *const SkSamplingOptions,
        lm: *const SkMatrix,
    ) -> sk_sp<SkShader> {
        SkBitmap_makeShader3(self, sampling, lm)
    }
    #[inline]
    pub unsafe fn asImage(&self) -> sk_sp<SkImage> {
        SkBitmap_asImage(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkBitmap_SkBitmap(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(src: *const SkBitmap) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkBitmap_SkBitmap1(__bindgen_tmp.as_mut_ptr(), src);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(src: *mut SkBitmap) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkBitmap_SkBitmap2(__bindgen_tmp.as_mut_ptr(), src);
        __bindgen_tmp.assume_init()
    }
}
unsafe extern "C" {
    #[link_name = "\u{1}?allocPixelRef@HeapAllocator@SkBitmap@@UEAA_NPEAV2@@Z"]
    pub fn SkBitmap_HeapAllocator_allocPixelRef(
        this: *mut ::core::ffi::c_void,
        bitmap: *mut SkBitmap,
    ) -> bool;
}
impl SkBlurStyle {
    pub const LastEnum: SkBlurStyle = SkBlurStyle::Inner;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkBlurStyle {
    Normal = 0,
    Solid = 1,
    Outer = 2,
    Inner = 3,
}
impl SkClipOp {
    pub const Max_EnumValue: SkClipOp = SkClipOp::Intersect;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkClipOp {
    Difference = 0,
    Intersect = 1,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkTextEncoding {
    kUTF8 = 0,
    kUTF16 = 1,
    kUTF32 = 2,
    kGlyphID = 3,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkFontHinting {
    None = 0,
    Slight = 1,
    Normal = 2,
    Full = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkReadBuffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkWriteBuffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkDeserialProcs {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkSerialProcs {
    _unused: [u8; 0],
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct SkFlattenable {
    pub _bindgen_opaque_blob: [u64; 2usize],
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkFlattenable_Type {
    SkColorFilter = 0,
    SkBlender = 1,
    SkDrawable = 2,
    SkDrawLooper = 3,
    SkImageFilter = 4,
    SkMaskFilter = 5,
    SkPathEffect = 6,
    SkShader = 7,
}
pub type SkFlattenable_Factory =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut SkReadBuffer) -> sk_sp<SkFlattenable>>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkFlattenable_PrivateInitializer {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkFlattenable_PrivateInitializer"]
        [::core::mem::size_of::<SkFlattenable_PrivateInitializer>() - 1usize];
    ["Alignment of SkFlattenable_PrivateInitializer"]
        [::core::mem::align_of::<SkFlattenable_PrivateInitializer>() - 1usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?InitEffects@PrivateInitializer@SkFlattenable@@SAXXZ"]
    pub fn SkFlattenable_PrivateInitializer_InitEffects();
}
unsafe extern "C" {
    #[link_name = "\u{1}?InitImageFilters@PrivateInitializer@SkFlattenable@@SAXXZ"]
    pub fn SkFlattenable_PrivateInitializer_InitImageFilters();
}
impl SkFlattenable_PrivateInitializer {
    #[inline]
    pub unsafe fn InitEffects() {
        SkFlattenable_PrivateInitializer_InitEffects()
    }
    #[inline]
    pub unsafe fn InitImageFilters() {
        SkFlattenable_PrivateInitializer_InitImageFilters()
    }
}
pub type SkFlattenable_INHERITED = SkRefCnt;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkFlattenable"][::core::mem::size_of::<SkFlattenable>() - 16usize];
    ["Alignment of SkFlattenable"][::core::mem::align_of::<SkFlattenable>() - 8usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?NameToFactory@SkFlattenable@@SAP6A?AV?$sk_sp@VSkFlattenable@@@@AEAVSkReadBuffer@@@ZQEBD@Z"]
    pub fn SkFlattenable_NameToFactory(name: *const ::core::ffi::c_char) -> SkFlattenable_Factory;
}
unsafe extern "C" {
    #[link_name = "\u{1}?FactoryToName@SkFlattenable@@SAPEBDP6A?AV?$sk_sp@VSkFlattenable@@@@AEAVSkReadBuffer@@@Z@Z"]
    pub fn SkFlattenable_FactoryToName(arg1: SkFlattenable_Factory) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Register@SkFlattenable@@SAXQEBDP6A?AV?$sk_sp@VSkFlattenable@@@@AEAVSkReadBuffer@@@Z@Z"]
    pub fn SkFlattenable_Register(name: *const ::core::ffi::c_char, arg1: SkFlattenable_Factory);
}
unsafe extern "C" {
    #[link_name = "\u{1}?serialize@SkFlattenable@@QEBA?AV?$sk_sp@VSkData@@@@PEBUSkSerialProcs@@@Z"]
    pub fn SkFlattenable_serialize(
        this: *const SkFlattenable,
        arg1: *const SkSerialProcs,
    ) -> sk_sp<SkData>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?serialize@SkFlattenable@@QEBA_KPEAX_KPEBUSkSerialProcs@@@Z"]
    pub fn SkFlattenable_serialize1(
        this: *const SkFlattenable,
        memory: *mut ::core::ffi::c_void,
        memory_size: usize,
        arg1: *const SkSerialProcs,
    ) -> usize;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Deserialize@SkFlattenable@@SA?AV?$sk_sp@VSkFlattenable@@@@W4Type@1@PEBX_KPEBUSkDeserialProcs@@@Z"]
    pub fn SkFlattenable_Deserialize(
        arg1: SkFlattenable_Type,
        data: *const ::core::ffi::c_void,
        length: usize,
        procs: *const SkDeserialProcs,
    ) -> sk_sp<SkFlattenable>;
}
impl SkFlattenable {
    #[inline]
    pub unsafe fn NameToFactory(name: *const ::core::ffi::c_char) -> SkFlattenable_Factory {
        SkFlattenable_NameToFactory(name)
    }
    #[inline]
    pub unsafe fn FactoryToName(arg1: SkFlattenable_Factory) -> *const ::core::ffi::c_char {
        SkFlattenable_FactoryToName(arg1)
    }
    #[inline]
    pub unsafe fn Register(name: *const ::core::ffi::c_char, arg1: SkFlattenable_Factory) {
        SkFlattenable_Register(name, arg1)
    }
    #[inline]
    pub unsafe fn serialize(&self, arg1: *const SkSerialProcs) -> sk_sp<SkData> {
        SkFlattenable_serialize(self, arg1)
    }
    #[inline]
    pub unsafe fn serialize1(
        &self,
        memory: *mut ::core::ffi::c_void,
        memory_size: usize,
        arg1: *const SkSerialProcs,
    ) -> usize {
        SkFlattenable_serialize1(self, memory, memory_size, arg1)
    }
    #[inline]
    pub unsafe fn Deserialize(
        arg1: SkFlattenable_Type,
        data: *const ::core::ffi::c_void,
        length: usize,
        procs: *const SkDeserialProcs,
    ) -> sk_sp<SkFlattenable> {
        SkFlattenable_Deserialize(arg1, data, length, procs)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkImageFilter {
    pub _base: SkFlattenable,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkImageFilter_MapDirection {
    Forward = 0,
    Reverse = 1,
}
pub type SkImageFilter_INHERITED = SkFlattenable;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkImageFilter"][::core::mem::size_of::<SkImageFilter>() - 16usize];
    ["Alignment of SkImageFilter"][::core::mem::align_of::<SkImageFilter>() - 8usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?filterBounds@SkImageFilter@@QEBA?AUSkIRect@@AEBU2@AEBVSkMatrix@@W4MapDirection@1@PEBU2@@Z"]
    pub fn SkImageFilter_filterBounds(
        this: *const SkImageFilter,
        src: *const SkIRect,
        ctm: *const SkMatrix,
        arg1: SkImageFilter_MapDirection,
        inputRect: *const SkIRect,
    ) -> SkIRect;
}
unsafe extern "C" {
    #[link_name = "\u{1}?isColorFilterNode@SkImageFilter@@QEBA_NPEAPEAVSkColorFilter@@@Z"]
    pub fn SkImageFilter_isColorFilterNode(
        this: *const SkImageFilter,
        filterPtr: *mut *mut SkColorFilter,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?asAColorFilter@SkImageFilter@@QEBA_NPEAPEAVSkColorFilter@@@Z"]
    pub fn SkImageFilter_asAColorFilter(
        this: *const SkImageFilter,
        filterPtr: *mut *mut SkColorFilter,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?countInputs@SkImageFilter@@QEBAHXZ"]
    pub fn SkImageFilter_countInputs(this: *const SkImageFilter) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getInput@SkImageFilter@@QEBAPEBV1@H@Z"]
    pub fn SkImageFilter_getInput(
        this: *const SkImageFilter,
        i: ::core::ffi::c_int,
    ) -> *const SkImageFilter;
}
unsafe extern "C" {
    #[link_name = "\u{1}?canComputeFastBounds@SkImageFilter@@QEBA_NXZ"]
    pub fn SkImageFilter_canComputeFastBounds(this: *const SkImageFilter) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeWithLocalMatrix@SkImageFilter@@QEBA?AV?$sk_sp@VSkImageFilter@@@@AEBVSkMatrix@@@Z"]
    pub fn SkImageFilter_makeWithLocalMatrix(
        this: *const SkImageFilter,
        matrix: *const SkMatrix,
    ) -> sk_sp<SkImageFilter>;
}
impl SkImageFilter {
    #[inline]
    pub unsafe fn filterBounds(
        &self,
        src: *const SkIRect,
        ctm: *const SkMatrix,
        arg1: SkImageFilter_MapDirection,
        inputRect: *const SkIRect,
    ) -> SkIRect {
        SkImageFilter_filterBounds(self, src, ctm, arg1, inputRect)
    }
    #[inline]
    pub unsafe fn isColorFilterNode(&self, filterPtr: *mut *mut SkColorFilter) -> bool {
        SkImageFilter_isColorFilterNode(self, filterPtr)
    }
    #[inline]
    pub unsafe fn asAColorFilter(&self, filterPtr: *mut *mut SkColorFilter) -> bool {
        SkImageFilter_asAColorFilter(self, filterPtr)
    }
    #[inline]
    pub unsafe fn countInputs(&self) -> ::core::ffi::c_int {
        SkImageFilter_countInputs(self)
    }
    #[inline]
    pub unsafe fn getInput(&self, i: ::core::ffi::c_int) -> *const SkImageFilter {
        SkImageFilter_getInput(self, i)
    }
    #[inline]
    pub unsafe fn canComputeFastBounds(&self) -> bool {
        SkImageFilter_canComputeFastBounds(self)
    }
    #[inline]
    pub unsafe fn makeWithLocalMatrix(&self, matrix: *const SkMatrix) -> sk_sp<SkImageFilter> {
        SkImageFilter_makeWithLocalMatrix(self, matrix)
    }
}
unsafe extern "C" {
    #[link_name = "\u{1}?computeFastBounds@SkImageFilter@@UEBA?AUSkRect@@AEBU2@@Z"]
    pub fn SkImageFilter_computeFastBounds(
        this: *mut ::core::ffi::c_void,
        bounds: *const SkRect,
    ) -> SkRect;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkV2 {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkV2"][::core::mem::size_of::<SkV2>() - 8usize];
    ["Alignment of SkV2"][::core::mem::align_of::<SkV2>() - 4usize];
    ["Offset of field: SkV2::x"][::core::mem::offset_of!(SkV2, x) - 0usize];
    ["Offset of field: SkV2::y"][::core::mem::offset_of!(SkV2, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkV3 {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkV3"][::core::mem::size_of::<SkV3>() - 12usize];
    ["Alignment of SkV3"][::core::mem::align_of::<SkV3>() - 4usize];
    ["Offset of field: SkV3::x"][::core::mem::offset_of!(SkV3, x) - 0usize];
    ["Offset of field: SkV3::y"][::core::mem::offset_of!(SkV3, y) - 4usize];
    ["Offset of field: SkV3::z"][::core::mem::offset_of!(SkV3, z) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkV4 {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkV4"][::core::mem::size_of::<SkV4>() - 16usize];
    ["Alignment of SkV4"][::core::mem::align_of::<SkV4>() - 4usize];
    ["Offset of field: SkV4::x"][::core::mem::offset_of!(SkV4, x) - 0usize];
    ["Offset of field: SkV4::y"][::core::mem::offset_of!(SkV4, y) - 4usize];
    ["Offset of field: SkV4::z"][::core::mem::offset_of!(SkV4, z) - 8usize];
    ["Offset of field: SkV4::w"][::core::mem::offset_of!(SkV4, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkM44 {
    pub fMat: [SkScalar; 16usize],
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkM44_Uninitialized_Constructor {
    kUninitialized_Constructor = 0,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkM44_NaN_Constructor {
    kNaN_Constructor = 0,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkM44"][::core::mem::size_of::<SkM44>() - 64usize];
    ["Alignment of SkM44"][::core::mem::align_of::<SkM44>() - 4usize];
    ["Offset of field: SkM44::fMat"][::core::mem::offset_of!(SkM44, fMat) - 0usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?RectToRect@SkM44@@SA?AV1@AEBUSkRect@@0@Z"]
    pub fn SkM44_RectToRect(src: *const SkRect, dst: *const SkRect) -> SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?LookAt@SkM44@@SA?AV1@AEBUSkV3@@00@Z"]
    pub fn SkM44_LookAt(eye: *const SkV3, center: *const SkV3, up: *const SkV3) -> SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?Perspective@SkM44@@SA?AV1@MMM@Z"]
    pub fn SkM44_Perspective(near: f32, far: f32, angle: f32) -> SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getRowMajor@SkM44@@QEBAXQEAM@Z"]
    pub fn SkM44_getRowMajor(this: *const SkM44, v: *mut SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setRotateUnitSinCos@SkM44@@QEAAAEAV1@USkV3@@MM@Z"]
    pub fn SkM44_setRotateUnitSinCos(
        this: *mut SkM44,
        axis: SkV3,
        sinAngle: SkScalar,
        cosAngle: SkScalar,
    ) -> *mut SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setRotate@SkM44@@QEAAAEAV1@USkV3@@M@Z"]
    pub fn SkM44_setRotate(this: *mut SkM44, axis: SkV3, radians: SkScalar) -> *mut SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setConcat@SkM44@@QEAAAEAV1@AEBV1@0@Z"]
    pub fn SkM44_setConcat(this: *mut SkM44, a: *const SkM44, b: *const SkM44) -> *mut SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?normalizePerspective@SkM44@@QEAAXXZ"]
    pub fn SkM44_normalizePerspective(this: *mut SkM44);
}
unsafe extern "C" {
    #[link_name = "\u{1}?invert@SkM44@@QEBA_NPEAV1@@Z"]
    pub fn SkM44_invert(this: *const SkM44, inverse: *mut SkM44) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?transpose@SkM44@@QEBA?AV1@XZ"]
    pub fn SkM44_transpose(this: *const SkM44) -> SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?dump@SkM44@@QEBAXXZ"]
    pub fn SkM44_dump(this: *const SkM44);
}
unsafe extern "C" {
    #[link_name = "\u{1}?map@SkM44@@QEBA?AUSkV4@@MMMM@Z"]
    pub fn SkM44_map(this: *const SkM44, x: f32, y: f32, z: f32, w: f32) -> SkV4;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preTranslate@SkM44@@QEAAAEAV1@MMM@Z"]
    pub fn SkM44_preTranslate(
        this: *mut SkM44,
        x: SkScalar,
        y: SkScalar,
        z: SkScalar,
    ) -> *mut SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?postTranslate@SkM44@@QEAAAEAV1@MMM@Z"]
    pub fn SkM44_postTranslate(
        this: *mut SkM44,
        x: SkScalar,
        y: SkScalar,
        z: SkScalar,
    ) -> *mut SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preScale@SkM44@@QEAAAEAV1@MM@Z"]
    pub fn SkM44_preScale(this: *mut SkM44, x: SkScalar, y: SkScalar) -> *mut SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preScale@SkM44@@QEAAAEAV1@MMM@Z"]
    pub fn SkM44_preScale1(this: *mut SkM44, x: SkScalar, y: SkScalar, z: SkScalar) -> *mut SkM44;
}
unsafe extern "C" {
    #[link_name = "\u{1}?preConcat@SkM44@@QEAAAEAV1@AEBVSkMatrix@@@Z"]
    pub fn SkM44_preConcat(this: *mut SkM44, arg1: *const SkMatrix) -> *mut SkM44;
}
impl SkM44 {
    #[inline]
    pub unsafe fn RectToRect(src: *const SkRect, dst: *const SkRect) -> SkM44 {
        SkM44_RectToRect(src, dst)
    }
    #[inline]
    pub unsafe fn LookAt(eye: *const SkV3, center: *const SkV3, up: *const SkV3) -> SkM44 {
        SkM44_LookAt(eye, center, up)
    }
    #[inline]
    pub unsafe fn Perspective(near: f32, far: f32, angle: f32) -> SkM44 {
        SkM44_Perspective(near, far, angle)
    }
    #[inline]
    pub unsafe fn getRowMajor(&self, v: *mut SkScalar) {
        SkM44_getRowMajor(self, v)
    }
    #[inline]
    pub unsafe fn setRotateUnitSinCos(
        &mut self,
        axis: SkV3,
        sinAngle: SkScalar,
        cosAngle: SkScalar,
    ) -> *mut SkM44 {
        SkM44_setRotateUnitSinCos(self, axis, sinAngle, cosAngle)
    }
    #[inline]
    pub unsafe fn setRotate(&mut self, axis: SkV3, radians: SkScalar) -> *mut SkM44 {
        SkM44_setRotate(self, axis, radians)
    }
    #[inline]
    pub unsafe fn setConcat(&mut self, a: *const SkM44, b: *const SkM44) -> *mut SkM44 {
        SkM44_setConcat(self, a, b)
    }
    #[inline]
    pub unsafe fn normalizePerspective(&mut self) {
        SkM44_normalizePerspective(self)
    }
    #[inline]
    pub unsafe fn invert(&self, inverse: *mut SkM44) -> bool {
        SkM44_invert(self, inverse)
    }
    #[inline]
    pub unsafe fn transpose(&self) -> SkM44 {
        SkM44_transpose(self)
    }
    #[inline]
    pub unsafe fn dump(&self) {
        SkM44_dump(self)
    }
    #[inline]
    pub unsafe fn map(&self, x: f32, y: f32, z: f32, w: f32) -> SkV4 {
        SkM44_map(self, x, y, z, w)
    }
    #[inline]
    pub unsafe fn preTranslate(&mut self, x: SkScalar, y: SkScalar, z: SkScalar) -> *mut SkM44 {
        SkM44_preTranslate(self, x, y, z)
    }
    #[inline]
    pub unsafe fn postTranslate(&mut self, x: SkScalar, y: SkScalar, z: SkScalar) -> *mut SkM44 {
        SkM44_postTranslate(self, x, y, z)
    }
    #[inline]
    pub unsafe fn preScale(&mut self, x: SkScalar, y: SkScalar) -> *mut SkM44 {
        SkM44_preScale(self, x, y)
    }
    #[inline]
    pub unsafe fn preScale1(&mut self, x: SkScalar, y: SkScalar, z: SkScalar) -> *mut SkM44 {
        SkM44_preScale1(self, x, y, z)
    }
    #[inline]
    pub unsafe fn preConcat(&mut self, arg1: *const SkMatrix) -> *mut SkM44 {
        SkM44_preConcat(self, arg1)
    }
}
#[repr(C)]
pub struct SkPaint {
    pub fPathEffect: sk_sp<SkPathEffect>,
    pub fShader: sk_sp<SkShader>,
    pub fMaskFilter: sk_sp<SkMaskFilter>,
    pub fColorFilter: sk_sp<SkColorFilter>,
    pub fImageFilter: sk_sp<SkImageFilter>,
    pub fBlender: sk_sp<SkBlender>,
    pub fColor4f: SkColor4f,
    pub fWidth: SkScalar,
    pub fMiterLimit: SkScalar,
    pub __bindgen_anon_1: SkPaint__bindgen_ty_1,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkPaint_Style {
    Fill = 0,
    Stroke = 1,
    StrokeAndFill = 2,
}
impl SkPaint_Cap {
    pub const Last: SkPaint_Cap = SkPaint_Cap::Square;
}
impl SkPaint_Cap {
    pub const Default: SkPaint_Cap = SkPaint_Cap::Butt;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkPaint_Cap {
    Butt = 0,
    Round = 1,
    Square = 2,
}
impl SkPaint_Join {
    pub const Last: SkPaint_Join = SkPaint_Join::Bevel;
}
impl SkPaint_Join {
    pub const Default: SkPaint_Join = SkPaint_Join::Miter;
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkPaint_Join {
    Miter = 0,
    Round = 1,
    Bevel = 2,
}
pub type SkPaint_sk_is_trivially_relocatable = std_true_type;
#[repr(C)]
#[derive(Copy, Clone)]
pub union SkPaint__bindgen_ty_1 {
    pub fBitfields: SkPaint__bindgen_ty_1__bindgen_ty_1,
    pub fBitfieldsUInt: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkPaint__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkPaint__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<SkPaint__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of SkPaint__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<SkPaint__bindgen_ty_1__bindgen_ty_1>() - 4usize];
};
impl SkPaint__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn fAntiAlias(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_fAntiAlias(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn fAntiAlias_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_fAntiAlias_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn fDither(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_fDither(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn fDither_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_fDither_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn fCapType(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_fCapType(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn fCapType_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_fCapType_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn fJoinType(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_fJoinType(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn fJoinType_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_fJoinType_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn fStyle(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_fStyle(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn fStyle_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_fStyle_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn fPadding(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_fPadding(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn fPadding_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                24u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_fPadding_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                24u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        fAntiAlias: ::core::ffi::c_uint,
        fDither: ::core::ffi::c_uint,
        fCapType: ::core::ffi::c_uint,
        fJoinType: ::core::ffi::c_uint,
        fStyle: ::core::ffi::c_uint,
        fPadding: ::core::ffi::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let fAntiAlias: u32 = unsafe { ::core::mem::transmute(fAntiAlias) };
            fAntiAlias as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let fDither: u32 = unsafe { ::core::mem::transmute(fDither) };
            fDither as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let fCapType: u32 = unsafe { ::core::mem::transmute(fCapType) };
            fCapType as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let fJoinType: u32 = unsafe { ::core::mem::transmute(fJoinType) };
            fJoinType as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let fStyle: u32 = unsafe { ::core::mem::transmute(fStyle) };
            fStyle as u64
        });
        __bindgen_bitfield_unit.set(8usize, 24u8, {
            let fPadding: u32 = unsafe { ::core::mem::transmute(fPadding) };
            fPadding as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkPaint__bindgen_ty_1"][::core::mem::size_of::<SkPaint__bindgen_ty_1>() - 4usize];
    ["Alignment of SkPaint__bindgen_ty_1"]
        [::core::mem::align_of::<SkPaint__bindgen_ty_1>() - 4usize];
    ["Offset of field: SkPaint__bindgen_ty_1::fBitfields"]
        [::core::mem::offset_of!(SkPaint__bindgen_ty_1, fBitfields) - 0usize];
    ["Offset of field: SkPaint__bindgen_ty_1::fBitfieldsUInt"]
        [::core::mem::offset_of!(SkPaint__bindgen_ty_1, fBitfieldsUInt) - 0usize];
};
pub const SkPaint_kStyleCount: ::core::ffi::c_int = 3;
pub const SkPaint_kCapCount: ::core::ffi::c_int = 3;
pub const SkPaint_kJoinCount: ::core::ffi::c_int = 3;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkPaint"][::core::mem::size_of::<SkPaint>() - 80usize];
    ["Alignment of SkPaint"][::core::mem::align_of::<SkPaint>() - 8usize];
    ["Offset of field: SkPaint::fPathEffect"]
        [::core::mem::offset_of!(SkPaint, fPathEffect) - 0usize];
    ["Offset of field: SkPaint::fShader"][::core::mem::offset_of!(SkPaint, fShader) - 8usize];
    ["Offset of field: SkPaint::fMaskFilter"]
        [::core::mem::offset_of!(SkPaint, fMaskFilter) - 16usize];
    ["Offset of field: SkPaint::fColorFilter"]
        [::core::mem::offset_of!(SkPaint, fColorFilter) - 24usize];
    ["Offset of field: SkPaint::fImageFilter"]
        [::core::mem::offset_of!(SkPaint, fImageFilter) - 32usize];
    ["Offset of field: SkPaint::fBlender"][::core::mem::offset_of!(SkPaint, fBlender) - 40usize];
    ["Offset of field: SkPaint::fColor4f"][::core::mem::offset_of!(SkPaint, fColor4f) - 48usize];
    ["Offset of field: SkPaint::fWidth"][::core::mem::offset_of!(SkPaint, fWidth) - 64usize];
    ["Offset of field: SkPaint::fMiterLimit"]
        [::core::mem::offset_of!(SkPaint, fMiterLimit) - 68usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?reset@SkPaint@@QEAAXXZ"]
    pub fn SkPaint_reset(this: *mut SkPaint);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setStyle@SkPaint@@QEAAXW4Style@1@@Z"]
    pub fn SkPaint_setStyle(this: *mut SkPaint, style: SkPaint_Style);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setStroke@SkPaint@@QEAAX_N@Z"]
    pub fn SkPaint_setStroke(this: *mut SkPaint, arg1: bool);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setColor@SkPaint@@QEAAXI@Z"]
    pub fn SkPaint_setColor(this: *mut SkPaint, color: SkColor);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setColor@SkPaint@@QEAAXAEBU?$SkRGBA4f@$02@@PEAVSkColorSpace@@@Z"]
    pub fn SkPaint_setColor1(
        this: *mut SkPaint,
        color: *const SkColor4f,
        colorSpace: *mut SkColorSpace,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?setAlphaf@SkPaint@@QEAAXM@Z"]
    pub fn SkPaint_setAlphaf(this: *mut SkPaint, a: f32);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setARGB@SkPaint@@QEAAXIIII@Z"]
    pub fn SkPaint_setARGB(this: *mut SkPaint, a: U8CPU, r: U8CPU, g: U8CPU, b: U8CPU);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setStrokeWidth@SkPaint@@QEAAXM@Z"]
    pub fn SkPaint_setStrokeWidth(this: *mut SkPaint, width: SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setStrokeMiter@SkPaint@@QEAAXM@Z"]
    pub fn SkPaint_setStrokeMiter(this: *mut SkPaint, miterLimit: SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setStrokeCap@SkPaint@@QEAAXW4Cap@1@@Z"]
    pub fn SkPaint_setStrokeCap(this: *mut SkPaint, cap: SkPaint_Cap);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setStrokeJoin@SkPaint@@QEAAXW4Join@1@@Z"]
    pub fn SkPaint_setStrokeJoin(this: *mut SkPaint, join: SkPaint_Join);
}
unsafe extern "C" {
    #[link_name = "\u{1}?refShader@SkPaint@@QEBA?AV?$sk_sp@VSkShader@@@@XZ"]
    pub fn SkPaint_refShader(this: *const SkPaint) -> sk_sp<SkShader>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setShader@SkPaint@@QEAAXV?$sk_sp@VSkShader@@@@@Z"]
    pub fn SkPaint_setShader(this: *mut SkPaint, shader: sk_sp<SkShader>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?refColorFilter@SkPaint@@QEBA?AV?$sk_sp@VSkColorFilter@@@@XZ"]
    pub fn SkPaint_refColorFilter(this: *const SkPaint) -> sk_sp<SkColorFilter>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setColorFilter@SkPaint@@QEAAXV?$sk_sp@VSkColorFilter@@@@@Z"]
    pub fn SkPaint_setColorFilter(this: *mut SkPaint, colorFilter: sk_sp<SkColorFilter>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?asBlendMode@SkPaint@@QEBA?AV?$optional@W4SkBlendMode@@@std@@XZ"]
    pub fn SkPaint_asBlendMode(this: *const SkPaint) -> __BindgenOpaqueArray<u32, 2usize>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getBlendMode_or@SkPaint@@QEBA?AW4SkBlendMode@@W42@@Z"]
    pub fn SkPaint_getBlendMode_or(this: *const SkPaint, defaultMode: SkBlendMode) -> SkBlendMode;
}
unsafe extern "C" {
    #[link_name = "\u{1}?isSrcOver@SkPaint@@QEBA_NXZ"]
    pub fn SkPaint_isSrcOver(this: *const SkPaint) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setBlendMode@SkPaint@@QEAAXW4SkBlendMode@@@Z"]
    pub fn SkPaint_setBlendMode(this: *mut SkPaint, mode: SkBlendMode);
}
unsafe extern "C" {
    #[link_name = "\u{1}?refBlender@SkPaint@@QEBA?AV?$sk_sp@VSkBlender@@@@XZ"]
    pub fn SkPaint_refBlender(this: *const SkPaint) -> sk_sp<SkBlender>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setBlender@SkPaint@@QEAAXV?$sk_sp@VSkBlender@@@@@Z"]
    pub fn SkPaint_setBlender(this: *mut SkPaint, blender: sk_sp<SkBlender>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?refPathEffect@SkPaint@@QEBA?AV?$sk_sp@VSkPathEffect@@@@XZ"]
    pub fn SkPaint_refPathEffect(this: *const SkPaint) -> sk_sp<SkPathEffect>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setPathEffect@SkPaint@@QEAAXV?$sk_sp@VSkPathEffect@@@@@Z"]
    pub fn SkPaint_setPathEffect(this: *mut SkPaint, pathEffect: sk_sp<SkPathEffect>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?refMaskFilter@SkPaint@@QEBA?AV?$sk_sp@VSkMaskFilter@@@@XZ"]
    pub fn SkPaint_refMaskFilter(this: *const SkPaint) -> sk_sp<SkMaskFilter>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setMaskFilter@SkPaint@@QEAAXV?$sk_sp@VSkMaskFilter@@@@@Z"]
    pub fn SkPaint_setMaskFilter(this: *mut SkPaint, maskFilter: sk_sp<SkMaskFilter>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?refImageFilter@SkPaint@@QEBA?AV?$sk_sp@VSkImageFilter@@@@XZ"]
    pub fn SkPaint_refImageFilter(this: *const SkPaint) -> sk_sp<SkImageFilter>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?setImageFilter@SkPaint@@QEAAXV?$sk_sp@VSkImageFilter@@@@@Z"]
    pub fn SkPaint_setImageFilter(this: *mut SkPaint, imageFilter: sk_sp<SkImageFilter>);
}
unsafe extern "C" {
    #[link_name = "\u{1}?nothingToDraw@SkPaint@@QEBA_NXZ"]
    pub fn SkPaint_nothingToDraw(this: *const SkPaint) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?canComputeFastBounds@SkPaint@@QEBA_NXZ"]
    pub fn SkPaint_canComputeFastBounds(this: *const SkPaint) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?computeFastBounds@SkPaint@@QEBAAEBUSkRect@@AEBU2@PEAU2@@Z"]
    pub fn SkPaint_computeFastBounds(
        this: *const SkPaint,
        orig: *const SkRect,
        storage: *mut SkRect,
    ) -> *const SkRect;
}
unsafe extern "C" {
    #[link_name = "\u{1}?doComputeFastBounds@SkPaint@@QEBAAEBUSkRect@@AEBU2@PEAU2@W4Style@1@@Z"]
    pub fn SkPaint_doComputeFastBounds(
        this: *const SkPaint,
        orig: *const SkRect,
        storage: *mut SkRect,
        style: SkPaint_Style,
    ) -> *const SkRect;
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkPaint@@QEAA@XZ"]
    pub fn SkPaint_SkPaint(this: *mut SkPaint);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkPaint@@QEAA@AEBU?$SkRGBA4f@$02@@PEAVSkColorSpace@@@Z"]
    pub fn SkPaint_SkPaint1(
        this: *mut SkPaint,
        color: *const SkColor4f,
        colorSpace: *mut SkColorSpace,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkPaint@@QEAA@AEBV0@@Z"]
    pub fn SkPaint_SkPaint2(this: *mut SkPaint, paint: *const SkPaint);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkPaint@@QEAA@$$QEAV0@@Z"]
    pub fn SkPaint_SkPaint3(this: *mut SkPaint, paint: *mut SkPaint);
}
impl SkPaint {
    #[inline]
    pub unsafe fn reset(&mut self) {
        SkPaint_reset(self)
    }
    #[inline]
    pub unsafe fn setStyle(&mut self, style: SkPaint_Style) {
        SkPaint_setStyle(self, style)
    }
    #[inline]
    pub unsafe fn setStroke(&mut self, arg1: bool) {
        SkPaint_setStroke(self, arg1)
    }
    #[inline]
    pub unsafe fn setColor(&mut self, color: SkColor) {
        SkPaint_setColor(self, color)
    }
    #[inline]
    pub unsafe fn setColor1(&mut self, color: *const SkColor4f, colorSpace: *mut SkColorSpace) {
        SkPaint_setColor1(self, color, colorSpace)
    }
    #[inline]
    pub unsafe fn setAlphaf(&mut self, a: f32) {
        SkPaint_setAlphaf(self, a)
    }
    #[inline]
    pub unsafe fn setARGB(&mut self, a: U8CPU, r: U8CPU, g: U8CPU, b: U8CPU) {
        SkPaint_setARGB(self, a, r, g, b)
    }
    #[inline]
    pub unsafe fn setStrokeWidth(&mut self, width: SkScalar) {
        SkPaint_setStrokeWidth(self, width)
    }
    #[inline]
    pub unsafe fn setStrokeMiter(&mut self, miterLimit: SkScalar) {
        SkPaint_setStrokeMiter(self, miterLimit)
    }
    #[inline]
    pub unsafe fn setStrokeCap(&mut self, cap: SkPaint_Cap) {
        SkPaint_setStrokeCap(self, cap)
    }
    #[inline]
    pub unsafe fn setStrokeJoin(&mut self, join: SkPaint_Join) {
        SkPaint_setStrokeJoin(self, join)
    }
    #[inline]
    pub unsafe fn refShader(&self) -> sk_sp<SkShader> {
        SkPaint_refShader(self)
    }
    #[inline]
    pub unsafe fn setShader(&mut self, shader: sk_sp<SkShader>) {
        SkPaint_setShader(self, shader)
    }
    #[inline]
    pub unsafe fn refColorFilter(&self) -> sk_sp<SkColorFilter> {
        SkPaint_refColorFilter(self)
    }
    #[inline]
    pub unsafe fn setColorFilter(&mut self, colorFilter: sk_sp<SkColorFilter>) {
        SkPaint_setColorFilter(self, colorFilter)
    }
    #[inline]
    pub unsafe fn asBlendMode(&self) -> __BindgenOpaqueArray<u32, 2usize> {
        SkPaint_asBlendMode(self)
    }
    #[inline]
    pub unsafe fn getBlendMode_or(&self, defaultMode: SkBlendMode) -> SkBlendMode {
        SkPaint_getBlendMode_or(self, defaultMode)
    }
    #[inline]
    pub unsafe fn isSrcOver(&self) -> bool {
        SkPaint_isSrcOver(self)
    }
    #[inline]
    pub unsafe fn setBlendMode(&mut self, mode: SkBlendMode) {
        SkPaint_setBlendMode(self, mode)
    }
    #[inline]
    pub unsafe fn refBlender(&self) -> sk_sp<SkBlender> {
        SkPaint_refBlender(self)
    }
    #[inline]
    pub unsafe fn setBlender(&mut self, blender: sk_sp<SkBlender>) {
        SkPaint_setBlender(self, blender)
    }
    #[inline]
    pub unsafe fn refPathEffect(&self) -> sk_sp<SkPathEffect> {
        SkPaint_refPathEffect(self)
    }
    #[inline]
    pub unsafe fn setPathEffect(&mut self, pathEffect: sk_sp<SkPathEffect>) {
        SkPaint_setPathEffect(self, pathEffect)
    }
    #[inline]
    pub unsafe fn refMaskFilter(&self) -> sk_sp<SkMaskFilter> {
        SkPaint_refMaskFilter(self)
    }
    #[inline]
    pub unsafe fn setMaskFilter(&mut self, maskFilter: sk_sp<SkMaskFilter>) {
        SkPaint_setMaskFilter(self, maskFilter)
    }
    #[inline]
    pub unsafe fn refImageFilter(&self) -> sk_sp<SkImageFilter> {
        SkPaint_refImageFilter(self)
    }
    #[inline]
    pub unsafe fn setImageFilter(&mut self, imageFilter: sk_sp<SkImageFilter>) {
        SkPaint_setImageFilter(self, imageFilter)
    }
    #[inline]
    pub unsafe fn nothingToDraw(&self) -> bool {
        SkPaint_nothingToDraw(self)
    }
    #[inline]
    pub unsafe fn canComputeFastBounds(&self) -> bool {
        SkPaint_canComputeFastBounds(self)
    }
    #[inline]
    pub unsafe fn computeFastBounds(
        &self,
        orig: *const SkRect,
        storage: *mut SkRect,
    ) -> *const SkRect {
        SkPaint_computeFastBounds(self, orig, storage)
    }
    #[inline]
    pub unsafe fn doComputeFastBounds(
        &self,
        orig: *const SkRect,
        storage: *mut SkRect,
        style: SkPaint_Style,
    ) -> *const SkRect {
        SkPaint_doComputeFastBounds(self, orig, storage, style)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkPaint_SkPaint(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(color: *const SkColor4f, colorSpace: *mut SkColorSpace) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkPaint_SkPaint1(__bindgen_tmp.as_mut_ptr(), color, colorSpace);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(paint: *const SkPaint) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkPaint_SkPaint2(__bindgen_tmp.as_mut_ptr(), paint);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(paint: *mut SkPaint) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkPaint_SkPaint3(__bindgen_tmp.as_mut_ptr(), paint);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkRSXform {
    pub fSCos: SkScalar,
    pub fSSin: SkScalar,
    pub fTx: SkScalar,
    pub fTy: SkScalar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkRSXform"][::core::mem::size_of::<SkRSXform>() - 16usize];
    ["Alignment of SkRSXform"][::core::mem::align_of::<SkRSXform>() - 4usize];
    ["Offset of field: SkRSXform::fSCos"][::core::mem::offset_of!(SkRSXform, fSCos) - 0usize];
    ["Offset of field: SkRSXform::fSSin"][::core::mem::offset_of!(SkRSXform, fSSin) - 4usize];
    ["Offset of field: SkRSXform::fTx"][::core::mem::offset_of!(SkRSXform, fTx) - 8usize];
    ["Offset of field: SkRSXform::fTy"][::core::mem::offset_of!(SkRSXform, fTy) - 12usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?toQuad@SkRSXform@@QEBAXMMQEAUSkPoint@@@Z"]
    pub fn SkRSXform_toQuad(
        this: *const SkRSXform,
        width: SkScalar,
        height: SkScalar,
        quad: *mut SkPoint,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?toTriStrip@SkRSXform@@QEBAXMMQEAUSkPoint@@@Z"]
    pub fn SkRSXform_toTriStrip(
        this: *const SkRSXform,
        width: SkScalar,
        height: SkScalar,
        strip: *mut SkPoint,
    );
}
impl SkRSXform {
    #[inline]
    pub unsafe fn toQuad(&self, width: SkScalar, height: SkScalar, quad: *mut SkPoint) {
        SkRSXform_toQuad(self, width, height, quad)
    }
    #[inline]
    pub unsafe fn toTriStrip(&self, width: SkScalar, height: SkScalar, strip: *mut SkPoint) {
        SkRSXform_toTriStrip(self, width, height, strip)
    }
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct SkRasterHandleAllocator {
    pub _bindgen_opaque_blob: u64,
}
pub type SkRasterHandleAllocator_Handle = *mut ::core::ffi::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkRasterHandleAllocator_Rec {
    pub fReleaseProc: ::core::option::Option<
        unsafe extern "C" fn(pixels: *mut ::core::ffi::c_void, ctx: *mut ::core::ffi::c_void),
    >,
    pub fReleaseCtx: *mut ::core::ffi::c_void,
    pub fPixels: *mut ::core::ffi::c_void,
    pub fRowBytes: usize,
    pub fHandle: SkRasterHandleAllocator_Handle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkRasterHandleAllocator_Rec"]
        [::core::mem::size_of::<SkRasterHandleAllocator_Rec>() - 40usize];
    ["Alignment of SkRasterHandleAllocator_Rec"]
        [::core::mem::align_of::<SkRasterHandleAllocator_Rec>() - 8usize];
    ["Offset of field: SkRasterHandleAllocator_Rec::fReleaseProc"]
        [::core::mem::offset_of!(SkRasterHandleAllocator_Rec, fReleaseProc) - 0usize];
    ["Offset of field: SkRasterHandleAllocator_Rec::fReleaseCtx"]
        [::core::mem::offset_of!(SkRasterHandleAllocator_Rec, fReleaseCtx) - 8usize];
    ["Offset of field: SkRasterHandleAllocator_Rec::fPixels"]
        [::core::mem::offset_of!(SkRasterHandleAllocator_Rec, fPixels) - 16usize];
    ["Offset of field: SkRasterHandleAllocator_Rec::fRowBytes"]
        [::core::mem::offset_of!(SkRasterHandleAllocator_Rec, fRowBytes) - 24usize];
    ["Offset of field: SkRasterHandleAllocator_Rec::fHandle"]
        [::core::mem::offset_of!(SkRasterHandleAllocator_Rec, fHandle) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkRasterHandleAllocator"][::core::mem::size_of::<SkRasterHandleAllocator>() - 8usize];
    ["Alignment of SkRasterHandleAllocator"]
        [::core::mem::align_of::<SkRasterHandleAllocator>() - 8usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?MakeCanvas@SkRasterHandleAllocator@@SA?AV?$unique_ptr@VSkCanvas@@U?$default_delete@VSkCanvas@@@std@@@std@@V?$unique_ptr@VSkRasterHandleAllocator@@U?$default_delete@VSkRasterHandleAllocator@@@std@@@3@AEBUSkImageInfo@@PEBURec@1@PEBVSkSurfaceProps@@@Z"]
    pub fn SkRasterHandleAllocator_MakeCanvas(
        arg1: u64,
        arg2: *const SkImageInfo,
        rec: *const SkRasterHandleAllocator_Rec,
        props: *const SkSurfaceProps,
    ) -> u64;
}
impl SkRasterHandleAllocator {
    #[inline]
    pub unsafe fn MakeCanvas(
        arg1: u64,
        arg2: *const SkImageInfo,
        rec: *const SkRasterHandleAllocator_Rec,
        props: *const SkSurfaceProps,
    ) -> u64 {
        SkRasterHandleAllocator_MakeCanvas(arg1, arg2, rec, props)
    }
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkPixelGeometry {
    kUnknown_SkPixelGeometry = 0,
    kRGB_H_SkPixelGeometry = 1,
    kBGR_H_SkPixelGeometry = 2,
    kRGB_V_SkPixelGeometry = 3,
    kBGR_V_SkPixelGeometry = 4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkSurfaceProps {
    pub fFlags: u32,
    pub fPixelGeometry: SkPixelGeometry,
    pub fTextContrast: SkScalar,
    pub fTextGamma: SkScalar,
}
pub const SkSurfaceProps_Flags_kDefault_Flag: SkSurfaceProps_Flags = 0;
pub const SkSurfaceProps_Flags_kUseDeviceIndependentFonts_Flag: SkSurfaceProps_Flags = 1;
pub const SkSurfaceProps_Flags_kDynamicMSAA_Flag: SkSurfaceProps_Flags = 2;
pub const SkSurfaceProps_Flags_kAlwaysDither_Flag: SkSurfaceProps_Flags = 4;
pub const SkSurfaceProps_Flags_kPreservesTransparentDraws_Flag: SkSurfaceProps_Flags = 8;
pub type SkSurfaceProps_Flags = ::core::ffi::c_int;
pub const SkSurfaceProps_kMaxContrastInclusive: SkScalar = 1.0;
pub const SkSurfaceProps_kMinContrastInclusive: SkScalar = 0.0;
pub const SkSurfaceProps_kMaxGammaExclusive: SkScalar = 4.0;
pub const SkSurfaceProps_kMinGammaInclusive: SkScalar = 0.0;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkSurfaceProps"][::core::mem::size_of::<SkSurfaceProps>() - 16usize];
    ["Alignment of SkSurfaceProps"][::core::mem::align_of::<SkSurfaceProps>() - 4usize];
    ["Offset of field: SkSurfaceProps::fFlags"]
        [::core::mem::offset_of!(SkSurfaceProps, fFlags) - 0usize];
    ["Offset of field: SkSurfaceProps::fPixelGeometry"]
        [::core::mem::offset_of!(SkSurfaceProps, fPixelGeometry) - 4usize];
    ["Offset of field: SkSurfaceProps::fTextContrast"]
        [::core::mem::offset_of!(SkSurfaceProps, fTextContrast) - 8usize];
    ["Offset of field: SkSurfaceProps::fTextGamma"]
        [::core::mem::offset_of!(SkSurfaceProps, fTextGamma) - 12usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}??0SkSurfaceProps@@QEAA@XZ"]
    pub fn SkSurfaceProps_SkSurfaceProps(this: *mut SkSurfaceProps);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkSurfaceProps@@QEAA@IW4SkPixelGeometry@@@Z"]
    pub fn SkSurfaceProps_SkSurfaceProps1(
        this: *mut SkSurfaceProps,
        flags: u32,
        arg1: SkPixelGeometry,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkSurfaceProps@@QEAA@IW4SkPixelGeometry@@MM@Z"]
    pub fn SkSurfaceProps_SkSurfaceProps2(
        this: *mut SkSurfaceProps,
        flags: u32,
        arg1: SkPixelGeometry,
        textContrast: SkScalar,
        textGamma: SkScalar,
    );
}
impl SkSurfaceProps {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkSurfaceProps_SkSurfaceProps(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(flags: u32, arg1: SkPixelGeometry) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkSurfaceProps_SkSurfaceProps1(__bindgen_tmp.as_mut_ptr(), flags, arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(
        flags: u32,
        arg1: SkPixelGeometry,
        textContrast: SkScalar,
        textGamma: SkScalar,
    ) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkSurfaceProps_SkSurfaceProps2(
            __bindgen_tmp.as_mut_ptr(),
            flags,
            arg1,
            textContrast,
            textGamma,
        );
        __bindgen_tmp.assume_init()
    }
}
impl SkTileMode {
    pub const LastTileMode: SkTileMode = SkTileMode::Decal;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkTileMode {
    Clamp = 0,
    Repeat = 1,
    Mirror = 2,
    Decal = 3,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct SkDeque {
    pub _bindgen_opaque_blob: [u64; 7usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkDeque_Block {
    _unused: [u8; 0],
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct SkDeque_Iter {
    pub _bindgen_opaque_blob: [u64; 3usize],
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkDeque_Iter_IterStart {
    kFront_IterStart = 0,
    kBack_IterStart = 1,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkDeque_Iter"][::core::mem::size_of::<SkDeque_Iter>() - 24usize];
    ["Alignment of SkDeque_Iter"][::core::mem::align_of::<SkDeque_Iter>() - 8usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?next@Iter@SkDeque@@QEAAPEAXXZ"]
    pub fn SkDeque_Iter_next(this: *mut SkDeque_Iter) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "\u{1}?prev@Iter@SkDeque@@QEAAPEAXXZ"]
    pub fn SkDeque_Iter_prev(this: *mut SkDeque_Iter) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "\u{1}?reset@Iter@SkDeque@@QEAAXAEBV2@W4IterStart@12@@Z"]
    pub fn SkDeque_Iter_reset(
        this: *mut SkDeque_Iter,
        d: *const SkDeque,
        startLoc: SkDeque_Iter_IterStart,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}??0Iter@SkDeque@@QEAA@XZ"]
    pub fn SkDeque_Iter_Iter(this: *mut SkDeque_Iter);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0Iter@SkDeque@@QEAA@AEBV1@W4IterStart@01@@Z"]
    pub fn SkDeque_Iter_Iter1(
        this: *mut SkDeque_Iter,
        d: *const SkDeque,
        startLoc: SkDeque_Iter_IterStart,
    );
}
impl SkDeque_Iter {
    #[inline]
    pub unsafe fn next(&mut self) -> *mut ::core::ffi::c_void {
        SkDeque_Iter_next(self)
    }
    #[inline]
    pub unsafe fn prev(&mut self) -> *mut ::core::ffi::c_void {
        SkDeque_Iter_prev(self)
    }
    #[inline]
    pub unsafe fn reset(&mut self, d: *const SkDeque, startLoc: SkDeque_Iter_IterStart) {
        SkDeque_Iter_reset(self, d, startLoc)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkDeque_Iter_Iter(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(d: *const SkDeque, startLoc: SkDeque_Iter_IterStart) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkDeque_Iter_Iter1(__bindgen_tmp.as_mut_ptr(), d, startLoc);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct SkDeque_F2BIter {
    pub _bindgen_opaque_blob: [u64; 3usize],
}
pub type SkDeque_F2BIter_INHERITED = SkDeque_Iter;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkDeque_F2BIter"][::core::mem::size_of::<SkDeque_F2BIter>() - 24usize];
    ["Alignment of SkDeque_F2BIter"][::core::mem::align_of::<SkDeque_F2BIter>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkDeque"][::core::mem::size_of::<SkDeque>() - 56usize];
    ["Alignment of SkDeque"][::core::mem::align_of::<SkDeque>() - 8usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?push_front@SkDeque@@QEAAPEAXXZ"]
    pub fn SkDeque_push_front(this: *mut SkDeque) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "\u{1}?push_back@SkDeque@@QEAAPEAXXZ"]
    pub fn SkDeque_push_back(this: *mut SkDeque) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "\u{1}?pop_front@SkDeque@@QEAAXXZ"]
    pub fn SkDeque_pop_front(this: *mut SkDeque);
}
unsafe extern "C" {
    #[link_name = "\u{1}?pop_back@SkDeque@@QEAAXXZ"]
    pub fn SkDeque_pop_back(this: *mut SkDeque);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkDeque@@QEAA@_KH@Z"]
    pub fn SkDeque_SkDeque(this: *mut SkDeque, elemSize: usize, allocCount: ::core::ffi::c_int);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0SkDeque@@QEAA@_KPEAX0H@Z"]
    pub fn SkDeque_SkDeque1(
        this: *mut SkDeque,
        elemSize: usize,
        storage: *mut ::core::ffi::c_void,
        storageSize: usize,
        allocCount: ::core::ffi::c_int,
    );
}
impl SkDeque {
    #[inline]
    pub unsafe fn push_front(&mut self) -> *mut ::core::ffi::c_void {
        SkDeque_push_front(self)
    }
    #[inline]
    pub unsafe fn push_back(&mut self) -> *mut ::core::ffi::c_void {
        SkDeque_push_back(self)
    }
    #[inline]
    pub unsafe fn pop_front(&mut self) {
        SkDeque_pop_front(self)
    }
    #[inline]
    pub unsafe fn pop_back(&mut self) {
        SkDeque_pop_back(self)
    }
    #[inline]
    pub unsafe fn new(elemSize: usize, allocCount: ::core::ffi::c_int) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkDeque_SkDeque(__bindgen_tmp.as_mut_ptr(), elemSize, allocCount);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        elemSize: usize,
        storage: *mut ::core::ffi::c_void,
        storageSize: usize,
        allocCount: ::core::ffi::c_int,
    ) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkDeque_SkDeque1(
            __bindgen_tmp.as_mut_ptr(),
            elemSize,
            storage,
            storageSize,
            allocCount,
        );
        __bindgen_tmp.assume_init()
    }
}
pub type skia_private_TArray_value_type<T> = T;
pub type skia_private_STArray_Storage = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct skia_private_AutoTMalloc {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sktext_GlyphRunBuilder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sktext_GlyphRunList {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sktext_gpu_Slug {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GrRecordingContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkDevice {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkMesh {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkSpecialImage {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkSurface_Base {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkDrawShadowRec {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct skgpu_graphite_Recorder {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct SkCanvas__bindgen_vtable(::core::ffi::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct SkCanvas {
    pub vtable_: *const SkCanvas__bindgen_vtable,
    pub fMCRecStorage: [std_byte; 3072usize],
    pub fMCStack: SkDeque,
    pub fMCRec: *mut SkCanvas_MCRec,
    pub fRootDevice: sk_sp<SkDevice>,
    pub fProps: SkSurfaceProps,
    pub fSaveCount: ::core::ffi::c_int,
    pub fAllocator: u64,
    pub fSurfaceBase: *mut SkSurface_Base,
    pub fClipRestrictionRect: SkIRect,
    pub fClipRestrictionSaveCount: ::core::ffi::c_int,
    pub fQuickRejectBounds: SkRect,
    pub fScratchGlyphRunBuilder: u64,
}
pub const SkCanvas_SaveLayerFlagsSet_kPreserveLCDText_SaveLayerFlag: SkCanvas_SaveLayerFlagsSet = 2;
pub const SkCanvas_SaveLayerFlagsSet_kInitWithPrevious_SaveLayerFlag: SkCanvas_SaveLayerFlagsSet =
    4;
pub const SkCanvas_SaveLayerFlagsSet_kF16ColorType: SkCanvas_SaveLayerFlagsSet = 16;
pub type SkCanvas_SaveLayerFlagsSet = ::core::ffi::c_int;
pub type SkCanvas_SaveLayerFlags = u32;
pub type SkCanvas_FilterSpan = SkSpan<sk_sp<SkImageFilter>>;
#[repr(C)]
#[derive(Debug)]
pub struct SkCanvas_SaveLayerRec {
    pub fBounds: *const SkRect,
    pub fPaint: *const SkPaint,
    pub fFilters: SkCanvas_FilterSpan,
    pub fBackdrop: *const SkImageFilter,
    pub fBackdropTileMode: SkTileMode,
    pub fColorSpace: *const SkColorSpace,
    pub fSaveLayerFlags: SkCanvas_SaveLayerFlags,
    pub fExperimentalBackdropScale: SkScalar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCanvas_SaveLayerRec"][::core::mem::size_of::<SkCanvas_SaveLayerRec>() - 64usize];
    ["Alignment of SkCanvas_SaveLayerRec"]
        [::core::mem::align_of::<SkCanvas_SaveLayerRec>() - 8usize];
    ["Offset of field: SkCanvas_SaveLayerRec::fBounds"]
        [::core::mem::offset_of!(SkCanvas_SaveLayerRec, fBounds) - 0usize];
    ["Offset of field: SkCanvas_SaveLayerRec::fPaint"]
        [::core::mem::offset_of!(SkCanvas_SaveLayerRec, fPaint) - 8usize];
    ["Offset of field: SkCanvas_SaveLayerRec::fFilters"]
        [::core::mem::offset_of!(SkCanvas_SaveLayerRec, fFilters) - 16usize];
    ["Offset of field: SkCanvas_SaveLayerRec::fBackdrop"]
        [::core::mem::offset_of!(SkCanvas_SaveLayerRec, fBackdrop) - 32usize];
    ["Offset of field: SkCanvas_SaveLayerRec::fBackdropTileMode"]
        [::core::mem::offset_of!(SkCanvas_SaveLayerRec, fBackdropTileMode) - 40usize];
    ["Offset of field: SkCanvas_SaveLayerRec::fColorSpace"]
        [::core::mem::offset_of!(SkCanvas_SaveLayerRec, fColorSpace) - 48usize];
    ["Offset of field: SkCanvas_SaveLayerRec::fSaveLayerFlags"]
        [::core::mem::offset_of!(SkCanvas_SaveLayerRec, fSaveLayerFlags) - 56usize];
    ["Offset of field: SkCanvas_SaveLayerRec::fExperimentalBackdropScale"]
        [::core::mem::offset_of!(SkCanvas_SaveLayerRec, fExperimentalBackdropScale) - 60usize];
};
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCanvas_PointMode {
    Points = 0,
    Lines = 1,
    Polygon = 2,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCanvas_SrcRectConstraint {
    Strict = 0,
    Fast = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkCanvas_Lattice {
    pub fXDivs: *const ::core::ffi::c_int,
    pub fYDivs: *const ::core::ffi::c_int,
    pub fRectTypes: *const SkCanvas_Lattice_RectType,
    pub fXCount: ::core::ffi::c_int,
    pub fYCount: ::core::ffi::c_int,
    pub fBounds: *const SkIRect,
    pub fColors: *const SkColor,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCanvas_Lattice_RectType {
    Default = 0,
    Transparent = 1,
    FixedColor = 2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCanvas_Lattice"][::core::mem::size_of::<SkCanvas_Lattice>() - 48usize];
    ["Alignment of SkCanvas_Lattice"][::core::mem::align_of::<SkCanvas_Lattice>() - 8usize];
    ["Offset of field: SkCanvas_Lattice::fXDivs"]
        [::core::mem::offset_of!(SkCanvas_Lattice, fXDivs) - 0usize];
    ["Offset of field: SkCanvas_Lattice::fYDivs"]
        [::core::mem::offset_of!(SkCanvas_Lattice, fYDivs) - 8usize];
    ["Offset of field: SkCanvas_Lattice::fRectTypes"]
        [::core::mem::offset_of!(SkCanvas_Lattice, fRectTypes) - 16usize];
    ["Offset of field: SkCanvas_Lattice::fXCount"]
        [::core::mem::offset_of!(SkCanvas_Lattice, fXCount) - 24usize];
    ["Offset of field: SkCanvas_Lattice::fYCount"]
        [::core::mem::offset_of!(SkCanvas_Lattice, fYCount) - 28usize];
    ["Offset of field: SkCanvas_Lattice::fBounds"]
        [::core::mem::offset_of!(SkCanvas_Lattice, fBounds) - 32usize];
    ["Offset of field: SkCanvas_Lattice::fColors"]
        [::core::mem::offset_of!(SkCanvas_Lattice, fColors) - 40usize];
};
pub const SkCanvas_QuadAAFlags_kLeft_QuadAAFlag: SkCanvas_QuadAAFlags = 1;
pub const SkCanvas_QuadAAFlags_kTop_QuadAAFlag: SkCanvas_QuadAAFlags = 2;
pub const SkCanvas_QuadAAFlags_kRight_QuadAAFlag: SkCanvas_QuadAAFlags = 4;
pub const SkCanvas_QuadAAFlags_kBottom_QuadAAFlag: SkCanvas_QuadAAFlags = 8;
pub const SkCanvas_QuadAAFlags_kNone_QuadAAFlags: SkCanvas_QuadAAFlags = 0;
pub const SkCanvas_QuadAAFlags_kAll_QuadAAFlags: SkCanvas_QuadAAFlags = 15;
pub type SkCanvas_QuadAAFlags = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug)]
pub struct SkCanvas_ImageSetEntry {
    pub fImage: sk_sp<SkImage>,
    pub fSrcRect: SkRect,
    pub fDstRect: SkRect,
    pub fMatrixIndex: ::core::ffi::c_int,
    pub fAlpha: f32,
    pub fAAFlags: ::core::ffi::c_uint,
    pub fHasClip: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCanvas_ImageSetEntry"][::core::mem::size_of::<SkCanvas_ImageSetEntry>() - 56usize];
    ["Alignment of SkCanvas_ImageSetEntry"]
        [::core::mem::align_of::<SkCanvas_ImageSetEntry>() - 8usize];
    ["Offset of field: SkCanvas_ImageSetEntry::fImage"]
        [::core::mem::offset_of!(SkCanvas_ImageSetEntry, fImage) - 0usize];
    ["Offset of field: SkCanvas_ImageSetEntry::fSrcRect"]
        [::core::mem::offset_of!(SkCanvas_ImageSetEntry, fSrcRect) - 8usize];
    ["Offset of field: SkCanvas_ImageSetEntry::fDstRect"]
        [::core::mem::offset_of!(SkCanvas_ImageSetEntry, fDstRect) - 24usize];
    ["Offset of field: SkCanvas_ImageSetEntry::fMatrixIndex"]
        [::core::mem::offset_of!(SkCanvas_ImageSetEntry, fMatrixIndex) - 40usize];
    ["Offset of field: SkCanvas_ImageSetEntry::fAlpha"]
        [::core::mem::offset_of!(SkCanvas_ImageSetEntry, fAlpha) - 44usize];
    ["Offset of field: SkCanvas_ImageSetEntry::fAAFlags"]
        [::core::mem::offset_of!(SkCanvas_ImageSetEntry, fAAFlags) - 48usize];
    ["Offset of field: SkCanvas_ImageSetEntry::fHasClip"]
        [::core::mem::offset_of!(SkCanvas_ImageSetEntry, fHasClip) - 52usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}??0ImageSetEntry@SkCanvas@@QEAA@V?$sk_sp@$$CBVSkImage@@@@AEBUSkRect@@1HMI_N@Z"]
    pub fn SkCanvas_ImageSetEntry_ImageSetEntry(
        this: *mut SkCanvas_ImageSetEntry,
        image: sk_sp<SkImage>,
        srcRect: *const SkRect,
        dstRect: *const SkRect,
        matrixIndex: ::core::ffi::c_int,
        alpha: f32,
        aaFlags: ::core::ffi::c_uint,
        hasClip: bool,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}??0ImageSetEntry@SkCanvas@@QEAA@V?$sk_sp@$$CBVSkImage@@@@AEBUSkRect@@1MI@Z"]
    pub fn SkCanvas_ImageSetEntry_ImageSetEntry1(
        this: *mut SkCanvas_ImageSetEntry,
        image: sk_sp<SkImage>,
        srcRect: *const SkRect,
        dstRect: *const SkRect,
        alpha: f32,
        aaFlags: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}??0ImageSetEntry@SkCanvas@@QEAA@XZ"]
    pub fn SkCanvas_ImageSetEntry_ImageSetEntry2(this: *mut SkCanvas_ImageSetEntry);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0ImageSetEntry@SkCanvas@@QEAA@AEBU01@@Z"]
    pub fn SkCanvas_ImageSetEntry_ImageSetEntry3(
        this: *mut SkCanvas_ImageSetEntry,
        arg1: *const SkCanvas_ImageSetEntry,
    );
}
impl SkCanvas_ImageSetEntry {
    #[inline]
    pub unsafe fn new(
        image: sk_sp<SkImage>,
        srcRect: *const SkRect,
        dstRect: *const SkRect,
        matrixIndex: ::core::ffi::c_int,
        alpha: f32,
        aaFlags: ::core::ffi::c_uint,
        hasClip: bool,
    ) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCanvas_ImageSetEntry_ImageSetEntry(
            __bindgen_tmp.as_mut_ptr(),
            image,
            srcRect,
            dstRect,
            matrixIndex,
            alpha,
            aaFlags,
            hasClip,
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(
        image: sk_sp<SkImage>,
        srcRect: *const SkRect,
        dstRect: *const SkRect,
        alpha: f32,
        aaFlags: ::core::ffi::c_uint,
    ) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCanvas_ImageSetEntry_ImageSetEntry1(
            __bindgen_tmp.as_mut_ptr(),
            image,
            srcRect,
            dstRect,
            alpha,
            aaFlags,
        );
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2() -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCanvas_ImageSetEntry_ImageSetEntry2(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new3(arg1: *const SkCanvas_ImageSetEntry) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCanvas_ImageSetEntry_ImageSetEntry3(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCanvas_SaveLayerStrategy {
    kFullLayer_SaveLayerStrategy = 0,
    kNoLayer_SaveLayerStrategy = 1,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCanvas_ClipEdgeStyle {
    kHard_ClipEdgeStyle = 0,
    kSoft_ClipEdgeStyle = 1,
}
pub const SkCanvas_PredrawFlags_kNone: SkCanvas_PredrawFlags = 0;
pub const SkCanvas_PredrawFlags_kOpaqueShaderOverride: SkCanvas_PredrawFlags = 1;
pub const SkCanvas_PredrawFlags_kNonOpaqueShaderOverride: SkCanvas_PredrawFlags = 2;
pub const SkCanvas_PredrawFlags_kCheckForOverwrite: SkCanvas_PredrawFlags = 4;
pub const SkCanvas_PredrawFlags_kSkipMaskFilterAutoLayer: SkCanvas_PredrawFlags = 8;
pub type SkCanvas_PredrawFlags = ::core::ffi::c_uint;
#[repr(C)]
pub struct SkCanvas_Layer {
    pub fDevice: sk_sp<SkDevice>,
    pub fImageFilters: __BindgenOpaqueArray<u64, 3usize>,
    pub fPaint: SkPaint,
    pub fIsCoverage: bool,
    pub fDiscard: bool,
    pub fIncludesPadding: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCanvas_Layer"][::core::mem::size_of::<SkCanvas_Layer>() - 120usize];
    ["Alignment of SkCanvas_Layer"][::core::mem::align_of::<SkCanvas_Layer>() - 8usize];
    ["Offset of field: SkCanvas_Layer::fDevice"]
        [::core::mem::offset_of!(SkCanvas_Layer, fDevice) - 0usize];
    ["Offset of field: SkCanvas_Layer::fImageFilters"]
        [::core::mem::offset_of!(SkCanvas_Layer, fImageFilters) - 8usize];
    ["Offset of field: SkCanvas_Layer::fPaint"]
        [::core::mem::offset_of!(SkCanvas_Layer, fPaint) - 32usize];
    ["Offset of field: SkCanvas_Layer::fIsCoverage"]
        [::core::mem::offset_of!(SkCanvas_Layer, fIsCoverage) - 112usize];
    ["Offset of field: SkCanvas_Layer::fDiscard"]
        [::core::mem::offset_of!(SkCanvas_Layer, fDiscard) - 113usize];
    ["Offset of field: SkCanvas_Layer::fIncludesPadding"]
        [::core::mem::offset_of!(SkCanvas_Layer, fIncludesPadding) - 114usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}??0Layer@SkCanvas@@QEAA@V?$sk_sp@VSkDevice@@@@V?$SkSpan@V?$sk_sp@VSkImageFilter@@@@@@AEBVSkPaint@@_N3@Z"]
    pub fn SkCanvas_Layer_Layer(
        this: *mut SkCanvas_Layer,
        device: sk_sp<SkDevice>,
        imageFilters: SkCanvas_FilterSpan,
        paint: *const SkPaint,
        isCoverage: bool,
        includesPadding: bool,
    );
}
impl SkCanvas_Layer {
    #[inline]
    pub unsafe fn new(
        device: sk_sp<SkDevice>,
        imageFilters: SkCanvas_FilterSpan,
        paint: *const SkPaint,
        isCoverage: bool,
        includesPadding: bool,
    ) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCanvas_Layer_Layer(
            __bindgen_tmp.as_mut_ptr(),
            device,
            imageFilters,
            paint,
            isCoverage,
            includesPadding,
        );
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct SkCanvas_BackImage {
    pub fImage: sk_sp<SkSpecialImage>,
    pub fLoc: SkIPoint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCanvas_BackImage"][::core::mem::size_of::<SkCanvas_BackImage>() - 16usize];
    ["Alignment of SkCanvas_BackImage"][::core::mem::align_of::<SkCanvas_BackImage>() - 8usize];
    ["Offset of field: SkCanvas_BackImage::fImage"]
        [::core::mem::offset_of!(SkCanvas_BackImage, fImage) - 0usize];
    ["Offset of field: SkCanvas_BackImage::fLoc"]
        [::core::mem::offset_of!(SkCanvas_BackImage, fLoc) - 8usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}??0BackImage@SkCanvas@@QEAA@V?$sk_sp@VSkSpecialImage@@@@USkIPoint@@@Z"]
    pub fn SkCanvas_BackImage_BackImage(
        this: *mut SkCanvas_BackImage,
        arg1: sk_sp<SkSpecialImage>,
        arg2: SkIPoint,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}??0BackImage@SkCanvas@@QEAA@AEBU01@@Z"]
    pub fn SkCanvas_BackImage_BackImage1(
        this: *mut SkCanvas_BackImage,
        arg1: *const SkCanvas_BackImage,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}??0BackImage@SkCanvas@@QEAA@$$QEAU01@@Z"]
    pub fn SkCanvas_BackImage_BackImage2(
        this: *mut SkCanvas_BackImage,
        arg1: *mut SkCanvas_BackImage,
    );
}
impl SkCanvas_BackImage {
    #[inline]
    pub unsafe fn new(arg1: sk_sp<SkSpecialImage>, arg2: SkIPoint) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCanvas_BackImage_BackImage(__bindgen_tmp.as_mut_ptr(), arg1, arg2);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: *const SkCanvas_BackImage) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCanvas_BackImage_BackImage1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new2(arg1: *mut SkCanvas_BackImage) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCanvas_BackImage_BackImage2(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct SkCanvas_MCRec {
    pub fLayer: u64,
    pub fDevice: *mut SkDevice,
    pub fBackImage: u64,
    pub fMatrix: SkM44,
    pub fDeferredSaveCount: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCanvas_MCRec"][::core::mem::size_of::<SkCanvas_MCRec>() - 96usize];
    ["Alignment of SkCanvas_MCRec"][::core::mem::align_of::<SkCanvas_MCRec>() - 8usize];
    ["Offset of field: SkCanvas_MCRec::fLayer"]
        [::core::mem::offset_of!(SkCanvas_MCRec, fLayer) - 0usize];
    ["Offset of field: SkCanvas_MCRec::fDevice"]
        [::core::mem::offset_of!(SkCanvas_MCRec, fDevice) - 8usize];
    ["Offset of field: SkCanvas_MCRec::fBackImage"]
        [::core::mem::offset_of!(SkCanvas_MCRec, fBackImage) - 16usize];
    ["Offset of field: SkCanvas_MCRec::fMatrix"]
        [::core::mem::offset_of!(SkCanvas_MCRec, fMatrix) - 24usize];
    ["Offset of field: SkCanvas_MCRec::fDeferredSaveCount"]
        [::core::mem::offset_of!(SkCanvas_MCRec, fDeferredSaveCount) - 88usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?newLayer@MCRec@SkCanvas@@QEAAXV?$sk_sp@VSkDevice@@@@V?$SkSpan@V?$sk_sp@VSkImageFilter@@@@@@AEBVSkPaint@@_N3@Z"]
    pub fn SkCanvas_MCRec_newLayer(
        this: *mut SkCanvas_MCRec,
        layerDevice: sk_sp<SkDevice>,
        filters: SkCanvas_FilterSpan,
        restorePaint: *const SkPaint,
        layerIsCoverage: bool,
        includesPadding: bool,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?reset@MCRec@SkCanvas@@QEAAXPEAVSkDevice@@@Z"]
    pub fn SkCanvas_MCRec_reset(this: *mut SkCanvas_MCRec, device: *mut SkDevice);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0MCRec@SkCanvas@@QEAA@PEAVSkDevice@@@Z"]
    pub fn SkCanvas_MCRec_MCRec(this: *mut SkCanvas_MCRec, device: *mut SkDevice);
}
unsafe extern "C" {
    #[link_name = "\u{1}??0MCRec@SkCanvas@@QEAA@PEBV01@@Z"]
    pub fn SkCanvas_MCRec_MCRec1(this: *mut SkCanvas_MCRec, prev: *const SkCanvas_MCRec);
}
impl SkCanvas_MCRec {
    #[inline]
    pub unsafe fn newLayer(
        &mut self,
        layerDevice: sk_sp<SkDevice>,
        filters: SkCanvas_FilterSpan,
        restorePaint: *const SkPaint,
        layerIsCoverage: bool,
        includesPadding: bool,
    ) {
        SkCanvas_MCRec_newLayer(
            self,
            layerDevice,
            filters,
            restorePaint,
            layerIsCoverage,
            includesPadding,
        )
    }
    #[inline]
    pub unsafe fn reset(&mut self, device: *mut SkDevice) {
        SkCanvas_MCRec_reset(self, device)
    }
    #[inline]
    pub unsafe fn new(device: *mut SkDevice) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCanvas_MCRec_MCRec(__bindgen_tmp.as_mut_ptr(), device);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(prev: *const SkCanvas_MCRec) -> Self {
        let mut __bindgen_tmp = ::core::mem::MaybeUninit::uninit();
        SkCanvas_MCRec_MCRec1(__bindgen_tmp.as_mut_ptr(), prev);
        __bindgen_tmp.assume_init()
    }
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SkCanvas_DeviceCompatibleWithFilter {
    kUnknown = 0,
    kYes = 1,
    kYesWithPadding = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SkCanvas_AutoUpdateQRBounds {
    _unused: [u8; 0],
}
pub const SkCanvas_kMaxFiltersPerLayer: ::core::ffi::c_int = 16;
pub const SkCanvas_kMCRecCount: ::core::ffi::c_int = 32;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SkCanvas"][::core::mem::size_of::<SkCanvas>() - 3240usize];
    ["Alignment of SkCanvas"][::core::mem::align_of::<SkCanvas>() - 8usize];
    ["Offset of field: SkCanvas::fMCRecStorage"]
        [::core::mem::offset_of!(SkCanvas, fMCRecStorage) - 8usize];
    ["Offset of field: SkCanvas::fMCStack"]
        [::core::mem::offset_of!(SkCanvas, fMCStack) - 3080usize];
    ["Offset of field: SkCanvas::fMCRec"][::core::mem::offset_of!(SkCanvas, fMCRec) - 3136usize];
    ["Offset of field: SkCanvas::fRootDevice"]
        [::core::mem::offset_of!(SkCanvas, fRootDevice) - 3144usize];
    ["Offset of field: SkCanvas::fProps"][::core::mem::offset_of!(SkCanvas, fProps) - 3152usize];
    ["Offset of field: SkCanvas::fSaveCount"]
        [::core::mem::offset_of!(SkCanvas, fSaveCount) - 3168usize];
    ["Offset of field: SkCanvas::fAllocator"]
        [::core::mem::offset_of!(SkCanvas, fAllocator) - 3176usize];
    ["Offset of field: SkCanvas::fSurfaceBase"]
        [::core::mem::offset_of!(SkCanvas, fSurfaceBase) - 3184usize];
    ["Offset of field: SkCanvas::fClipRestrictionRect"]
        [::core::mem::offset_of!(SkCanvas, fClipRestrictionRect) - 3192usize];
    ["Offset of field: SkCanvas::fClipRestrictionSaveCount"]
        [::core::mem::offset_of!(SkCanvas, fClipRestrictionSaveCount) - 3208usize];
    ["Offset of field: SkCanvas::fQuickRejectBounds"]
        [::core::mem::offset_of!(SkCanvas, fQuickRejectBounds) - 3212usize];
    ["Offset of field: SkCanvas::fScratchGlyphRunBuilder"]
        [::core::mem::offset_of!(SkCanvas, fScratchGlyphRunBuilder) - 3232usize];
};
unsafe extern "C" {
    #[link_name = "\u{1}?MakeRasterDirect@SkCanvas@@SA?AV?$unique_ptr@VSkCanvas@@U?$default_delete@VSkCanvas@@@std@@@std@@AEBUSkImageInfo@@PEAX_KPEBVSkSurfaceProps@@@Z"]
    pub fn SkCanvas_MakeRasterDirect(
        info: *const SkImageInfo,
        pixels: *mut ::core::ffi::c_void,
        rowBytes: usize,
        props: *const SkSurfaceProps,
    ) -> u64;
}
unsafe extern "C" {
    #[link_name = "\u{1}?imageInfo@SkCanvas@@QEBA?AUSkImageInfo@@XZ"]
    pub fn SkCanvas_imageInfo(this: *const SkCanvas) -> SkImageInfo;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getProps@SkCanvas@@QEBA_NPEAVSkSurfaceProps@@@Z"]
    pub fn SkCanvas_getProps(this: *const SkCanvas, props: *mut SkSurfaceProps) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getBaseProps@SkCanvas@@QEBA?AVSkSurfaceProps@@XZ"]
    pub fn SkCanvas_getBaseProps(this: *const SkCanvas) -> SkSurfaceProps;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getTopProps@SkCanvas@@QEBA?AVSkSurfaceProps@@XZ"]
    pub fn SkCanvas_getTopProps(this: *const SkCanvas) -> SkSurfaceProps;
}
unsafe extern "C" {
    #[link_name = "\u{1}?makeSurface@SkCanvas@@QEAA?AV?$sk_sp@VSkSurface@@@@AEBUSkImageInfo@@PEBVSkSurfaceProps@@@Z"]
    pub fn SkCanvas_makeSurface(
        this: *mut SkCanvas,
        info: *const SkImageInfo,
        props: *const SkSurfaceProps,
    ) -> sk_sp<SkSurface>;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getSurface@SkCanvas@@QEBAPEAVSkSurface@@XZ"]
    pub fn SkCanvas_getSurface(this: *const SkCanvas) -> *mut SkSurface;
}
unsafe extern "C" {
    #[link_name = "\u{1}?accessTopLayerPixels@SkCanvas@@QEAAPEAXPEAUSkImageInfo@@PEA_KPEAUSkIPoint@@@Z"]
    pub fn SkCanvas_accessTopLayerPixels(
        this: *mut SkCanvas,
        info: *mut SkImageInfo,
        rowBytes: *mut usize,
        origin: *mut SkIPoint,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "\u{1}?accessTopRasterHandle@SkCanvas@@QEBAPEAXXZ"]
    pub fn SkCanvas_accessTopRasterHandle(this: *const SkCanvas) -> SkRasterHandleAllocator_Handle;
}
unsafe extern "C" {
    #[link_name = "\u{1}?peekPixels@SkCanvas@@QEAA_NPEAVSkPixmap@@@Z"]
    pub fn SkCanvas_peekPixels(this: *mut SkCanvas, pixmap: *mut SkPixmap) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?readPixels@SkCanvas@@QEAA_NAEBUSkImageInfo@@PEAX_KHH@Z"]
    pub fn SkCanvas_readPixels(
        this: *mut SkCanvas,
        dstInfo: *const SkImageInfo,
        dstPixels: *mut ::core::ffi::c_void,
        dstRowBytes: usize,
        srcX: ::core::ffi::c_int,
        srcY: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?readPixels@SkCanvas@@QEAA_NAEBVSkPixmap@@HH@Z"]
    pub fn SkCanvas_readPixels1(
        this: *mut SkCanvas,
        pixmap: *const SkPixmap,
        srcX: ::core::ffi::c_int,
        srcY: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?readPixels@SkCanvas@@QEAA_NAEBVSkBitmap@@HH@Z"]
    pub fn SkCanvas_readPixels2(
        this: *mut SkCanvas,
        bitmap: *const SkBitmap,
        srcX: ::core::ffi::c_int,
        srcY: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?writePixels@SkCanvas@@QEAA_NAEBUSkImageInfo@@PEBX_KHH@Z"]
    pub fn SkCanvas_writePixels(
        this: *mut SkCanvas,
        info: *const SkImageInfo,
        pixels: *const ::core::ffi::c_void,
        rowBytes: usize,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?writePixels@SkCanvas@@QEAA_NAEBVSkBitmap@@HH@Z"]
    pub fn SkCanvas_writePixels1(
        this: *mut SkCanvas,
        bitmap: *const SkBitmap,
        x: ::core::ffi::c_int,
        y: ::core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?save@SkCanvas@@QEAAHXZ"]
    pub fn SkCanvas_save(this: *mut SkCanvas) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?saveLayer@SkCanvas@@QEAAHPEBUSkRect@@PEBVSkPaint@@@Z"]
    pub fn SkCanvas_saveLayer(
        this: *mut SkCanvas,
        bounds: *const SkRect,
        paint: *const SkPaint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?saveLayerAlphaf@SkCanvas@@QEAAHPEBUSkRect@@M@Z"]
    pub fn SkCanvas_saveLayerAlphaf(
        this: *mut SkCanvas,
        bounds: *const SkRect,
        alpha: f32,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?saveLayer@SkCanvas@@QEAAHAEBUSaveLayerRec@1@@Z"]
    pub fn SkCanvas_saveLayer1(
        this: *mut SkCanvas,
        layerRec: *const SkCanvas_SaveLayerRec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?restore@SkCanvas@@QEAAXXZ"]
    pub fn SkCanvas_restore(this: *mut SkCanvas);
}
unsafe extern "C" {
    #[link_name = "\u{1}?getSaveCount@SkCanvas@@QEBAHXZ"]
    pub fn SkCanvas_getSaveCount(this: *const SkCanvas) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}?restoreToCount@SkCanvas@@QEAAXH@Z"]
    pub fn SkCanvas_restoreToCount(this: *mut SkCanvas, saveCount: ::core::ffi::c_int);
}
unsafe extern "C" {
    #[link_name = "\u{1}?translate@SkCanvas@@QEAAXMM@Z"]
    pub fn SkCanvas_translate(this: *mut SkCanvas, dx: SkScalar, dy: SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?scale@SkCanvas@@QEAAXMM@Z"]
    pub fn SkCanvas_scale(this: *mut SkCanvas, sx: SkScalar, sy: SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?rotate@SkCanvas@@QEAAXM@Z"]
    pub fn SkCanvas_rotate(this: *mut SkCanvas, degrees: SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?rotate@SkCanvas@@QEAAXMMM@Z"]
    pub fn SkCanvas_rotate1(this: *mut SkCanvas, degrees: SkScalar, px: SkScalar, py: SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?skew@SkCanvas@@QEAAXMM@Z"]
    pub fn SkCanvas_skew(this: *mut SkCanvas, sx: SkScalar, sy: SkScalar);
}
unsafe extern "C" {
    #[link_name = "\u{1}?concat@SkCanvas@@QEAAXAEBVSkMatrix@@@Z"]
    pub fn SkCanvas_concat(this: *mut SkCanvas, matrix: *const SkMatrix);
}
unsafe extern "C" {
    #[link_name = "\u{1}?concat@SkCanvas@@QEAAXAEBVSkM44@@@Z"]
    pub fn SkCanvas_concat1(this: *mut SkCanvas, arg1: *const SkM44);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setMatrix@SkCanvas@@QEAAXAEBVSkM44@@@Z"]
    pub fn SkCanvas_setMatrix(this: *mut SkCanvas, matrix: *const SkM44);
}
unsafe extern "C" {
    #[link_name = "\u{1}?setMatrix@SkCanvas@@QEAAXAEBVSkMatrix@@@Z"]
    pub fn SkCanvas_setMatrix1(this: *mut SkCanvas, matrix: *const SkMatrix);
}
unsafe extern "C" {
    #[link_name = "\u{1}?resetMatrix@SkCanvas@@QEAAXXZ"]
    pub fn SkCanvas_resetMatrix(this: *mut SkCanvas);
}
unsafe extern "C" {
    #[link_name = "\u{1}?clipRect@SkCanvas@@QEAAXAEBUSkRect@@W4SkClipOp@@_N@Z"]
    pub fn SkCanvas_clipRect(
        this: *mut SkCanvas,
        rect: *const SkRect,
        op: SkClipOp,
        doAntiAlias: bool,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?androidFramework_setDeviceClipRestriction@SkCanvas@@QEAAXAEBUSkIRect@@@Z"]
    pub fn SkCanvas_androidFramework_setDeviceClipRestriction(
        this: *mut SkCanvas,
        rect: *const SkIRect,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?clipRRect@SkCanvas@@QEAAXAEBVSkRRect@@W4SkClipOp@@_N@Z"]
    pub fn SkCanvas_clipRRect(
        this: *mut SkCanvas,
        rrect: *const SkRRect,
        op: SkClipOp,
        doAntiAlias: bool,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?clipPath@SkCanvas@@QEAAXAEBVSkPath@@W4SkClipOp@@_N@Z"]
    pub fn SkCanvas_clipPath(
        this: *mut SkCanvas,
        path: *const SkPath,
        op: SkClipOp,
        doAntiAlias: bool,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?clipShader@SkCanvas@@QEAAXV?$sk_sp@VSkShader@@@@W4SkClipOp@@@Z"]
    pub fn SkCanvas_clipShader(this: *mut SkCanvas, arg1: sk_sp<SkShader>, arg2: SkClipOp);
}
unsafe extern "C" {
    #[link_name = "\u{1}?clipRegion@SkCanvas@@QEAAXAEBVSkRegion@@W4SkClipOp@@@Z"]
    pub fn SkCanvas_clipRegion(this: *mut SkCanvas, deviceRgn: *const SkRegion, op: SkClipOp);
}
unsafe extern "C" {
    #[link_name = "\u{1}?quickReject@SkCanvas@@QEBA_NAEBUSkRect@@@Z"]
    pub fn SkCanvas_quickReject(this: *const SkCanvas, rect: *const SkRect) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?quickReject@SkCanvas@@QEBA_NAEBVSkPath@@@Z"]
    pub fn SkCanvas_quickReject1(this: *const SkCanvas, path: *const SkPath) -> bool;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getLocalClipBounds@SkCanvas@@QEBA?AUSkRect@@XZ"]
    pub fn SkCanvas_getLocalClipBounds(this: *const SkCanvas) -> SkRect;
}
unsafe extern "C" {
    #[link_name = "\u{1}?getDeviceClipBounds@SkCanvas@@QEBA?AUSkIRect@@XZ"]
    pub fn SkCanvas_getDeviceClipBounds(this: *const SkCanvas) -> SkIRect;
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawColor@SkCanvas@@QEAAXAEBU?$SkRGBA4f@$02@@W4SkBlendMode@@@Z"]
    pub fn SkCanvas_drawColor(this: *mut SkCanvas, color: *const SkColor4f, mode: SkBlendMode);
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawPaint@SkCanvas@@QEAAXAEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawPaint(this: *mut SkCanvas, paint: *const SkPaint);
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawPoints@SkCanvas@@QEAAXW4PointMode@1@V?$SkSpan@$$CBUSkPoint@@@@AEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawPoints(
        this: *mut SkCanvas,
        mode: SkCanvas_PointMode,
        arg1: SkSpan<SkPoint>,
        paint: *const SkPaint,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawPoint@SkCanvas@@QEAAXMMAEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawPoint(this: *mut SkCanvas, x: SkScalar, y: SkScalar, paint: *const SkPaint);
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawLine@SkCanvas@@QEAAXMMMMAEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawLine(
        this: *mut SkCanvas,
        x0: SkScalar,
        y0: SkScalar,
        x1: SkScalar,
        y1: SkScalar,
        paint: *const SkPaint,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawRect@SkCanvas@@QEAAXAEBUSkRect@@AEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawRect(this: *mut SkCanvas, rect: *const SkRect, paint: *const SkPaint);
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawRegion@SkCanvas@@QEAAXAEBVSkRegion@@AEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawRegion(this: *mut SkCanvas, region: *const SkRegion, paint: *const SkPaint);
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawOval@SkCanvas@@QEAAXAEBUSkRect@@AEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawOval(this: *mut SkCanvas, oval: *const SkRect, paint: *const SkPaint);
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawRRect@SkCanvas@@QEAAXAEBVSkRRect@@AEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawRRect(this: *mut SkCanvas, rrect: *const SkRRect, paint: *const SkPaint);
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawDRRect@SkCanvas@@QEAAXAEBVSkRRect@@0AEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawDRRect(
        this: *mut SkCanvas,
        outer: *const SkRRect,
        inner: *const SkRRect,
        paint: *const SkPaint,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawCircle@SkCanvas@@QEAAXMMMAEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawCircle(
        this: *mut SkCanvas,
        cx: SkScalar,
        cy: SkScalar,
        radius: SkScalar,
        paint: *const SkPaint,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawArc@SkCanvas@@QEAAXAEBUSkRect@@MM_NAEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawArc(
        this: *mut SkCanvas,
        oval: *const SkRect,
        startAngle: SkScalar,
        sweepAngle: SkScalar,
        useCenter: bool,
        paint: *const SkPaint,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawRoundRect@SkCanvas@@QEAAXAEBUSkRect@@MMAEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawRoundRect(
        this: *mut SkCanvas,
        rect: *const SkRect,
        rx: SkScalar,
        ry: SkScalar,
        paint: *const SkPaint,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawPath@SkCanvas@@QEAAXAEBVSkPath@@AEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawPath(this: *mut SkCanvas, path: *const SkPath, paint: *const SkPaint);
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawImage@SkCanvas@@QEAAXPEBVSkImage@@MMAEBUSkSamplingOptions@@PEBVSkPaint@@@Z"]
    pub fn SkCanvas_drawImage(
        this: *mut SkCanvas,
        arg1: *const SkImage,
        x: SkScalar,
        y: SkScalar,
        arg2: *const SkSamplingOptions,
        arg3: *const SkPaint,
    );
}
unsafe extern "C" {
    #[link_name = "\u{1}?drawImageRect@SkCanvas@@QEAAXPEBVSkImage@@AEBUSkRect@@1AEBUSkSamplingOptions@@PEBVSkPaint@@W4SrcRectConstraint@1@@Z"]
    pub fn SkCanvas_drawImageRect(
        this: *mut SkCanvas,
        arg1: *const SkImage,
        src: *const SkRect,
        dst: *const SkRect,
        arg2: *const SkSamplingOptions,
        arg3: *const SkPaint,
        arg4: SkCanvas_SrcRectConstraint,
    );
}
